doc/Changelog.org
#+OPTIONS: H:4 num:nil toc:3
#+SETUPFILE: ~/git/org-html-themes/setup/theme-readtheorg.setup
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="kbd-style.css"/>

* 0.6.0
:PROPERTIES:
:CUSTOM_ID: 0.6.0
:END:
-----
** Fixes
:PROPERTIES:
:CUSTOM_ID: 0-6-0-fixes
:END:
