doc/Changelog.org
*** =swiper-avy= should use only the current window
:PROPERTIES:
:CUSTOM_ID: 0-6-0-fx-swiper-avy-should-use-only-the-current-window
:END:
Not all windows. See [[https://github.com/abo-abo/swiper/issues/117][#117]].
-----
