Changelog.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-04-25 Mon 14:51 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta name="generator" content="Org-mode" />
<meta name="author" content="oleh" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="kbd-style.css"/>
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#0.6.0">0.6.0</a>
<ul>
<li><a href="#0-6-0-fixes">Fixes</a>
<ul>
<li><a href="#0-6-0-fx-swiper-avy-should-use-only-the-current-window"><code>swiper-avy</code> should use only the current window</a></li>
<li><a href="#0-6-0-fx-fix-wrap-around-for-ivy-next-line">fix wrap-around for <code>ivy-next-line</code></a></li>
<li><a href="#0-6-0-fx-swiper-avy-should-do-nothing-for-empty-input"><code>swiper-avy</code> should do nothing for empty input</a></li>
<li><a href="#0-6-0-fx-ivy-alt-done-should-require-tramp-if-necessary"><code>ivy-alt-done</code> should require TRAMP if necessary</a></li>
<li><a href="#0-6-0-fx-swiper-query-replace-shouldnt-miss-the-first-occurrence"><code>swiper-query-replace</code> shouldn't miss the first occurrence</a></li>
<li><a href="#0-6-0-fx-swiper-should-not-deactivate-mark"><code>swiper</code> should not deactivate mark</a></li>
<li><a href="#0-6-0-fx-ivy-mode-should-not-switch-to-tramp-for-certain-input"><code>ivy-mode</code> should not switch to TRAMP for certain input</a></li>
<li><a href="#0-6-0-fx-counsel-find-file-should-work-better-with-tramp"><code>counsel-find-file</code> should work better with TRAMP</a></li>
<li><a href="#0-6-0-fx-counsel-find-file-supports-windows-drive-letters"><code>counsel-find-file</code> supports Windows drive letters</a></li>
<li><a href="#0-6-0-fx-counsel-file-file-should-work-better-with-files-that-contain-"><code>counsel-file-file</code> should work better with files that contain "~"</a></li>
<li><a href="#0-6-0-fx-counsel-m-x-should-respect-ivy-format-function"><code>counsel-M-x</code> should respect <code>ivy-format-function</code></a></li>
<li><a href="#0-6-0-fx-counsel-git-grep-should-position-better-on-exit"><code>counsel-git-grep</code> should position better on exit</a></li>
<li><a href="#0-6-0-fx-ivy-mode-should-re-scale-text-to-minibuffer-height"><code>ivy-mode</code> should re-scale text to minibuffer height</a></li>
<li><a href="#0-6-0-fx-counsel-unicode-char-should-use-action-style-call"><code>counsel-unicode-char</code> should use action-style call</a></li>
<li><a href="#0-6-0-fx-ivy-read-should-allow--in-prompt-string"><code>ivy-read</code> should allow % in prompt string</a></li>
<li><a href="#0-6-0-fx-ivy-call-should-execute-in-proper-window"><code>ivy-call</code> should execute in proper window</a></li>
</ul>
</li>
<li><a href="#0-6-0-fx-new-features">New Features</a>
<ul>
<li><a href="#0-6-0-nf-ivy-mode"><code>ivy-mode</code></a></li>
<li><a href="#0-6-0-nf-counsel-describe-function-and-counsel-decribe-variable"><code>counsel-describe-function</code> and <code>counsel-decribe-variable</code></a></li>
<li><a href="#0-6-0-nf-ivy-switch-buffer"><code>ivy-switch-buffer</code></a></li>
<li><a href="#0-6-0-nf-counsel-git-grep"><code>counsel-git-grep</code></a></li>
<li><a href="#0-6-0-nf-swiper"><code>swiper</code></a></li>
<li><a href="#0-6-0-nf-counsel-el"><code>counsel-el</code></a></li>
<li><a href="#0-6-0-nf-counsel-locate"><code>counsel-locate</code></a></li>
<li><a href="#0-6-0-nf-api">API</a></li>
</ul>
</li>
<li><a href="#0-6-0-nf-new-commands">New Commands</a>
<ul>
<li><a href="#0-6-0-nc-ivy-call"><code>ivy-call</code></a></li>
<li><a href="#0-6-0-nc-counsel-find-file"><code>counsel-find-file</code></a></li>
<li><a href="#0-6-0-nc-ivy-recentf"><code>ivy-recentf</code></a></li>
<li><a href="#0-6-0-nc-ivy-yank-word"><code>ivy-yank-word</code></a></li>
<li><a href="#0-6-0-nc-counsel-m-x"><code>counsel-M-x</code></a></li>
<li><a href="#0-6-0-nc-hydra-ivy"><code>hydra-ivy</code></a></li>
<li><a href="#0-6-0-nc-ivy-toggle-calling"><code>ivy-toggle-calling</code></a></li>
<li><a href="#0-6-0-nc-ivy-insert-current"><code>ivy-insert-current</code></a></li>
<li><a href="#0-6-0-nc-counsel-load-theme"><code>counsel-load-theme</code></a></li>
<li><a href="#0-6-0-nc-ivy-reverse-i-search"><code>ivy-reverse-i-search</code></a></li>
<li><a href="#0-6-0-nc-counsel-rhythmbox"><code>counsel-rhythmbox</code></a></li>
<li><a href="#0-6-0-nc-ivy-dispatching-done"><code>ivy-dispatching-done</code></a></li>
<li><a href="#0-6-0-nc-counsel-org-tag"><code>counsel-org-tag</code></a></li>
<li><a href="#0-6-0-nc-counsel-org-tag-agenda"><code>counsel-org-tag-agenda</code></a></li>
<li><a href="#0-6-0-nc-counsel-ag"><code>counsel-ag</code></a></li>
<li><a href="#0-6-0-nc-counsel-recoll"><code>counsel-recoll</code></a></li>
<li><a href="#0-6-0-nc-swiper-from-isearch"><code>swiper-from-isearch</code></a></li>
<li><a href="#0-6-0-nc-ivy-immediate-done"><code>ivy-immediate-done</code></a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#0.7.0">0.7.0</a>
<ul>
<li><a href="#0-7-0-fixes">Fixes</a>
<ul>
<li><a href="#0-7-0-fx-fix-dynamic-collection-not-being-sorted">Fix :dynamic-collection not being sorted</a></li>
<li><a href="#0-7-0-fx-when-initial-input-contains-a-plus,-escape-it">When :initial-input contains a plus, escape it</a></li>
<li><a href="#0-7-0-fx-set-line-spacing-to-0-in-the-minibuffer">Set line-spacing to 0 in the minibuffer</a></li>
<li><a href="#0-7-0-fx-enlarge-the-minibuffer-window-if-the-candidate-list-doesnt-fit">Enlarge the minibuffer window if the candidate list doesn't fit</a></li>
<li><a href="#0-7-0-fx-fix-minibuffer-collapsing-to-one-line">Fix minibuffer collapsing to one line</a></li>
<li><a href="#0-7-0-fx-use-minibuffer-allow-text-properties">Use minibuffer-allow-text-properties</a></li>
<li><a href="#0-7-0-fx-improve-c-g-out-of-a-long-running-async-process">Improve <kbd>C-g</kbd> out of a long-running async process</a></li>
<li><a href="#0-7-0-fx-dont-regexp-quote-preselect">Don't regexp-quote :preselect</a></li>
<li><a href="#0-7-0-fx-fix-ivy-partial-for-fuzzy-completion">Fix ivy-partial for fuzzy completion</a></li>
<li><a href="#0-7-0-fx-ivy-resume-should-pass-caller">ivy-resume should pass :caller</a></li>
<li><a href="#0-7-0-fx-fix-the-regression-in-perfect-match-logic">Fix the regression in perfect match logic</a></li>
<li><a href="#0-7-0-fx-fix-pasting-file-paths-on-windows">Fix pasting file paths on Windows</a></li>
<li><a href="#0-7-0-fx-c-j-should-no-stop-completion-for-a-pasted-file-path"><kbd>C-j</kbd> should no stop completion for a pasted file path</a></li>
<li><a href="#0-7-0-fx-c-m-j-should-use-ivy--directory"><kbd>C-M-j</kbd> should use <code>ivy--directory</code></a></li>
<li><a href="#0-7-0-fx-use-a-specific-blend-method-for-dark-themes">Use a specific blend method for dark themes</a></li>
<li><a href="#0-7-0-fx-fix-one-off-bug-in-ivy-scroll-up-command-and-ivy-scroll-down-command">Fix one-off bug in <code>ivy-scroll-up-command</code> and <code>ivy-scroll-down-command</code></a></li>
<li><a href="#0-7-0-fx-m-o-shouldnt-set-the-action-permanently"><kbd>M-o</kbd> shouldn't set the action permanently</a></li>
<li><a href="#0-7-0-fx-fix-swiper-preselect-issue-with-similar-or-identical-lines">Fix swiper preselect issue with similar or identical lines</a></li>
<li><a href="#0-7-0-fx-make-ivy-completing-read-handle-history-as-cons">Make ivy-completing-read handle history as cons</a></li>
<li><a href="#0-7-0-fx-perform-string-match-in-the-original-buffer">Perform string-match in the original buffer</a></li>
</ul>
</li>
<li><a href="#0-7-0-fx-new-features">New Features</a>
<ul>
<li><a href="#0-7-0-nf-swiper"><code>swiper</code></a></li>
<li><a href="#0-7-0-nf-ivy"><code>ivy</code></a></li>
<li><a href="#0-7-0-nf-ivy-hydra"><code>ivy-hydra</code></a></li>
<li><a href="#0-7-0-nf-ivy-switch-buffer"><code>ivy-switch-buffer</code></a></li>
<li><a href="#0-7-0-nf-counsel-locate"><code>counsel-locate</code></a></li>
<li><a href="#0-7-0-nf-counsel-org-tag"><code>counsel-org-tag</code></a></li>
<li><a href="#0-7-0-nf-counsel-unicode-char"><code>counsel-unicode-char</code></a></li>
<li><a href="#0-7-0-nf-counsel-m-x"><code>counsel-M-x</code></a></li>
<li><a href="#0-7-0-nf-counsel-find-file"><code>counsel-find-file</code></a></li>
<li><a href="#0-7-0-nf-counsel-git-grep"><code>counsel-git-grep</code></a></li>
<li><a href="#0-7-0-nf-counsel--find-symbol"><code>counsel--find-symbol</code></a></li>
<li><a href="#0-7-0-nf-counsel-ag"><code>counsel-ag</code></a></li>
</ul>
</li>
<li><a href="#0-7-0-nf-new-commands">New Commands</a>
<ul>
<li><a href="#0-7-0-nc-ivy-occur"><code>ivy-occur</code></a></li>
<li><a href="#0-7-0-nc-ivy-avy"><code>ivy-avy</code></a></li>
<li><a href="#0-7-0-nc-ivy-kill-ring-save"><code>ivy-kill-ring-save</code></a></li>
<li><a href="#0-7-0-nc-ivy-dispatching-call"><code>ivy-dispatching-call</code></a></li>
<li><a href="#0-7-0-nc-ivy-read-action"><code>ivy-read-action</code></a></li>
<li><a href="#0-7-0-nc-swiper-multi"><code>swiper-multi</code></a></li>
<li><a href="#0-7-0-nc-swiper-mc"><code>swiper-mc</code></a></li>
<li><a href="#0-7-0-nc-swiper-all"><code>swiper-all</code></a></li>
<li><a href="#0-7-0-nc-counsel-grep"><code>counsel-grep</code></a></li>
<li><a href="#0-7-0-nc-counsel-git-grep-query-replace"><code>counsel-git-grep-query-replace</code></a></li>
<li><a href="#0-7-0-nc-counsel-jedi"><code>counsel-jedi</code></a></li>
<li><a href="#0-7-0-nc-counsel-cl"><code>counsel-cl</code></a></li>
<li><a href="#0-7-0-nc-counsel-yank-pop"><code>counsel-yank-pop</code></a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#0.8.0">0.8.0</a>
<ul>
<li><a href="#0-8-0-package-rename">Package rename</a></li>
<li><a href="#0-8-0-documentation">Documentation</a></li>
<li><a href="#0-8-0-fixes">Fixes</a>
<ul>
<li><a href="#0-8-0-fx-ivy-read"><code>ivy-read</code></a></li>
<li><a href="#0-8-0-fx-ivy-occur"><code>ivy-occur</code></a></li>
<li><a href="#0-8-0-fx-ivy--resize-minibuffer-to-fit"><code>ivy--resize-minibuffer-to-fit</code></a></li>
<li><a href="#0-8-0-fx-ivy-completing-read"><code>ivy-completing-read</code></a></li>
<li><a href="#0-8-0-fx-ivy--regex-plus"><code>ivy--regex-plus</code></a></li>
<li><a href="#0-8-0-fx-ivy--get-window"><code>ivy--get-window</code></a></li>
<li><a href="#0-8-0-fx-ivy--recompute-index"><code>ivy--recompute-index</code></a></li>
<li><a href="#0-8-0-fx-ivy-reverse-i-search"><code>ivy-reverse-i-search</code></a></li>
<li><a href="#0-8-0-fx-ivy--reset-state"><code>ivy--reset-state</code></a></li>
<li><a href="#0-8-0-fx-ivy-completion-in-region"><code>ivy-completion-in-region</code></a></li>
<li><a href="#0-8-0-fx-ivy-read-action"><code>ivy-read-action</code></a></li>
<li><a href="#0-8-0-fx-ivy-count-format"><code>ivy-count-format</code></a></li>
<li><a href="#0-8-0-fx-ivy-switch-buffer"><code>ivy-switch-buffer</code></a></li>
<li><a href="#0-8-0-fx-ivy-next-history-element"><code>ivy-next-history-element</code></a></li>
<li><a href="#0-8-0-fx-ivy-occur-press"><code>ivy-occur-press</code></a></li>
<li><a href="#0-8-0-fx-ivy-resume"><code>ivy-resume</code></a></li>
<li><a href="#0-8-0-fx-ivy-avy"><code>ivy-avy</code></a></li>
<li><a href="#0-8-0-fx-ivy-dispatching-done"><code>ivy-dispatching-done</code></a></li>
<li><a href="#0-8-0-fx-swiper"><code>swiper</code></a></li>
<li><a href="#0-8-0-fx-swiper-font-lock-ensure"><code>swiper-font-lock-ensure</code></a></li>
<li><a href="#0-8-0-fx-swiper--multi-candidates"><code>swiper--multi-candidates</code></a></li>
<li><a href="#0-8-0-fx-counsel--async-sentinel"><code>counsel--async-sentinel</code></a></li>
<li><a href="#0-8-0-fx-counsel-git"><code>counsel-git</code></a></li>
<li><a href="#0-8-0-fx-counsel-recoll"><code>counsel-recoll</code></a></li>
<li><a href="#0-8-0-fx-compilation-warnings">compilation warnings</a></li>
</ul>
</li>
<li><a href="#0-8-0-fx-new-features">New Features</a>
<ul>
<li><a href="#0-8-0-nf-ivy-read"><code>ivy-read</code></a></li>
<li><a href="#0-8-0-nf-ivy-mode"><code>ivy-mode</code></a></li>
<li><a href="#0-8-0-nf-ivy-set-occur"><code>ivy-set-occur</code></a></li>
<li><a href="#0-8-0-nf-ivy-occur-mode"><code>ivy-occur-mode</code></a></li>
<li><a href="#0-8-0-nf-ivy-re-builders-alist"><code>ivy-re-builders-alist</code></a></li>
<li><a href="#0-8-0-nf-ivy-set-actions"><code>ivy-set-actions</code></a></li>
<li><a href="#0-8-0-nf-ivy-faces"><code>ivy-faces</code></a></li>
<li><a href="#0-8-0-nf-ivy-flx-limit"><code>ivy-flx-limit</code></a></li>
<li><a href="#0-8-0-nf-ivy-inhibit-action"><code>ivy-inhibit-action</code></a></li>
<li><a href="#0-8-0-nf-ivy-do-completion-in-region"><code>ivy-do-completion-in-region</code></a></li>
<li><a href="#0-8-0-nf-ivy-fixed-height-minibuffer"><code>ivy-fixed-height-minibuffer</code></a></li>
<li><a href="#0-8-0-nf-ivy-set-display-transformer"><code>ivy-set-display-transformer</code></a></li>
<li><a href="#0-8-0-nf-ivy-ignore-buffers"><code>ivy-ignore-buffers</code></a></li>
<li><a href="#0-8-0-nf-ivy-add-newline-after-prompt"><code>ivy-add-newline-after-prompt</code></a></li>
<li><a href="#0-8-0-nf-ivy-switch-buffer"><code>ivy-switch-buffer</code></a></li>
<li><a href="#0-8-0-nf-ivy-use-ignore-default"><code>ivy-use-ignore-default</code></a></li>
<li><a href="#0-8-0-nf-swiper"><code>swiper</code></a></li>
<li><a href="#0-8-0-nf-swiper-font-lock-exclude"><code>swiper-font-lock-exclude</code></a></li>
<li><a href="#0-8-0-nf-swiper-all"><code>swiper-all</code></a></li>
<li><a href="#0-8-0-nf-counsel-mode"><code>counsel-mode</code></a></li>
<li><a href="#0-8-0-nf-counsel-find-file"><code>counsel-find-file</code></a></li>
<li><a href="#0-8-0-nf-counsel-git-grep"><code>counsel-git-grep</code></a></li>
<li><a href="#0-8-0-nf-counsel-locate"><code>counsel-locate</code></a></li>
<li><a href="#0-8-0-nf-counsel-yank-pop"><code>counsel-yank-pop</code></a></li>
<li><a href="#0-8-0-nf-counsel-unicode-char"><code>counsel-unicode-char</code></a></li>
<li><a href="#0-8-0-nf-counsel-rhythmbox"><code>counsel-rhythmbox</code></a></li>
<li><a href="#0-8-0-nf-counsel-ag"><code>counsel-ag</code></a></li>
<li><a href="#0-8-0-nf-counsel-async-split-string-re"><code>counsel-async-split-string-re</code></a></li>
<li><a href="#0-8-0-nf-counsel--async-cmd"><code>counsel--async-cmd</code></a></li>
<li><a href="#0-8-0-nf-counsel-prompt-function"><code>counsel-prompt-function</code></a></li>
<li><a href="#0-8-0-nf-counsel-grep"><code>counsel-grep</code></a></li>
<li><a href="#0-8-0-nf-counsel-m-x"><code>counsel-M-x</code></a></li>
</ul>
</li>
<li><a href="#0-8-0-nf-new-commands">New Commands</a>
<ul>
<li><a href="#0-8-0-nc-counsel-tmm"><code>counsel-tmm</code></a></li>
<li><a href="#0-8-0-nc-counsel-imenu"><code>counsel-imenu</code></a></li>
<li><a href="#0-8-0-nc-counsel-decbinds"><code>counsel-decbinds</code></a></li>
<li><a href="#0-8-0-nc-counsel-list-processes"><code>counsel-list-processes</code></a></li>
<li><a href="#0-8-0-nc-ivy-switch-buffer-other-window"><code>ivy-switch-buffer-other-window</code></a></li>
<li><a href="#0-8-0-nc-counsel-git-stash"><code>counsel-git-stash</code></a></li>
<li><a href="#0-8-0-nc-counsel-git-log"><code>counsel-git-log</code></a></li>
<li><a href="#0-8-0-nc-counsel-pt"><code>counsel-pt</code></a></li>
<li><a href="#0-8-0-nc-counsel-linux-app"><code>counsel-linux-app</code></a></li>
<li><a href="#0-8-0-nc-counsel-ace-link"><code>counsel-ace-link</code></a></li>
<li><a href="#0-8-0-nc-counsel-esh-history"><code>counsel-esh-history</code></a></li>
<li><a href="#0-8-0-nc-counsel-shell-history"><code>counsel-shell-history</code></a></li>
<li><a href="#0-8-0-nc-counsel-grep-or-swiper"><code>counsel-grep-or-swiper</code></a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgbe707d5" class="outline-2">
<h2 id="0.6.0"><a id="orgbe707d5"></a>0.6.0</h2>
<div class="outline-text-2" id="text-0.6.0">
<hr  />
</div>
<div id="outline-container-orgc9849d3" class="outline-3">
<h3 id="0-6-0-fixes"><a id="orgc9849d3"></a>Fixes</h3>
<div class="outline-text-3" id="text-0-6-0-fixes">
</div>
<div id="outline-container-org7e3ff6" class="outline-4">
<h4 id="0-6-0-fx-swiper-avy-should-use-only-the-current-window"><a id="org7e3ff6"></a><code>swiper-avy</code> should use only the current window</h4>
<div class="outline-text-4" id="text-0-6-0-fx-swiper-avy-should-use-only-the-current-window">
<p>
Not all windows. See <a href="https://github.com/abo-abo/swiper/issues/117">#117</a>.
</p>
<hr  />
</div>
</div>
