doc/Changelog.org
*** fix wrap-around for =ivy-next-line=
:PROPERTIES:
:CUSTOM_ID: 0-6-0-fx-fix-wrap-around-for-ivy-next-line
:END:
See [[https://github.com/abo-abo/swiper/issues/118][#118]].
-----
*** =swiper-avy= should do nothing for empty input
:PROPERTIES:
:CUSTOM_ID: 0-6-0-fx-swiper-avy-should-do-nothing-for-empty-input
:END:
See [[https://github.com/abo-abo/avy/issues/50][#50]].
-----
*** =ivy-alt-done= should require TRAMP if necessary
:PROPERTIES:
:CUSTOM_ID: 0-6-0-fx-ivy-alt-done-should-require-tramp-if-necessary
:END:
See [[https://github.com/abo-abo/swiper/pull/145][#145]].
-----
*** =swiper-query-replace= shouldn't miss the first occurrence
:PROPERTIES:
:CUSTOM_ID: 0-6-0-fx-swiper-query-replace-shouldnt-miss-the-first-occurrence
:END:
See [[https://github.com/abo-abo/swiper/pull/144][#144]].
-----
*** =swiper= should not deactivate mark
:PROPERTIES:
:CUSTOM_ID: 0-6-0-fx-swiper-should-not-deactivate-mark
:END:
*** =ivy-mode= should not switch to TRAMP for certain input
:PROPERTIES:
:CUSTOM_ID: 0-6-0-fx-ivy-mode-should-not-switch-to-tramp-for-certain-input
:END:
See [[https://github.com/abo-abo/swiper/pull/145][#145]].
-----
*** =counsel-find-file= should work better with TRAMP
:PROPERTIES:
:CUSTOM_ID: 0-6-0-fx-counsel-find-file-should-work-better-with-tramp
:END:
"/ssh:foo" should not be cut off
See [[https://github.com/abo-abo/swiper/pull/145][#145]].
-----
*** =counsel-find-file= supports Windows drive letters
:PROPERTIES:
:CUSTOM_ID: 0-6-0-fx-counsel-find-file-supports-windows-drive-letters
:END:
See [[https://github.com/abo-abo/swiper/pull/155][#155]].
-----
*** =counsel-file-file= should work better with files that contain "~"
:PROPERTIES:
:CUSTOM_ID: 0-6-0-fx-counsel-file-file-should-work-better-with-files-that-contain-
:END:
See [[https://github.com/abo-abo/swiper/pull/157][#157]].
-----
*** =counsel-M-x= should respect =ivy-format-function=
:PROPERTIES:
:CUSTOM_ID: 0-6-0-fx-counsel-m-x-should-respect-ivy-format-function
:END:
See [[https://github.com/abo-abo/swiper/pull/150][#150]].
-----
*** =counsel-git-grep= should position better on exit
:PROPERTIES:
:CUSTOM_ID: 0-6-0-fx-counsel-git-grep-should-position-better-on-exit
:END:
See [[https://github.com/abo-abo/swiper/pull/153][#153]].
-----
*** =ivy-mode= should re-scale text to minibuffer height
:PROPERTIES:
:CUSTOM_ID: 0-6-0-fx-ivy-mode-should-re-scale-text-to-minibuffer-height
:END:
See [[https://github.com/abo-abo/swiper/pull/151][#151]].
-----
*** =counsel-unicode-char= should use action-style call
:PROPERTIES:
:CUSTOM_ID: 0-6-0-fx-counsel-unicode-char-should-use-action-style-call
:END:
See [[https://github.com/abo-abo/swiper/pull/160][#160]].
-----
*** =ivy-read= should allow % in prompt string
:PROPERTIES:
:CUSTOM_ID: 0-6-0-fx-ivy-read-should-allow--in-prompt-string
:END:
See [[https://github.com/abo-abo/swiper/pull/171][#171]].
-----
*** =ivy-call= should execute in proper window
:PROPERTIES:
:CUSTOM_ID: 0-6-0-fx-ivy-call-should-execute-in-proper-window
:END:
See [[https://github.com/abo-abo/swiper/pull/176][#176]].
** New Features
:PROPERTIES:
:CUSTOM_ID: 0-6-0-fx-new-features
:END:
*** =ivy-mode=
:PROPERTIES:
:CUSTOM_ID: 0-6-0-nf-ivy-mode
:END:
**** Open an Info file on the file system
When in =Info-mode=, press ~g~ and select either "(./)" or "(../)" to
switch to file name completion. That file will be opened with Info.
-----
**** Account for =minibuffer-depth-indication-mode=
If you have =minibuffer-depth-indication-mode= on, the minibuffer
prompt will indicate the current depth.
See [[https://github.com/abo-abo/swiper/pull/134][#134]].
-----
**** Add fuzzy matching function
To enable fuzzy matching, set your =ivy-re-builders-alist= accordingly:
#+begin_src elisp
(setq ivy-re-builders-alist
      '((t . ivy--regex-fuzzy)))
#+end_src
See [[https://github.com/abo-abo/swiper/pull/136][#136]].

See also [[https://github.com/abo-abo/swiper/pull/142][#142]] for toggling fuzzy matching with ~C-o m~.
-----
**** =case-fold-search= optimization
Bind case-fold-search to t when the input is all lower-case:

- input "the" matches both "the" and "The".
- input "The" matches only "The".

See [[https://github.com/abo-abo/swiper/pull/166][#166]].
-----
**** Allow to see the candidate index a la =anzu= via =ivy-count-format=
To have this feature, use something like this:
#+begin_src elisp
(setq ivy-count-format "(%d/%d) ")
#+end_src
See [[https://github.com/abo-abo/swiper/pull/167][#167]].

You can also set this to "", if you don't want any count, see [[https://github.com/abo-abo/swiper/pull/188][#188]].
-----
**** Allow to add additional exit points for any command
Example for =ivy-switch-to-buffer=:
#+begin_src elisp
(ivy-set-actions
 'ivy-switch-buffer
 '(("k"
    (lambda (x)
      (kill-buffer x)
      (ivy--reset-state ivy-last))
    "kill")
   ("j"
    ivy--switch-buffer-other-window-action
    "other")))
#+end_src

After this:

- use ~M-o k~ to kill a buffer
- use ~M-o j~ to switch to a buffer in other window

You can always use ~M-o o~ to access the default action. When there is
only one action, ~M-o~ does the same as ~C-m~.

See [[https://github.com/abo-abo/swiper/pull/164][#164]].








-----
*** =counsel-describe-function= and =counsel-decribe-variable=
:PROPERTIES:
:CUSTOM_ID: 0-6-0-nf-counsel-describe-function-and-counsel-decribe-variable
:END:
