Changelog.html
<div id="outline-container-org29ab822" class="outline-4">
<h4 id="0-6-0-fx-fix-wrap-around-for-ivy-next-line"><a id="org29ab822"></a>fix wrap-around for <code>ivy-next-line</code></h4>
<div class="outline-text-4" id="text-0-6-0-fx-fix-wrap-around-for-ivy-next-line">
<p>
See <a href="https://github.com/abo-abo/swiper/issues/118">#118</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-orga4019a9" class="outline-4">
<h4 id="0-6-0-fx-swiper-avy-should-do-nothing-for-empty-input"><a id="orga4019a9"></a><code>swiper-avy</code> should do nothing for empty input</h4>
<div class="outline-text-4" id="text-0-6-0-fx-swiper-avy-should-do-nothing-for-empty-input">
<p>
See <a href="https://github.com/abo-abo/avy/issues/50">#50</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org85ac4c2" class="outline-4">
<h4 id="0-6-0-fx-ivy-alt-done-should-require-tramp-if-necessary"><a id="org85ac4c2"></a><code>ivy-alt-done</code> should require TRAMP if necessary</h4>
<div class="outline-text-4" id="text-0-6-0-fx-ivy-alt-done-should-require-tramp-if-necessary">
<p>
See <a href="https://github.com/abo-abo/swiper/pull/145">#145</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-orgd3f1fdb" class="outline-4">
<h4 id="0-6-0-fx-swiper-query-replace-shouldnt-miss-the-first-occurrence"><a id="orgd3f1fdb"></a><code>swiper-query-replace</code> shouldn't miss the first occurrence</h4>
<div class="outline-text-4" id="text-0-6-0-fx-swiper-query-replace-shouldnt-miss-the-first-occurrence">
<p>
See <a href="https://github.com/abo-abo/swiper/pull/144">#144</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org4afa185" class="outline-4">
<h4 id="0-6-0-fx-swiper-should-not-deactivate-mark"><a id="org4afa185"></a><code>swiper</code> should not deactivate mark</h4>
<div class="outline-text-4" id="text-0-6-0-fx-swiper-should-not-deactivate-mark">
</div>
</div>
<div id="outline-container-org848b083" class="outline-4">
<h4 id="0-6-0-fx-ivy-mode-should-not-switch-to-tramp-for-certain-input"><a id="org848b083"></a><code>ivy-mode</code> should not switch to TRAMP for certain input</h4>
<div class="outline-text-4" id="text-0-6-0-fx-ivy-mode-should-not-switch-to-tramp-for-certain-input">
<p>
See <a href="https://github.com/abo-abo/swiper/pull/145">#145</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org5919e61" class="outline-4">
<h4 id="0-6-0-fx-counsel-find-file-should-work-better-with-tramp"><a id="org5919e61"></a><code>counsel-find-file</code> should work better with TRAMP</h4>
<div class="outline-text-4" id="text-0-6-0-fx-counsel-find-file-should-work-better-with-tramp">
<p>
"/ssh:foo" should not be cut off
See <a href="https://github.com/abo-abo/swiper/pull/145">#145</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-orgf30b054" class="outline-4">
<h4 id="0-6-0-fx-counsel-find-file-supports-windows-drive-letters"><a id="orgf30b054"></a><code>counsel-find-file</code> supports Windows drive letters</h4>
<div class="outline-text-4" id="text-0-6-0-fx-counsel-find-file-supports-windows-drive-letters">
<p>
See <a href="https://github.com/abo-abo/swiper/pull/155">#155</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-orga1b6e73" class="outline-4">
<h4 id="0-6-0-fx-counsel-file-file-should-work-better-with-files-that-contain-"><a id="orga1b6e73"></a><code>counsel-file-file</code> should work better with files that contain "~"</h4>
<div class="outline-text-4" id="text-0-6-0-fx-counsel-file-file-should-work-better-with-files-that-contain-">
<p>
See <a href="https://github.com/abo-abo/swiper/pull/157">#157</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-orgcc616bb" class="outline-4">
<h4 id="0-6-0-fx-counsel-m-x-should-respect-ivy-format-function"><a id="orgcc616bb"></a><code>counsel-M-x</code> should respect <code>ivy-format-function</code></h4>
<div class="outline-text-4" id="text-0-6-0-fx-counsel-m-x-should-respect-ivy-format-function">
<p>
See <a href="https://github.com/abo-abo/swiper/pull/150">#150</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-orgc2679e0" class="outline-4">
<h4 id="0-6-0-fx-counsel-git-grep-should-position-better-on-exit"><a id="orgc2679e0"></a><code>counsel-git-grep</code> should position better on exit</h4>
<div class="outline-text-4" id="text-0-6-0-fx-counsel-git-grep-should-position-better-on-exit">
<p>
See <a href="https://github.com/abo-abo/swiper/pull/153">#153</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org5c26c4f" class="outline-4">
<h4 id="0-6-0-fx-ivy-mode-should-re-scale-text-to-minibuffer-height"><a id="org5c26c4f"></a><code>ivy-mode</code> should re-scale text to minibuffer height</h4>
<div class="outline-text-4" id="text-0-6-0-fx-ivy-mode-should-re-scale-text-to-minibuffer-height">
<p>
See <a href="https://github.com/abo-abo/swiper/pull/151">#151</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-orgde6cfd1" class="outline-4">
<h4 id="0-6-0-fx-counsel-unicode-char-should-use-action-style-call"><a id="orgde6cfd1"></a><code>counsel-unicode-char</code> should use action-style call</h4>
<div class="outline-text-4" id="text-0-6-0-fx-counsel-unicode-char-should-use-action-style-call">
<p>
See <a href="https://github.com/abo-abo/swiper/pull/160">#160</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-orgafc528f" class="outline-4">
<h4 id="0-6-0-fx-ivy-read-should-allow--in-prompt-string"><a id="orgafc528f"></a><code>ivy-read</code> should allow % in prompt string</h4>
<div class="outline-text-4" id="text-0-6-0-fx-ivy-read-should-allow--in-prompt-string">
<p>
See <a href="https://github.com/abo-abo/swiper/pull/171">#171</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-orgef8f980" class="outline-4">
<h4 id="0-6-0-fx-ivy-call-should-execute-in-proper-window"><a id="orgef8f980"></a><code>ivy-call</code> should execute in proper window</h4>
<div class="outline-text-4" id="text-0-6-0-fx-ivy-call-should-execute-in-proper-window">
<p>
See <a href="https://github.com/abo-abo/swiper/pull/176">#176</a>.
</p>
</div>
</div>
</div>
<div id="outline-container-orge75a720" class="outline-3">
<h3 id="0-6-0-fx-new-features"><a id="orge75a720"></a>New Features</h3>
<div class="outline-text-3" id="text-0-6-0-fx-new-features">
</div>
<div id="outline-container-org37bd207" class="outline-4">
<h4 id="0-6-0-nf-ivy-mode"><a id="org37bd207"></a><code>ivy-mode</code></h4>
<div class="outline-text-4" id="text-0-6-0-nf-ivy-mode">
</div>
<div id="outline-container-org2fd731a" class="outline-5">
<h5 id="org2fd731a">Open an Info file on the file system</h5>
<div class="outline-text-5" id="text-org2fd731a">
<p>
When in <code>Info-mode</code>, press <kbd>g</kbd> and select either "(./)" or "(../)" to
switch to file name completion. That file will be opened with Info.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org170f2f0" class="outline-5">
<h5 id="org170f2f0">Account for <code>minibuffer-depth-indication-mode</code></h5>
<div class="outline-text-5" id="text-org170f2f0">
<p>
If you have <code>minibuffer-depth-indication-mode</code> on, the minibuffer
prompt will indicate the current depth.
See <a href="https://github.com/abo-abo/swiper/pull/134">#134</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-orgb967984" class="outline-5">
<h5 id="orgb967984">Add fuzzy matching function</h5>
<div class="outline-text-5" id="text-orgb967984">
<p>
To enable fuzzy matching, set your <code>ivy-re-builders-alist</code> accordingly:
</p>
<div class="org-src-container">

<pre class="src src-elisp">(<span style="color: #7F0055; font-weight: bold;">setq</span> ivy-re-builders-alist
      '((t . ivy--regex-fuzzy)))
</pre>
</div>
<p>
See <a href="https://github.com/abo-abo/swiper/pull/136">#136</a>.
</p>

<p>
See also <a href="https://github.com/abo-abo/swiper/pull/142">#142</a> for toggling fuzzy matching with <kbd>C-o m</kbd>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-orgd9bdd1b" class="outline-5">
<h5 id="orgd9bdd1b"><code>case-fold-search</code> optimization</h5>
<div class="outline-text-5" id="text-orgd9bdd1b">
<p>
Bind case-fold-search to t when the input is all lower-case:
</p>

<ul class="org-ul">
<li>input "the" matches both "the" and "The".</li>
<li>input "The" matches only "The".</li>
</ul>

<p>
See <a href="https://github.com/abo-abo/swiper/pull/166">#166</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-orgdc17bf0" class="outline-5">
<h5 id="orgdc17bf0">Allow to see the candidate index a la <code>anzu</code> via <code>ivy-count-format</code></h5>
<div class="outline-text-5" id="text-orgdc17bf0">
<p>
To have this feature, use something like this:
</p>
<div class="org-src-container">

<pre class="src src-elisp">(<span style="color: #7F0055; font-weight: bold;">setq</span> ivy-count-format <span style="color: #2A00FF;">"(%d/%d) "</span>)
</pre>
</div>
<p>
See <a href="https://github.com/abo-abo/swiper/pull/167">#167</a>.
</p>

<p>
You can also set this to "", if you don't want any count, see <a href="https://github.com/abo-abo/swiper/pull/188">#188</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-orgcecbb37" class="outline-5">
<h5 id="orgcecbb37">Allow to add additional exit points for any command</h5>
<div class="outline-text-5" id="text-orgcecbb37">
<p>
Example for <code>ivy-switch-to-buffer</code>:
</p>
<div class="org-src-container">

<pre class="src src-elisp">(ivy-set-actions
 'ivy-switch-buffer
 '((<span style="color: #2A00FF;">"k"</span>
    (<span style="color: #7F0055; font-weight: bold;">lambda</span> (x)
      (kill-buffer x)
      (ivy--reset-state ivy-last))
    <span style="color: #2A00FF;">"kill"</span>)
   (<span style="color: #2A00FF;">"j"</span>
    ivy--switch-buffer-other-window-action
    <span style="color: #2A00FF;">"other"</span>)))
</pre>
</div>

<p>
After this:
</p>

<ul class="org-ul">
<li>use <kbd>M-o k</kbd> to kill a buffer</li>
<li>use <kbd>M-o j</kbd> to switch to a buffer in other window</li>
</ul>

<p>
You can always use <kbd>M-o o</kbd> to access the default action. When there is
only one action, <kbd>M-o</kbd> does the same as <kbd>C-m</kbd>.
</p>

<p>
See <a href="https://github.com/abo-abo/swiper/pull/164">#164</a>.
</p>








<hr  />
</div>
</div>
</div>
<div id="outline-container-orgd43545e" class="outline-4">
<h4 id="0-6-0-nf-counsel-describe-function-and-counsel-decribe-variable"><a id="orgd43545e"></a><code>counsel-describe-function</code> and <code>counsel-decribe-variable</code></h4>
<div class="outline-text-4" id="text-0-6-0-nf-counsel-describe-function-and-counsel-decribe-variable">
</div>
