doc/Changelog.org
**** Add a binding to look up the symbol in info
Press ~C-,~ to look up the symbol in info, instead of the default
describe action.
See [[https://github.com/abo-abo/swiper/pull/121][#121]].
-----
**** Handle symbol-at-point better in non-Elisp buffers
See [[https://github.com/abo-abo/swiper/pull/126][#126]].
-----
*** =ivy-switch-buffer=
:PROPERTIES:
:CUSTOM_ID: 0-6-0-nf-ivy-switch-buffer
:END:
**** New face =ivy-virtual=
See [[https://github.com/abo-abo/swiper/pull/129][#129]].
-----
**** Deal better with invisible buffers
See [[https://github.com/abo-abo/swiper/pull/135][#135]].
-----
**** Add custom keymap
You can customize =ivy-switch-buffer-map=.

See [[https://github.com/abo-abo/swiper/pull/164][#164]].
-----
**** Add extra actions
Add a =kill-buffer= action, and =switch-to-buffer-other-window= action.
-----
*** =counsel-git-grep=
:PROPERTIES:
:CUSTOM_ID: 0-6-0-nf-counsel-git-grep
:END:
**** Add Async
Make it fully async: the process =git grep= will be killed and
restarted on new input. This results in almost no keyboard delay.
-----
**** Own history variable
*** =swiper=
:PROPERTIES:
:CUSTOM_ID: 0-6-0-nf-swiper
:END:
**** Own history variable
Having own history variable allows to get more use of ~M-p~, ~M-n~ and ~C-r~.
-----
*** =counsel-el=
:PROPERTIES:
:CUSTOM_ID: 0-6-0-nf-counsel-el
:END:
**** Switch to action-style call
This allows to make use of ~C-M-n~ and ~C-M-p~.
-----
*** =counsel-locate=
:PROPERTIES:
:CUSTOM_ID: 0-6-0-nf-counsel-locate
:END:
**** Add Async
**** Add extra actions
In addition to the default action of opening a file add:

- =xdg-open= action
- =dired= action

Press ~M-o~ or ~C-o~ to access these actions.
-----
**** Add own history

-----
*** API
:PROPERTIES:
:CUSTOM_ID: 0-6-0-nf-api
:END:
**** Add :matcher
A matcher is a function that accepts a regexp and a list of candidates
and returns the filtered list of candidates.

The default matcher is basically =cl-remove-if-not= + =string-match=.
If you'd like to customize this, pass your own matcher.

See =counsel-git-grep-matcher= for an example.
-----
**** Allow to customize the initial input for all commands
Customize =ivy-initial-inputs-alist= for this.
See [[https://github.com/abo-abo/swiper/pull/140][#140]].
-----
**** =ivy-sort-functions-alist= should also examine =this-command=
**** :dynamic-collection is now a boolean
Pass the collection function as the second var instead.

** New Commands
:PROPERTIES:
:CUSTOM_ID: 0-6-0-nf-new-commands
:END:
*** =ivy-call=
:PROPERTIES:
:CUSTOM_ID: 0-6-0-nc-ivy-call
:END:
Execute the current action for the current candidate without exiting
the minibuffer.  Bound to ~C-M-m~ or ~M-RET~ or ~C-o g~.


-----
*** =counsel-find-file=
:PROPERTIES:
:CUSTOM_ID: 0-6-0-nc-counsel-find-file
:END:
Forward to =find-file= with Ivy completion.

=ivy-next-line-and-call= as well as =ivy-resume= should work for this command.

The variable =counsel-find-file-ignore-regexp= allows to ignore
certain files, like dot files.  Input a leading dot to see all files.

The variable =counsel-find-file-at-point= allows to automatically use
=ffap=.  You also can do it manually with ~M-n~ when the point is on a file name.

The variable =counsel-find-file-map= allows to customize the
minibuffer key bindings for this command.

Recommended binding:

#+begin_src elisp
(global-set-key (kbd "C-x C-f") 'counsel-find-file)
#+end_src

You can peek at files with ~C-M-n~ and ~C-M-p~.

See [[https://github.com/abo-abo/swiper/issues/122][#122]] and [[https://github.com/abo-abo/swiper/issues/123][#123]].

See [[https://github.com/abo-abo/swiper/pull/152][#152]] about ~M-n~, ~M-p~ and ~M-i~ switching directories when necessary.

-----
*** =ivy-recentf=
:PROPERTIES:
:CUSTOM_ID: 0-6-0-nc-ivy-recentf
:END:
Find a file on =recentf-list=.

Note that if your set =ivy-use-virtual-buffers=, =recentf-list= is
merged into candidates list for =ivy-switch-buffer=. But if you want
it separately, you can use this command.

See [[https://github.com/abo-abo/swiper/issues/124][#124]].
-----
*** =ivy-yank-word=
:PROPERTIES:
:CUSTOM_ID: 0-6-0-nc-ivy-yank-word
:END:
Add word at point to minibuffer input.

This is similar to what ~C-w~ does for =isearch=.  However it's bound
to ~M-j~ instead of ~C-w~, since ~C-w~ is bound to =kill-region= - a
useful command.

See [[https://github.com/abo-abo/swiper/issues/125][#125]].
-----
*** =counsel-M-x=
:PROPERTIES:
:CUSTOM_ID: 0-6-0-nc-counsel-m-x
:END:
Forward to =execute-extended-command= with Ivy completion.
The candidate list will also display the key binding for each bound command.

This command will piggyback on =smex= for sorting, if =smex= is installed.

Use =counsel-M-x-initial-input= to customize the initial input for
this command.  By default, it's "^" - the regex character that
indicates beginning of string.  This results in much faster matching,
since you usually type the command name from the start.

See [[https://github.com/abo-abo/swiper/pull/136][#136]] and [[https://github.com/abo-abo/swiper/pull/138][#138]].

-----
*** =hydra-ivy=
:PROPERTIES:
:CUSTOM_ID: 0-6-0-nc-hydra-ivy
:END:
Press ~C-o~ to toggle the Hydra for Ivy.
It gives access to shorter bindings and many customizable options.

Use ~C-o >~ to grow the minibuffer.
Use ~C-o <~ to shrink the minibuffer.

See [[https://github.com/abo-abo/swiper/pull/151][#151]].

-----
