Changelog.html
<div id="outline-container-org8d9e2bb" class="outline-5">
<h5 id="org8d9e2bb">Add a binding to look up the symbol in info</h5>
<div class="outline-text-5" id="text-org8d9e2bb">
<p>
Press <kbd>C-,</kbd> to look up the symbol in info, instead of the default
describe action.
See <a href="https://github.com/abo-abo/swiper/pull/121">#121</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org6e9d883" class="outline-5">
<h5 id="org6e9d883">Handle symbol-at-point better in non-Elisp buffers</h5>
<div class="outline-text-5" id="text-org6e9d883">
<p>
See <a href="https://github.com/abo-abo/swiper/pull/126">#126</a>.
</p>
<hr  />
</div>
</div>
</div>
<div id="outline-container-org40a87e9" class="outline-4">
<h4 id="0-6-0-nf-ivy-switch-buffer"><a id="org40a87e9"></a><code>ivy-switch-buffer</code></h4>
<div class="outline-text-4" id="text-0-6-0-nf-ivy-switch-buffer">
</div>
<div id="outline-container-org8c2a744" class="outline-5">
<h5 id="org8c2a744">New face <code>ivy-virtual</code></h5>
<div class="outline-text-5" id="text-org8c2a744">
<p>
See <a href="https://github.com/abo-abo/swiper/pull/129">#129</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org9104d02" class="outline-5">
<h5 id="org9104d02">Deal better with invisible buffers</h5>
<div class="outline-text-5" id="text-org9104d02">
<p>
See <a href="https://github.com/abo-abo/swiper/pull/135">#135</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-orga60216" class="outline-5">
<h5 id="orga60216">Add custom keymap</h5>
<div class="outline-text-5" id="text-orga60216">
<p>
You can customize <code>ivy-switch-buffer-map</code>.
</p>

<p>
See <a href="https://github.com/abo-abo/swiper/pull/164">#164</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org9f46a53" class="outline-5">
<h5 id="org9f46a53">Add extra actions</h5>
<div class="outline-text-5" id="text-org9f46a53">
<p>
Add a <code>kill-buffer</code> action, and <code>switch-to-buffer-other-window</code> action.
</p>
<hr  />
</div>
</div>
</div>
<div id="outline-container-org194e543" class="outline-4">
<h4 id="0-6-0-nf-counsel-git-grep"><a id="org194e543"></a><code>counsel-git-grep</code></h4>
<div class="outline-text-4" id="text-0-6-0-nf-counsel-git-grep">
</div>
<div id="outline-container-orga4fdd71" class="outline-5">
<h5 id="orga4fdd71">Add Async</h5>
<div class="outline-text-5" id="text-orga4fdd71">
<p>
Make it fully async: the process <code>git grep</code> will be killed and
restarted on new input. This results in almost no keyboard delay.
</p>
<hr  />
</div>
</div>
<div id="outline-container-orgae482f6" class="outline-5">
<h5 id="orgae482f6">Own history variable</h5>
</div>
</div>
<div id="outline-container-org325d064" class="outline-4">
<h4 id="0-6-0-nf-swiper"><a id="org325d064"></a><code>swiper</code></h4>
<div class="outline-text-4" id="text-0-6-0-nf-swiper">
</div>
<div id="outline-container-org169a248" class="outline-5">
<h5 id="org169a248">Own history variable</h5>
<div class="outline-text-5" id="text-org169a248">
<p>
Having own history variable allows to get more use of <kbd>M-p</kbd>, <kbd>M-n</kbd> and <kbd>C-r</kbd>.
</p>
<hr  />
</div>
</div>
</div>
<div id="outline-container-orgfdf02ca" class="outline-4">
<h4 id="0-6-0-nf-counsel-el"><a id="orgfdf02ca"></a><code>counsel-el</code></h4>
<div class="outline-text-4" id="text-0-6-0-nf-counsel-el">
</div>
<div id="outline-container-org3591a29" class="outline-5">
<h5 id="org3591a29">Switch to action-style call</h5>
<div class="outline-text-5" id="text-org3591a29">
<p>
This allows to make use of <kbd>C-M-n</kbd> and <kbd>C-M-p</kbd>.
</p>
<hr  />
</div>
</div>
</div>
<div id="outline-container-orgc3fb563" class="outline-4">
<h4 id="0-6-0-nf-counsel-locate"><a id="orgc3fb563"></a><code>counsel-locate</code></h4>
<div class="outline-text-4" id="text-0-6-0-nf-counsel-locate">
</div>
<div id="outline-container-org69a7a5f" class="outline-5">
<h5 id="org69a7a5f">Add Async</h5>
</div>
<div id="outline-container-org7ccb843" class="outline-5">
<h5 id="org7ccb843">Add extra actions</h5>
<div class="outline-text-5" id="text-org7ccb843">
<p>
In addition to the default action of opening a file add:
</p>

<ul class="org-ul">
<li><code>xdg-open</code> action</li>
<li><code>dired</code> action</li>
</ul>

<p>
Press <kbd>M-o</kbd> or <kbd>C-o</kbd> to access these actions.
</p>
<hr  />
</div>
</div>
<div id="outline-container-orge1542e" class="outline-5">
<h5 id="orge1542e">Add own history</h5>
<div class="outline-text-5" id="text-orge1542e">
<hr  />
</div>
</div>
</div>
<div id="outline-container-org918d81b" class="outline-4">
<h4 id="0-6-0-nf-api"><a id="org918d81b"></a>API</h4>
<div class="outline-text-4" id="text-0-6-0-nf-api">
</div>
<div id="outline-container-org49705ff" class="outline-5">
<h5 id="org49705ff">Add :matcher</h5>
<div class="outline-text-5" id="text-org49705ff">
<p>
A matcher is a function that accepts a regexp and a list of candidates
and returns the filtered list of candidates.
</p>

<p>
The default matcher is basically <code>cl-remove-if-not</code> + <code>string-match</code>.
If you'd like to customize this, pass your own matcher.
</p>

<p>
See <code>counsel-git-grep-matcher</code> for an example.
</p>
<hr  />
</div>
</div>
<div id="outline-container-orgc99d57e" class="outline-5">
<h5 id="orgc99d57e">Allow to customize the initial input for all commands</h5>
<div class="outline-text-5" id="text-orgc99d57e">
<p>
Customize <code>ivy-initial-inputs-alist</code> for this.
See <a href="https://github.com/abo-abo/swiper/pull/140">#140</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org39d72e8" class="outline-5">
<h5 id="org39d72e8"><code>ivy-sort-functions-alist</code> should also examine <code>this-command</code></h5>
</div>
<div id="outline-container-orgfcabfd" class="outline-5">
<h5 id="orgfcabfd">:dynamic-collection is now a boolean</h5>
<div class="outline-text-5" id="text-orgfcabfd">
<p>
Pass the collection function as the second var instead.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org1fb145f" class="outline-3">
<h3 id="0-6-0-nf-new-commands"><a id="org1fb145f"></a>New Commands</h3>
<div class="outline-text-3" id="text-0-6-0-nf-new-commands">
</div>
<div id="outline-container-orgd0d8521" class="outline-4">
<h4 id="0-6-0-nc-ivy-call"><a id="orgd0d8521"></a><code>ivy-call</code></h4>
<div class="outline-text-4" id="text-0-6-0-nc-ivy-call">
<p>
Execute the current action for the current candidate without exiting
the minibuffer.  Bound to <kbd>C-M-m</kbd> or <kbd>M-RET</kbd> or <kbd>C-o g</kbd>.
</p>


<hr  />
</div>
</div>
<div id="outline-container-orgc216530" class="outline-4">
<h4 id="0-6-0-nc-counsel-find-file"><a id="orgc216530"></a><code>counsel-find-file</code></h4>
<div class="outline-text-4" id="text-0-6-0-nc-counsel-find-file">
<p>
Forward to <code>find-file</code> with Ivy completion.
</p>

<p>
<code>ivy-next-line-and-call</code> as well as <code>ivy-resume</code> should work for this command.
</p>

<p>
The variable <code>counsel-find-file-ignore-regexp</code> allows to ignore
certain files, like dot files.  Input a leading dot to see all files.
</p>

<p>
The variable <code>counsel-find-file-at-point</code> allows to automatically use
<code>ffap</code>.  You also can do it manually with <kbd>M-n</kbd> when the point is on a file name.
</p>

<p>
The variable <code>counsel-find-file-map</code> allows to customize the
minibuffer key bindings for this command.
</p>

<p>
Recommended binding:
</p>

<div class="org-src-container">

<pre class="src src-elisp">(global-set-key (kbd <span style="color: #2A00FF;">"C-x C-f"</span>) 'counsel-find-file)
</pre>
</div>

<p>
You can peek at files with <kbd>C-M-n</kbd> and <kbd>C-M-p</kbd>.
</p>

<p>
See <a href="https://github.com/abo-abo/swiper/issues/122">#122</a> and <a href="https://github.com/abo-abo/swiper/issues/123">#123</a>.
</p>

<p>
See <a href="https://github.com/abo-abo/swiper/pull/152">#152</a> about <kbd>M-n</kbd>, <kbd>M-p</kbd> and <kbd>M-i</kbd> switching directories when necessary.
</p>

<hr  />
</div>
</div>
<div id="outline-container-org5903ab0" class="outline-4">
<h4 id="0-6-0-nc-ivy-recentf"><a id="org5903ab0"></a><code>ivy-recentf</code></h4>
<div class="outline-text-4" id="text-0-6-0-nc-ivy-recentf">
<p>
Find a file on <code>recentf-list</code>.
</p>

<p>
Note that if your set <code>ivy-use-virtual-buffers</code>, <code>recentf-list</code> is
merged into candidates list for <code>ivy-switch-buffer</code>. But if you want
it separately, you can use this command.
</p>

<p>
See <a href="https://github.com/abo-abo/swiper/issues/124">#124</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-orgbaf6181" class="outline-4">
<h4 id="0-6-0-nc-ivy-yank-word"><a id="orgbaf6181"></a><code>ivy-yank-word</code></h4>
<div class="outline-text-4" id="text-0-6-0-nc-ivy-yank-word">
<p>
Add word at point to minibuffer input.
</p>

<p>
This is similar to what <kbd>C-w</kbd> does for <code>isearch</code>.  However it's bound
to <kbd>M-j</kbd> instead of <kbd>C-w</kbd>, since <kbd>C-w</kbd> is bound to <code>kill-region</code> - a
useful command.
</p>

<p>
See <a href="https://github.com/abo-abo/swiper/issues/125">#125</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-orgd92b2c4" class="outline-4">
<h4 id="0-6-0-nc-counsel-m-x"><a id="orgd92b2c4"></a><code>counsel-M-x</code></h4>
<div class="outline-text-4" id="text-0-6-0-nc-counsel-m-x">
<p>
Forward to <code>execute-extended-command</code> with Ivy completion.
The candidate list will also display the key binding for each bound command.
</p>

<p>
This command will piggyback on <code>smex</code> for sorting, if <code>smex</code> is installed.
</p>

<p>
Use <code>counsel-M-x-initial-input</code> to customize the initial input for
this command.  By default, it's "^" - the regex character that
indicates beginning of string.  This results in much faster matching,
since you usually type the command name from the start.
</p>

<p>
See <a href="https://github.com/abo-abo/swiper/pull/136">#136</a> and <a href="https://github.com/abo-abo/swiper/pull/138">#138</a>.
</p>

<hr  />
</div>
</div>
<div id="outline-container-orgc3ca84c" class="outline-4">
<h4 id="0-6-0-nc-hydra-ivy"><a id="orgc3ca84c"></a><code>hydra-ivy</code></h4>
<div class="outline-text-4" id="text-0-6-0-nc-hydra-ivy">
<p>
Press <kbd>C-o</kbd> to toggle the Hydra for Ivy.
It gives access to shorter bindings and many customizable options.
</p>

<p>
Use <kbd>C-o &gt;</kbd> to grow the minibuffer.
Use <kbd>C-o &lt;</kbd> to shrink the minibuffer.
</p>

<p>
See <a href="https://github.com/abo-abo/swiper/pull/151">#151</a>.
</p>

<hr  />
</div>
</div>
