doc/Changelog.org
*** =ivy-toggle-calling=
:PROPERTIES:
:CUSTOM_ID: 0-6-0-nc-ivy-toggle-calling
:END:
Toggle executing the current action each time a new candidate is selected.

This command is bound to ~C-o c~.

To explain how this is useful: ~C-M-m C-M-f C-M-f C-M-f~  is equivalent to ~C-o cjjj~.

-----
*** =ivy-insert-current=
:PROPERTIES:
:CUSTOM_ID: 0-6-0-nc-ivy-insert-current
:END:
Inserts the current candidate into the minibuffer.

Press ~M-i~ if you want something close to the current candidate. You
can follow up with an edit and select.

I find this very useful when creating new files with a similar name to
the existing file: ~C-x C-f M-i~ + a bit of editing is very fast.

See [[https://github.com/abo-abo/swiper/pull/141][#141]].

-----
*** =counsel-load-theme=
:PROPERTIES:
:CUSTOM_ID: 0-6-0-nc-counsel-load-theme
:END:
Forward to =load-theme= with Ivy completion. Allows to rapidly try themes (e.g. with ~C-M-n~).

-----
*** =ivy-reverse-i-search=
:PROPERTIES:
:CUSTOM_ID: 0-6-0-nc-ivy-reverse-i-search
:END:
Allow to recursively match history with ~C-r~.

I like this command from bash shell. The usual way to search through
history is with ~M-p~ and ~M-n~.  Using =ivy-reverse-i-search= will
open a recursive completion session with the current history as the
candidates.
-----
*** =counsel-rhythmbox=
:PROPERTIES:
:CUSTOM_ID: 0-6-0-nc-counsel-rhythmbox
:END:
[[http://oremacs.com/2015/07/09/counsel-rhythmbox/][Control Rhythmbox from Emacs.]]
-----
*** =ivy-dispatching-done=
:PROPERTIES:
:CUSTOM_ID: 0-6-0-nc-ivy-dispatching-done
:END:
Select an action for the current candidate and execute it. Bound to ~M-o~.

Some commands that support ~M-o~:

- =counsel-rhythmbox=
- =counsel-describe-function=
- =counsel-describe-variable=
- =ivy-switch-buffer=
- =counsel-locate=

-----
*** =counsel-org-tag=
:PROPERTIES:
:CUSTOM_ID: 0-6-0-nc-counsel-org-tag
:END:
Forward to =org-set-tags= with Ivy completion.

Selecting any tag each time will toggle it on/off.
The current list of selected tags will be displayed in the prompt.

See [[https://github.com/abo-abo/swiper/pull/177][#177]] and [[https://github.com/abo-abo/swiper/pull/91][#91]].

-----
*** =counsel-org-tag-agenda=
:PROPERTIES:
:CUSTOM_ID: 0-6-0-nc-counsel-org-tag-agenda
:END:
Forward to =org-agenda-set-tags= with Ivy completion.
See [[https://github.com/abo-abo/swiper/pull/177][#177]].

-----
*** =counsel-ag=
:PROPERTIES:
:CUSTOM_ID: 0-6-0-nc-counsel-ag
:END:
Interactively =ag= using Ivy completion.

-----
*** =counsel-recoll=
:PROPERTIES:
:CUSTOM_ID: 0-6-0-nc-counsel-recoll
:END:
Use =recoll= with Ivy completion.
See [[http://oremacs.com/2015/07/27/counsel-recoll/][Using Recoll desktop search database with Emacs]].

Install recoll with =sudo apt-get install recoll=.

-----
*** =swiper-from-isearch=
:PROPERTIES:
:CUSTOM_ID: 0-6-0-nc-swiper-from-isearch
:END:
Start =swiper= from the current =isearch= input.

-----
*** =ivy-immediate-done=
:PROPERTIES:
:CUSTOM_ID: 0-6-0-nc-ivy-immediate-done
:END:
Use this command to exit the minibuffer choosing not the current
candidate, but the current text.  Bound to ~C-M-j~ or ~C-u C-j~.

See [[https://github.com/abo-abo/swiper/pull/183][#183]].

-----
* 0.7.0
:PROPERTIES:
:CUSTOM_ID: 0.7.0
:END:
-----
** Fixes
:PROPERTIES:
:CUSTOM_ID: 0-7-0-fixes
:END:
*** Fix :dynamic-collection not being sorted
:PROPERTIES:
:CUSTOM_ID: 0-7-0-fx-fix-dynamic-collection-not-being-sorted
:END:
*** When :initial-input contains a plus, escape it
:PROPERTIES:
:CUSTOM_ID: 0-7-0-fx-when-initial-input-contains-a-plus,-escape-it
:END:
See [[https://github.com/abo-abo/swiper/issues/195][#195]].
-----
*** Set line-spacing to 0 in the minibuffer
:PROPERTIES:
:CUSTOM_ID: 0-7-0-fx-set-line-spacing-to-0-in-the-minibuffer
:END:
See [[https://github.com/abo-abo/swiper/issues/198][#198]].
-----
*** Enlarge the minibuffer window if the candidate list doesn't fit
:PROPERTIES:
:CUSTOM_ID: 0-7-0-fx-enlarge-the-minibuffer-window-if-the-candidate-list-doesnt-fit
:END:
See [[https://github.com/abo-abo/swiper/issues/198][#198]] and [[https://github.com/abo-abo/swiper/issues/161][#161]] and [[https://github.com/abo-abo/swiper/issues/220][#220]].
-----
*** Fix minibuffer collapsing to one line
:PROPERTIES:
:CUSTOM_ID: 0-7-0-fx-fix-minibuffer-collapsing-to-one-line
:END:
See [[https://github.com/abo-abo/swiper/issues/237][#237]], [[https://github.com/abo-abo/swiper/issues/229][#229]] and [[https://github.com/abo-abo/swiper/issues/77][#77]].
-----
*** Use minibuffer-allow-text-properties
:PROPERTIES:
:CUSTOM_ID: 0-7-0-fx-use-minibuffer-allow-text-properties
:END:
Allows =ivy-read= to return a propertized string.
-----
*** Improve ~C-g~ out of a long-running async process
:PROPERTIES:
:CUSTOM_ID: 0-7-0-fx-improve-c-g-out-of-a-long-running-async-process
:END:
Use =counsel-delete-process= as =:unwind=.
-----
*** Don't regexp-quote :preselect
:PROPERTIES:
:CUSTOM_ID: 0-7-0-fx-dont-regexp-quote-preselect
:END:
See [[https://github.com/abo-abo/swiper/issues/245][#245]].
-----
*** Fix ivy-partial for fuzzy completion
:PROPERTIES:
:CUSTOM_ID: 0-7-0-fx-fix-ivy-partial-for-fuzzy-completion
:END:
See [[https://github.com/abo-abo/swiper/issues/266][#266]].
-----
*** ivy-resume should pass :caller
:PROPERTIES:
:CUSTOM_ID: 0-7-0-fx-ivy-resume-should-pass-caller
:END:
See [[https://github.com/abo-abo/swiper/issues/245][#245]].
-----
*** Fix the regression in perfect match logic
:PROPERTIES:
:CUSTOM_ID: 0-7-0-fx-fix-the-regression-in-perfect-match-logic
:END:
See [[https://github.com/abo-abo/swiper/issues/270][#270]].
-----
