Changelog.html
<div id="outline-container-orgce085a3" class="outline-4">
<h4 id="0-6-0-nc-ivy-toggle-calling"><a id="orgce085a3"></a><code>ivy-toggle-calling</code></h4>
<div class="outline-text-4" id="text-0-6-0-nc-ivy-toggle-calling">
<p>
Toggle executing the current action each time a new candidate is selected.
</p>

<p>
This command is bound to <kbd>C-o c</kbd>.
</p>

<p>
To explain how this is useful: <kbd>C-M-m C-M-f C-M-f C-M-f</kbd>  is equivalent to <kbd>C-o cjjj</kbd>.
</p>

<hr  />
</div>
</div>
<div id="outline-container-orga159373" class="outline-4">
<h4 id="0-6-0-nc-ivy-insert-current"><a id="orga159373"></a><code>ivy-insert-current</code></h4>
<div class="outline-text-4" id="text-0-6-0-nc-ivy-insert-current">
<p>
Inserts the current candidate into the minibuffer.
</p>

<p>
Press <kbd>M-i</kbd> if you want something close to the current candidate. You
can follow up with an edit and select.
</p>

<p>
I find this very useful when creating new files with a similar name to
the existing file: <kbd>C-x C-f M-i</kbd> + a bit of editing is very fast.
</p>

<p>
See <a href="https://github.com/abo-abo/swiper/pull/141">#141</a>.
</p>

<hr  />
</div>
</div>
<div id="outline-container-orgdd3bd0c" class="outline-4">
<h4 id="0-6-0-nc-counsel-load-theme"><a id="orgdd3bd0c"></a><code>counsel-load-theme</code></h4>
<div class="outline-text-4" id="text-0-6-0-nc-counsel-load-theme">
<p>
Forward to <code>load-theme</code> with Ivy completion. Allows to rapidly try themes (e.g. with <kbd>C-M-n</kbd>).
</p>

<hr  />
</div>
</div>
<div id="outline-container-org421813d" class="outline-4">
<h4 id="0-6-0-nc-ivy-reverse-i-search"><a id="org421813d"></a><code>ivy-reverse-i-search</code></h4>
<div class="outline-text-4" id="text-0-6-0-nc-ivy-reverse-i-search">
<p>
Allow to recursively match history with <kbd>C-r</kbd>.
</p>

<p>
I like this command from bash shell. The usual way to search through
history is with <kbd>M-p</kbd> and <kbd>M-n</kbd>.  Using <code>ivy-reverse-i-search</code> will
open a recursive completion session with the current history as the
candidates.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org9510b90" class="outline-4">
<h4 id="0-6-0-nc-counsel-rhythmbox"><a id="org9510b90"></a><code>counsel-rhythmbox</code></h4>
<div class="outline-text-4" id="text-0-6-0-nc-counsel-rhythmbox">
<p>
<a href="http://oremacs.com/2015/07/09/counsel-rhythmbox/">Control Rhythmbox from Emacs.</a>
</p>
<hr  />
</div>
</div>
<div id="outline-container-org41590d7" class="outline-4">
<h4 id="0-6-0-nc-ivy-dispatching-done"><a id="org41590d7"></a><code>ivy-dispatching-done</code></h4>
<div class="outline-text-4" id="text-0-6-0-nc-ivy-dispatching-done">
<p>
Select an action for the current candidate and execute it. Bound to <kbd>M-o</kbd>.
</p>

<p>
Some commands that support <kbd>M-o</kbd>:
</p>

<ul class="org-ul">
<li><code>counsel-rhythmbox</code></li>
<li><code>counsel-describe-function</code></li>
<li><code>counsel-describe-variable</code></li>
<li><code>ivy-switch-buffer</code></li>
<li><code>counsel-locate</code></li>
</ul>

<hr  />
</div>
</div>
<div id="outline-container-org3e40d59" class="outline-4">
<h4 id="0-6-0-nc-counsel-org-tag"><a id="org3e40d59"></a><code>counsel-org-tag</code></h4>
<div class="outline-text-4" id="text-0-6-0-nc-counsel-org-tag">
<p>
Forward to <code>org-set-tags</code> with Ivy completion.
</p>

<p>
Selecting any tag each time will toggle it on/off.
The current list of selected tags will be displayed in the prompt.
</p>

<p>
See <a href="https://github.com/abo-abo/swiper/pull/177">#177</a> and <a href="https://github.com/abo-abo/swiper/pull/91">#91</a>.
</p>

<hr  />
</div>
</div>
<div id="outline-container-org212299f" class="outline-4">
<h4 id="0-6-0-nc-counsel-org-tag-agenda"><a id="org212299f"></a><code>counsel-org-tag-agenda</code></h4>
<div class="outline-text-4" id="text-0-6-0-nc-counsel-org-tag-agenda">
<p>
Forward to <code>org-agenda-set-tags</code> with Ivy completion.
See <a href="https://github.com/abo-abo/swiper/pull/177">#177</a>.
</p>

<hr  />
</div>
</div>
<div id="outline-container-orgb02eca6" class="outline-4">
<h4 id="0-6-0-nc-counsel-ag"><a id="orgb02eca6"></a><code>counsel-ag</code></h4>
<div class="outline-text-4" id="text-0-6-0-nc-counsel-ag">
<p>
Interactively <code>ag</code> using Ivy completion.
</p>

<hr  />
</div>
</div>
<div id="outline-container-org9a90f14" class="outline-4">
<h4 id="0-6-0-nc-counsel-recoll"><a id="org9a90f14"></a><code>counsel-recoll</code></h4>
<div class="outline-text-4" id="text-0-6-0-nc-counsel-recoll">
<p>
Use <code>recoll</code> with Ivy completion.
See <a href="http://oremacs.com/2015/07/27/counsel-recoll/">Using Recoll desktop search database with Emacs</a>.
</p>

<p>
Install recoll with <code>sudo apt-get install recoll</code>.
</p>

<hr  />
</div>
</div>
<div id="outline-container-orgb8dc9c" class="outline-4">
<h4 id="0-6-0-nc-swiper-from-isearch"><a id="orgb8dc9c"></a><code>swiper-from-isearch</code></h4>
<div class="outline-text-4" id="text-0-6-0-nc-swiper-from-isearch">
<p>
Start <code>swiper</code> from the current <code>isearch</code> input.
</p>

<hr  />
</div>
</div>
<div id="outline-container-org27f14ac" class="outline-4">
<h4 id="0-6-0-nc-ivy-immediate-done"><a id="org27f14ac"></a><code>ivy-immediate-done</code></h4>
<div class="outline-text-4" id="text-0-6-0-nc-ivy-immediate-done">
<p>
Use this command to exit the minibuffer choosing not the current
candidate, but the current text.  Bound to <kbd>C-M-j</kbd> or <kbd>C-u C-j</kbd>.
</p>

<p>
See <a href="https://github.com/abo-abo/swiper/pull/183">#183</a>.
</p>

<hr  />
</div>
</div>
</div>
</div>
<div id="outline-container-org7166152" class="outline-2">
<h2 id="0.7.0"><a id="org7166152"></a>0.7.0</h2>
<div class="outline-text-2" id="text-0.7.0">
<hr  />
</div>
<div id="outline-container-org929a2f9" class="outline-3">
<h3 id="0-7-0-fixes"><a id="org929a2f9"></a>Fixes</h3>
<div class="outline-text-3" id="text-0-7-0-fixes">
</div>
<div id="outline-container-org5ff5f38" class="outline-4">
<h4 id="0-7-0-fx-fix-dynamic-collection-not-being-sorted"><a id="org5ff5f38"></a>Fix :dynamic-collection not being sorted</h4>
<div class="outline-text-4" id="text-0-7-0-fx-fix-dynamic-collection-not-being-sorted">
</div>
</div>
<div id="outline-container-orga68eb89" class="outline-4">
<h4 id="0-7-0-fx-when-initial-input-contains-a-plus,-escape-it"><a id="orga68eb89"></a>When :initial-input contains a plus, escape it</h4>
<div class="outline-text-4" id="text-0-7-0-fx-when-initial-input-contains-a-plus,-escape-it">
<p>
See <a href="https://github.com/abo-abo/swiper/issues/195">#195</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-orgc527c7a" class="outline-4">
<h4 id="0-7-0-fx-set-line-spacing-to-0-in-the-minibuffer"><a id="orgc527c7a"></a>Set line-spacing to 0 in the minibuffer</h4>
<div class="outline-text-4" id="text-0-7-0-fx-set-line-spacing-to-0-in-the-minibuffer">
<p>
See <a href="https://github.com/abo-abo/swiper/issues/198">#198</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org6893c3c" class="outline-4">
<h4 id="0-7-0-fx-enlarge-the-minibuffer-window-if-the-candidate-list-doesnt-fit"><a id="org6893c3c"></a>Enlarge the minibuffer window if the candidate list doesn't fit</h4>
<div class="outline-text-4" id="text-0-7-0-fx-enlarge-the-minibuffer-window-if-the-candidate-list-doesnt-fit">
<p>
See <a href="https://github.com/abo-abo/swiper/issues/198">#198</a> and <a href="https://github.com/abo-abo/swiper/issues/161">#161</a> and <a href="https://github.com/abo-abo/swiper/issues/220">#220</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-orgad68ad8" class="outline-4">
<h4 id="0-7-0-fx-fix-minibuffer-collapsing-to-one-line"><a id="orgad68ad8"></a>Fix minibuffer collapsing to one line</h4>
<div class="outline-text-4" id="text-0-7-0-fx-fix-minibuffer-collapsing-to-one-line">
<p>
See <a href="https://github.com/abo-abo/swiper/issues/237">#237</a>, <a href="https://github.com/abo-abo/swiper/issues/229">#229</a> and <a href="https://github.com/abo-abo/swiper/issues/77">#77</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org20dfea9" class="outline-4">
<h4 id="0-7-0-fx-use-minibuffer-allow-text-properties"><a id="org20dfea9"></a>Use minibuffer-allow-text-properties</h4>
<div class="outline-text-4" id="text-0-7-0-fx-use-minibuffer-allow-text-properties">
<p>
Allows <code>ivy-read</code> to return a propertized string.
</p>
<hr  />
</div>
</div>
<div id="outline-container-orge70bdbb" class="outline-4">
<h4 id="0-7-0-fx-improve-c-g-out-of-a-long-running-async-process"><a id="orge70bdbb"></a>Improve <kbd>C-g</kbd> out of a long-running async process</h4>
<div class="outline-text-4" id="text-0-7-0-fx-improve-c-g-out-of-a-long-running-async-process">
<p>
Use <code>counsel-delete-process</code> as <code>:unwind</code>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org8835e70" class="outline-4">
<h4 id="0-7-0-fx-dont-regexp-quote-preselect"><a id="org8835e70"></a>Don't regexp-quote :preselect</h4>
<div class="outline-text-4" id="text-0-7-0-fx-dont-regexp-quote-preselect">
<p>
See <a href="https://github.com/abo-abo/swiper/issues/245">#245</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-orgb7e1ee4" class="outline-4">
<h4 id="0-7-0-fx-fix-ivy-partial-for-fuzzy-completion"><a id="orgb7e1ee4"></a>Fix ivy-partial for fuzzy completion</h4>
<div class="outline-text-4" id="text-0-7-0-fx-fix-ivy-partial-for-fuzzy-completion">
<p>
See <a href="https://github.com/abo-abo/swiper/issues/266">#266</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-orgf81bcd2" class="outline-4">
<h4 id="0-7-0-fx-ivy-resume-should-pass-caller"><a id="orgf81bcd2"></a>ivy-resume should pass :caller</h4>
<div class="outline-text-4" id="text-0-7-0-fx-ivy-resume-should-pass-caller">
<p>
See <a href="https://github.com/abo-abo/swiper/issues/245">#245</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org2d3ea0e" class="outline-4">
<h4 id="0-7-0-fx-fix-the-regression-in-perfect-match-logic"><a id="org2d3ea0e"></a>Fix the regression in perfect match logic</h4>
<div class="outline-text-4" id="text-0-7-0-fx-fix-the-regression-in-perfect-match-logic">
<p>
See <a href="https://github.com/abo-abo/swiper/issues/270">#270</a>.
</p>
<hr  />
</div>
</div>
