doc/Changelog.org
*** Fix pasting file paths on Windows
:PROPERTIES:
:CUSTOM_ID: 0-7-0-fx-fix-pasting-file-paths-on-windows
:END:
*** ~C-j~ should no stop completion for a pasted file path
:PROPERTIES:
:CUSTOM_ID: 0-7-0-fx-c-j-should-no-stop-completion-for-a-pasted-file-path
:END:
*** ~C-M-j~ should use =ivy--directory=
:PROPERTIES:
:CUSTOM_ID: 0-7-0-fx-c-m-j-should-use-ivy--directory
:END:
When completing file names, expand the file name properly.
See [[https://github.com/abo-abo/swiper/issues/275][#275]].
-----
*** Use a specific blend method for dark themes
:PROPERTIES:
:CUSTOM_ID: 0-7-0-fx-use-a-specific-blend-method-for-dark-themes
:END:
See [[https://github.com/abo-abo/swiper/issues/278][#278]].
-----
*** Fix one-off bug in =ivy-scroll-up-command= and =ivy-scroll-down-command=
:PROPERTIES:
:CUSTOM_ID: 0-7-0-fx-fix-one-off-bug-in-ivy-scroll-up-command-and-ivy-scroll-down-command
:END:
*** ~M-o~ shouldn't set the action permanently
:PROPERTIES:
:CUSTOM_ID: 0-7-0-fx-m-o-shouldnt-set-the-action-permanently
:END:
So now it's possible to e.g. =counsel-describe-function= -> ~M-o d~ ->
=ivy-resume= -> ~M-o o~ -> =ivy-resume= -> ~M-o i~.
-----
*** Fix swiper preselect issue with similar or identical lines
:PROPERTIES:
:CUSTOM_ID: 0-7-0-fx-fix-swiper-preselect-issue-with-similar-or-identical-lines
:END:
See [[https://github.com/abo-abo/swiper/issues/290][#290]].
-----
*** Make ivy-completing-read handle history as cons
:PROPERTIES:
:CUSTOM_ID: 0-7-0-fx-make-ivy-completing-read-handle-history-as-cons
:END:
See [[https://github.com/abo-abo/swiper/issues/295][#295]].
-----
*** Perform string-match in the original buffer
:PROPERTIES:
:CUSTOM_ID: 0-7-0-fx-perform-string-match-in-the-original-buffer
:END:
The syntax for whitespace, separators etc. is different for modes.  See [[https://github.com/abo-abo/swiper/issues/298][#298]].
** New Features
:PROPERTIES:
:CUSTOM_ID: 0-7-0-fx-new-features
:END:
*** =swiper=
:PROPERTIES:
:CUSTOM_ID: 0-7-0-nf-swiper
:END:
**** Make line numbers into display properties
Each candidate is now a single space plus the original string.  The
display property of the single space holds the line number. This means
that it's no longer possible to match line numbers in queries, which
is a good thing if you're searching for numbers.
-----
**** Extend =swiper-font-lock-ensure=
Add =mu4e-view-mode=, =mu4e-headers-mode=, =help-mode=,
=elfeed-show-mode=, =emms-stream-mode=, =debbugs-gnu-mode=,
=occur-mode=, =occur-edit-mode=, =bongo-mode=, =eww-mode=, =vc-dir-mode=.
-----
**** Add support for =evil-jumper/backward=
See [[https://github.com/abo-abo/swiper/issues/268][#268]].
-----
**** Make compatible with =visual-line-mode=
=swiper= will split the lines when =visual-line-mode= is on.  This is
convenient for small buffers. For large buffers, it can be very slow,
since =visual-line-mode= is slow.
See [[https://github.com/abo-abo/swiper/issues/227][#227]].
-----
**** Add =swiper-toggle-face-matching=
Bound to ~C-c C-f~.
At each start of =swiper=, the face at point will be stored.
Use this command to toggle matching only the candidates with that face.
See [[https://github.com/abo-abo/swiper/issues/288][#288]].
-----
**** =push-mark= only if exited the minibuffer
~C-M-n~ and ~C-M-p~ will no longer push mark and annoy with messages.
-----
**** =ivy-resume= should restore the buffer for =swiper=
See [[https://github.com/abo-abo/swiper/issues/302][#302]].
-----
**** Enable recursive =swiper= calls
While you =swiper= buffer-1, you can switch out of the minibuffer into
buffer-2 and call =swiper= again.  Exiting the second minibuffer will
restore the first minibuffer.

To use this, you need to enable recursive minibuffers.
#+begin_src elisp
(setq enable-recursive-minibuffers t)
#+end_src

It's also useful to indicate the current depth:

#+begin_src elisp
(minibuffer-depth-indicate-mode 1)
#+end_src

See [[https://github.com/abo-abo/swiper/issues/309][#309]].
-----
**** Fix for =twittering-mode=
The =field= text property is now removed before inserting text into
the minibuffer. This fixes the =swiper= problems with
=twittering-mode=. See [[https://github.com/abo-abo/swiper/issues/310][#310]].




-----
*** =ivy=
:PROPERTIES:
:CUSTOM_ID: 0-7-0-nf-ivy
:END:
**** Add manual
In the current state, the manual covers the most basic topics, like
the minibuffer key bindings and the regexp builders.
-----
**** Make <left> and <right> behave as in fundamental-mode
**** Truncate minibuffer prompts longer than window-width
See [[https://github.com/abo-abo/swiper/issues/240][#240]].
-----
**** ~C-M-n~ should not leave the minibuffer
Make sure that the minibuffer window remains selected as long as the
completion hasn't finished.  For example, ~<f1> f~ to call
=counsel-describe-function=, input "forward" and spam ~C-M-n~ to read
the doc for each function that starts with "forward". The =*Help*=
window popup would move the window focus, but this change moves it
back to the minibuffer.
-----
