Changelog.html
<div id="outline-container-orge49d889" class="outline-4">
<h4 id="0-7-0-fx-fix-pasting-file-paths-on-windows"><a id="orge49d889"></a>Fix pasting file paths on Windows</h4>
<div class="outline-text-4" id="text-0-7-0-fx-fix-pasting-file-paths-on-windows">
</div>
</div>
<div id="outline-container-orgef2310b" class="outline-4">
<h4 id="0-7-0-fx-c-j-should-no-stop-completion-for-a-pasted-file-path"><a id="orgef2310b"></a><kbd>C-j</kbd> should no stop completion for a pasted file path</h4>
<div class="outline-text-4" id="text-0-7-0-fx-c-j-should-no-stop-completion-for-a-pasted-file-path">
</div>
</div>
<div id="outline-container-orgdb5dfb8" class="outline-4">
<h4 id="0-7-0-fx-c-m-j-should-use-ivy--directory"><a id="orgdb5dfb8"></a><kbd>C-M-j</kbd> should use <code>ivy--directory</code></h4>
<div class="outline-text-4" id="text-0-7-0-fx-c-m-j-should-use-ivy--directory">
<p>
When completing file names, expand the file name properly.
See <a href="https://github.com/abo-abo/swiper/issues/275">#275</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org4d63343" class="outline-4">
<h4 id="0-7-0-fx-use-a-specific-blend-method-for-dark-themes"><a id="org4d63343"></a>Use a specific blend method for dark themes</h4>
<div class="outline-text-4" id="text-0-7-0-fx-use-a-specific-blend-method-for-dark-themes">
<p>
See <a href="https://github.com/abo-abo/swiper/issues/278">#278</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-orge9b9942" class="outline-4">
<h4 id="0-7-0-fx-fix-one-off-bug-in-ivy-scroll-up-command-and-ivy-scroll-down-command"><a id="orge9b9942"></a>Fix one-off bug in <code>ivy-scroll-up-command</code> and <code>ivy-scroll-down-command</code></h4>
<div class="outline-text-4" id="text-0-7-0-fx-fix-one-off-bug-in-ivy-scroll-up-command-and-ivy-scroll-down-command">
</div>
</div>
<div id="outline-container-org45c786e" class="outline-4">
<h4 id="0-7-0-fx-m-o-shouldnt-set-the-action-permanently"><a id="org45c786e"></a><kbd>M-o</kbd> shouldn't set the action permanently</h4>
<div class="outline-text-4" id="text-0-7-0-fx-m-o-shouldnt-set-the-action-permanently">
<p>
So now it's possible to e.g. <code>counsel-describe-function</code> -&gt; <kbd>M-o d</kbd> -&gt;
<code>ivy-resume</code> -&gt; <kbd>M-o o</kbd> -&gt; <code>ivy-resume</code> -&gt; <kbd>M-o i</kbd>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org7c8f8bf" class="outline-4">
<h4 id="0-7-0-fx-fix-swiper-preselect-issue-with-similar-or-identical-lines"><a id="org7c8f8bf"></a>Fix swiper preselect issue with similar or identical lines</h4>
<div class="outline-text-4" id="text-0-7-0-fx-fix-swiper-preselect-issue-with-similar-or-identical-lines">
<p>
See <a href="https://github.com/abo-abo/swiper/issues/290">#290</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-orgcb3c923" class="outline-4">
<h4 id="0-7-0-fx-make-ivy-completing-read-handle-history-as-cons"><a id="orgcb3c923"></a>Make ivy-completing-read handle history as cons</h4>
<div class="outline-text-4" id="text-0-7-0-fx-make-ivy-completing-read-handle-history-as-cons">
<p>
See <a href="https://github.com/abo-abo/swiper/issues/295">#295</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org17b3d88" class="outline-4">
<h4 id="0-7-0-fx-perform-string-match-in-the-original-buffer"><a id="org17b3d88"></a>Perform string-match in the original buffer</h4>
<div class="outline-text-4" id="text-0-7-0-fx-perform-string-match-in-the-original-buffer">
<p>
The syntax for whitespace, separators etc. is different for modes.  See <a href="https://github.com/abo-abo/swiper/issues/298">#298</a>.
</p>
</div>
</div>
</div>
<div id="outline-container-org4e7a5fa" class="outline-3">
<h3 id="0-7-0-fx-new-features"><a id="org4e7a5fa"></a>New Features</h3>
<div class="outline-text-3" id="text-0-7-0-fx-new-features">
</div>
<div id="outline-container-org3534aeb" class="outline-4">
<h4 id="0-7-0-nf-swiper"><a id="org3534aeb"></a><code>swiper</code></h4>
<div class="outline-text-4" id="text-0-7-0-nf-swiper">
</div>
<div id="outline-container-org2da4cc1" class="outline-5">
<h5 id="org2da4cc1">Make line numbers into display properties</h5>
<div class="outline-text-5" id="text-org2da4cc1">
<p>
Each candidate is now a single space plus the original string.  The
display property of the single space holds the line number. This means
that it's no longer possible to match line numbers in queries, which
is a good thing if you're searching for numbers.
</p>
<hr  />
</div>
</div>
<div id="outline-container-orgca5a04" class="outline-5">
<h5 id="orgca5a04">Extend <code>swiper-font-lock-ensure</code></h5>
<div class="outline-text-5" id="text-orgca5a04">
<p>
Add <code>mu4e-view-mode</code>, <code>mu4e-headers-mode</code>, <code>help-mode</code>,
<code>elfeed-show-mode</code>, <code>emms-stream-mode</code>, <code>debbugs-gnu-mode</code>,
<code>occur-mode</code>, <code>occur-edit-mode</code>, <code>bongo-mode</code>, <code>eww-mode</code>, <code>vc-dir-mode</code>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org7e23df0" class="outline-5">
<h5 id="org7e23df0">Add support for <code>evil-jumper/backward</code></h5>
<div class="outline-text-5" id="text-org7e23df0">
<p>
See <a href="https://github.com/abo-abo/swiper/issues/268">#268</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org1636028" class="outline-5">
<h5 id="org1636028">Make compatible with <code>visual-line-mode</code></h5>
<div class="outline-text-5" id="text-org1636028">
<p>
<code>swiper</code> will split the lines when <code>visual-line-mode</code> is on.  This is
convenient for small buffers. For large buffers, it can be very slow,
since <code>visual-line-mode</code> is slow.
See <a href="https://github.com/abo-abo/swiper/issues/227">#227</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org520ccb5" class="outline-5">
<h5 id="org520ccb5">Add <code>swiper-toggle-face-matching</code></h5>
<div class="outline-text-5" id="text-org520ccb5">
<p>
Bound to <kbd>C-c C-f</kbd>.
At each start of <code>swiper</code>, the face at point will be stored.
Use this command to toggle matching only the candidates with that face.
See <a href="https://github.com/abo-abo/swiper/issues/288">#288</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org288ebe2" class="outline-5">
<h5 id="org288ebe2"><code>push-mark</code> only if exited the minibuffer</h5>
<div class="outline-text-5" id="text-org288ebe2">
<p>
<kbd>C-M-n</kbd> and <kbd>C-M-p</kbd> will no longer push mark and annoy with messages.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org3f66898" class="outline-5">
<h5 id="org3f66898"><code>ivy-resume</code> should restore the buffer for <code>swiper</code></h5>
<div class="outline-text-5" id="text-org3f66898">
<p>
See <a href="https://github.com/abo-abo/swiper/issues/302">#302</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org64d317f" class="outline-5">
<h5 id="org64d317f">Enable recursive <code>swiper</code> calls</h5>
<div class="outline-text-5" id="text-org64d317f">
<p>
While you <code>swiper</code> buffer-1, you can switch out of the minibuffer into
buffer-2 and call <code>swiper</code> again.  Exiting the second minibuffer will
restore the first minibuffer.
</p>

<p>
To use this, you need to enable recursive minibuffers.
</p>
<div class="org-src-container">

<pre class="src src-elisp">(<span style="color: #7F0055; font-weight: bold;">setq</span> enable-recursive-minibuffers t)
</pre>
</div>

<p>
It's also useful to indicate the current depth:
</p>

<div class="org-src-container">

<pre class="src src-elisp">(minibuffer-depth-indicate-mode 1)
</pre>
</div>

<p>
See <a href="https://github.com/abo-abo/swiper/issues/309">#309</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-orgd537199" class="outline-5">
<h5 id="orgd537199">Fix for <code>twittering-mode</code></h5>
<div class="outline-text-5" id="text-orgd537199">
<p>
The <code>field</code> text property is now removed before inserting text into
the minibuffer. This fixes the <code>swiper</code> problems with
<code>twittering-mode</code>. See <a href="https://github.com/abo-abo/swiper/issues/310">#310</a>.
</p>




<hr  />
</div>
</div>
</div>
<div id="outline-container-org6feedbc" class="outline-4">
<h4 id="0-7-0-nf-ivy"><a id="org6feedbc"></a><code>ivy</code></h4>
<div class="outline-text-4" id="text-0-7-0-nf-ivy">
</div>
<div id="outline-container-orgdda7193" class="outline-5">
<h5 id="orgdda7193">Add manual</h5>
<div class="outline-text-5" id="text-orgdda7193">
<p>
In the current state, the manual covers the most basic topics, like
the minibuffer key bindings and the regexp builders.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org57e3cf1" class="outline-5">
<h5 id="org57e3cf1">Make &lt;left&gt; and &lt;right&gt; behave as in fundamental-mode</h5>
</div>
<div id="outline-container-orgdb93da9" class="outline-5">
<h5 id="orgdb93da9">Truncate minibuffer prompts longer than window-width</h5>
<div class="outline-text-5" id="text-orgdb93da9">
<p>
See <a href="https://github.com/abo-abo/swiper/issues/240">#240</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org476d580" class="outline-5">
<h5 id="org476d580"><kbd>C-M-n</kbd> should not leave the minibuffer</h5>
<div class="outline-text-5" id="text-org476d580">
<p>
Make sure that the minibuffer window remains selected as long as the
completion hasn't finished.  For example, <kbd>&lt;f1&gt; f</kbd> to call
<code>counsel-describe-function</code>, input "forward" and spam <kbd>C-M-n</kbd> to read
the doc for each function that starts with "forward". The <code>*Help*</code>
window popup would move the window focus, but this change moves it
back to the minibuffer.
</p>
<hr  />
</div>
</div>
