doc/Changelog.org
**** Add =flx= sorting
See [[https://github.com/abo-abo/swiper/issues/207][#207]].
Since flx is costly, move the caching to an earlier point. This means
immediate return for when the input hasn't changed, i.e. for ~C-n~ or
~C-p~. When =flx= is installed, and =(eq ivy--regex-function 'ivy--regex-fuzzy)=
for current function (through =ivy-re-builders-alist=), then sort the final candidates with
=ivy--flx-sort=.

In the worst case, when some error pops up, return the same list. In
the best case sort the =cands= that all match =name= by closeness to
=name=.

How to use:
1. Have =flx= installed - =(require 'flx)= should succeed.
2. Configure =ivy-re-builders-alist= appropriately to use =ivy--regex-fuzzy=.

For example:

#+begin_src elisp
(setq ivy-re-builders-alist
      '((t . ivy--regex-fuzzy)))
#+end_src
-----
**** Support hash tables
Since =all-completions= also works for hash tables, no reason not to support them.
-----
**** Improve documentation of =ivy-count-format=
Now possible to set it with Customize.
-----
**** Add =ivy-index-functions-alist=
Customize this to decide how the index, i.e. the currently selected
candidate, is updated with new input.
For example, one strategy is not reset it to 0 after each change.

Another strategy, used for =swiper=, is to try to select the first
appropriate candidate after (inclusive) the first previously selected
candidate. This way, if you're typing something that matches what is
currently selected, the selection won't change.

See [[https://github.com/abo-abo/swiper/issues/253][#253]].
-----
**** Add =ivy-virtual-abbreviate=
The mode of abbreviation for virtual buffer names.
-----
**** Add =ivy-case-fold-search=
Used to override =case-fold-search=. See [[https://github.com/abo-abo/swiper/issues/259][#259]].
-----
**** Add feedback for long-running async processes
Each time 0.5s pass after the last input, if the external process
hasn't finished yet, update minibuffer with the amount of candidates
collected so far. This is useful to see that long running commands
like =counsel-locate= or =counsel-ag= (when in a very large directory)
aren't stuck.
-----
**** Promote =ivy-extra-directories= to defcustom
**** Promote =ivy-sort-function-alist= to defcustom
**** ~M-n~ should prefer url at point to symbol at point
**** ~C-x C-f M-n~ calls =ffap-url-fetcher= when at URL
**** Highlight modified file buffers with =ivy-modified-buffer= face
This new face is blank by default, but you can use e.g.:
#+begin_src elisp
(custom-set-faces
 '(ivy-modified-buffer ((t (:background "#ff7777")))))
#+end_src
-----
**** Work with =enable-recursive-minibuffers=
Store the old =ivy-last= in case =ivy-read= is called while inside the
minibuffer.  Restore it after =ivy-call=.
-----
**** Allow user-specified matched candidate sorting
New defcustom =ivy-sort-matches-functions-alist=.
See [[https://github.com/abo-abo/swiper/issues/269][#269]] [[https://github.com/abo-abo/swiper/issues/265][#265]] [[https://github.com/abo-abo/swiper/issues/213][#213]].

By default, Ivy doesn't sort the matched candidates, they remain in
the same order as in the original collection. This option is the
default, since it's fast and simple.

A small problem with this approach is that we usually want prefix
matches to be displayed first. One solution to this is to input "^" to
see only the prefix matches.

Now, another solution is to can set:
#+begin_src elisp
(setq ivy-sort-matches-functions-alist
      '((t . ivy--prefix-sort)))
#+end_src

Here's another example of using this defcustom:
#+begin_src elisp
(add-to-list
     'ivy-sort-matches-functions-alist
     '(read-file-name-internal . ivy--sort-files-by-date))
#+end_src

After this, during file name completion, most recently changed files
will be ahead.
-----
**** =ivy-display-style=
Adds fancy highlighting to the minibuffer.
See [[https://github.com/abo-abo/swiper/issues/212][#212]], [[https://github.com/abo-abo/swiper/issues/217][#217]], .
-----
*** =ivy-hydra=
:PROPERTIES:
:CUSTOM_ID: 0-7-0-nf-ivy-hydra
:END:
**** Bind ~t~ to =toggle-truncate-lines=
See [[https://github.com/abo-abo/swiper/issues/214][#214]].
-----
**** Bind ~a~ to =ivy-read-action=
*** =ivy-switch-buffer=
:PROPERTIES:
:CUSTOM_ID: 0-7-0-nf-ivy-switch-buffer
:END:
**** Make ~M-o r~ rename the buffer instead of switching.
See [[https://github.com/abo-abo/swiper/issues/233][#233]].
-----
*** =counsel-locate=
:PROPERTIES:
:CUSTOM_ID: 0-7-0-nf-counsel-locate
:END:
**** Allow customizing locate options
See =counsel-locate-options=.
The current setting is:
#+begin_src elisp
(setq counsel-locate-options '("-i" "--regex"))
#+end_src
-----
**** Support OSX
Use =open= instead of =xdg-open=.  Modify =counsel-locate-options= for
OSX, since there =locate= doesn't support =--regex=.
-----
**** Use single quotes for the regex
See [[https://github.com/abo-abo/swiper/issues/194][#194]].
-----
**** Add initial-input argument
See [[https://github.com/abo-abo/swiper/issues/289][#289]].
-----
*** =counsel-org-tag=
:PROPERTIES:
:CUSTOM_ID: 0-7-0-nf-counsel-org-tag
:END:
**** Now works in agenda
See [[https://github.com/abo-abo/swiper/issues/200][#200]].
-----
*** =counsel-unicode-char=
:PROPERTIES:
:CUSTOM_ID: 0-7-0-nf-counsel-unicode-char
:END:
**** Add own history
*** =counsel-M-x=
:PROPERTIES:
:CUSTOM_ID: 0-7-0-nf-counsel-m-x
:END:
