Changelog.html
<div id="outline-container-orgde3501a" class="outline-5">
<h5 id="orgde3501a">Add <code>flx</code> sorting</h5>
<div class="outline-text-5" id="text-orgde3501a">
<p>
See <a href="https://github.com/abo-abo/swiper/issues/207">#207</a>.
Since flx is costly, move the caching to an earlier point. This means
immediate return for when the input hasn't changed, i.e. for <kbd>C-n</kbd> or
<kbd>C-p</kbd>. When <code>flx</code> is installed, and <code>(eq ivy--regex-function 'ivy--regex-fuzzy)</code>
for current function (through <code>ivy-re-builders-alist</code>), then sort the final candidates with
<code>ivy--flx-sort</code>.
</p>

<p>
In the worst case, when some error pops up, return the same list. In
the best case sort the <code>cands</code> that all match <code>name</code> by closeness to
<code>name</code>.
</p>

<p>
How to use:
</p>
<ol class="org-ol">
<li>Have <code>flx</code> installed - <code>(require 'flx)</code> should succeed.</li>
<li>Configure <code>ivy-re-builders-alist</code> appropriately to use <code>ivy--regex-fuzzy</code>.</li>
</ol>

<p>
For example:
</p>

<div class="org-src-container">

<pre class="src src-elisp">(<span style="color: #7F0055; font-weight: bold;">setq</span> ivy-re-builders-alist
      '((t . ivy--regex-fuzzy)))
</pre>
</div>
<hr  />
</div>
</div>
<div id="outline-container-org87133c3" class="outline-5">
<h5 id="org87133c3">Support hash tables</h5>
<div class="outline-text-5" id="text-org87133c3">
<p>
Since <code>all-completions</code> also works for hash tables, no reason not to support them.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org856fa08" class="outline-5">
<h5 id="org856fa08">Improve documentation of <code>ivy-count-format</code></h5>
<div class="outline-text-5" id="text-org856fa08">
<p>
Now possible to set it with Customize.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org8bb17b8" class="outline-5">
<h5 id="org8bb17b8">Add <code>ivy-index-functions-alist</code></h5>
<div class="outline-text-5" id="text-org8bb17b8">
<p>
Customize this to decide how the index, i.e. the currently selected
candidate, is updated with new input.
For example, one strategy is not reset it to 0 after each change.
</p>

<p>
Another strategy, used for <code>swiper</code>, is to try to select the first
appropriate candidate after (inclusive) the first previously selected
candidate. This way, if you're typing something that matches what is
currently selected, the selection won't change.
</p>

<p>
See <a href="https://github.com/abo-abo/swiper/issues/253">#253</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-orgc7798db" class="outline-5">
<h5 id="orgc7798db">Add <code>ivy-virtual-abbreviate</code></h5>
<div class="outline-text-5" id="text-orgc7798db">
<p>
The mode of abbreviation for virtual buffer names.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org7963ef8" class="outline-5">
<h5 id="org7963ef8">Add <code>ivy-case-fold-search</code></h5>
<div class="outline-text-5" id="text-org7963ef8">
<p>
Used to override <code>case-fold-search</code>. See <a href="https://github.com/abo-abo/swiper/issues/259">#259</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org92e38ba" class="outline-5">
<h5 id="org92e38ba">Add feedback for long-running async processes</h5>
<div class="outline-text-5" id="text-org92e38ba">
<p>
Each time 0.5s pass after the last input, if the external process
hasn't finished yet, update minibuffer with the amount of candidates
collected so far. This is useful to see that long running commands
like <code>counsel-locate</code> or <code>counsel-ag</code> (when in a very large directory)
aren't stuck.
</p>
<hr  />
</div>
</div>
<div id="outline-container-orgc3c8f14" class="outline-5">
<h5 id="orgc3c8f14">Promote <code>ivy-extra-directories</code> to defcustom</h5>
</div>
<div id="outline-container-orgd3dcdd5" class="outline-5">
<h5 id="orgd3dcdd5">Promote <code>ivy-sort-function-alist</code> to defcustom</h5>
</div>
<div id="outline-container-org6dab5a0" class="outline-5">
<h5 id="org6dab5a0"><kbd>M-n</kbd> should prefer url at point to symbol at point</h5>
</div>
<div id="outline-container-org47c7481" class="outline-5">
<h5 id="org47c7481"><kbd>C-x C-f M-n</kbd> calls <code>ffap-url-fetcher</code> when at URL</h5>
</div>
<div id="outline-container-org1012adc" class="outline-5">
<h5 id="org1012adc">Highlight modified file buffers with <code>ivy-modified-buffer</code> face</h5>
<div class="outline-text-5" id="text-org1012adc">
<p>
This new face is blank by default, but you can use e.g.:
</p>
<div class="org-src-container">

<pre class="src src-elisp">(custom-set-faces
 '(ivy-modified-buffer ((t (<span style="color: #7F0055; font-weight: bold;">:background</span> <span style="color: #2A00FF;">"#ff7777"</span>)))))
</pre>
</div>
<hr  />
</div>
</div>
<div id="outline-container-org9f79842" class="outline-5">
<h5 id="org9f79842">Work with <code>enable-recursive-minibuffers</code></h5>
<div class="outline-text-5" id="text-org9f79842">
<p>
Store the old <code>ivy-last</code> in case <code>ivy-read</code> is called while inside the
minibuffer.  Restore it after <code>ivy-call</code>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org7697511" class="outline-5">
<h5 id="org7697511">Allow user-specified matched candidate sorting</h5>
<div class="outline-text-5" id="text-org7697511">
<p>
New defcustom <code>ivy-sort-matches-functions-alist</code>.
See <a href="https://github.com/abo-abo/swiper/issues/269">#269</a> <a href="https://github.com/abo-abo/swiper/issues/265">#265</a> <a href="https://github.com/abo-abo/swiper/issues/213">#213</a>.
</p>

<p>
By default, Ivy doesn't sort the matched candidates, they remain in
the same order as in the original collection. This option is the
default, since it's fast and simple.
</p>

<p>
A small problem with this approach is that we usually want prefix
matches to be displayed first. One solution to this is to input "^" to
see only the prefix matches.
</p>

<p>
Now, another solution is to can set:
</p>
<div class="org-src-container">

<pre class="src src-elisp">(<span style="color: #7F0055; font-weight: bold;">setq</span> ivy-sort-matches-functions-alist
      '((t . ivy--prefix-sort)))
</pre>
</div>

<p>
Here's another example of using this defcustom:
</p>
<div class="org-src-container">

<pre class="src src-elisp">(add-to-list
     'ivy-sort-matches-functions-alist
     '(read-file-name-internal . ivy--sort-files-by-date))
</pre>
</div>

<p>
After this, during file name completion, most recently changed files
will be ahead.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org9d66c4e" class="outline-5">
<h5 id="org9d66c4e"><code>ivy-display-style</code></h5>
<div class="outline-text-5" id="text-org9d66c4e">
<p>
Adds fancy highlighting to the minibuffer.
See <a href="https://github.com/abo-abo/swiper/issues/212">#212</a>, <a href="https://github.com/abo-abo/swiper/issues/217">#217</a>, .
</p>
<hr  />
</div>
</div>
</div>
<div id="outline-container-orgf4eb00e" class="outline-4">
<h4 id="0-7-0-nf-ivy-hydra"><a id="orgf4eb00e"></a><code>ivy-hydra</code></h4>
<div class="outline-text-4" id="text-0-7-0-nf-ivy-hydra">
</div>
<div id="outline-container-orgd2b1588" class="outline-5">
<h5 id="orgd2b1588">Bind <kbd>t</kbd> to <code>toggle-truncate-lines</code></h5>
<div class="outline-text-5" id="text-orgd2b1588">
<p>
See <a href="https://github.com/abo-abo/swiper/issues/214">#214</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-orgb2d0b3" class="outline-5">
<h5 id="orgb2d0b3">Bind <kbd>a</kbd> to <code>ivy-read-action</code></h5>
</div>
</div>
<div id="outline-container-org1ab5efa" class="outline-4">
<h4 id="0-7-0-nf-ivy-switch-buffer"><a id="org1ab5efa"></a><code>ivy-switch-buffer</code></h4>
<div class="outline-text-4" id="text-0-7-0-nf-ivy-switch-buffer">
</div>
<div id="outline-container-orga5e1f0a" class="outline-5">
<h5 id="orga5e1f0a">Make <kbd>M-o r</kbd> rename the buffer instead of switching.</h5>
<div class="outline-text-5" id="text-orga5e1f0a">
<p>
See <a href="https://github.com/abo-abo/swiper/issues/233">#233</a>.
</p>
<hr  />
</div>
</div>
</div>
<div id="outline-container-orgbc45bc5" class="outline-4">
<h4 id="0-7-0-nf-counsel-locate"><a id="orgbc45bc5"></a><code>counsel-locate</code></h4>
<div class="outline-text-4" id="text-0-7-0-nf-counsel-locate">
</div>
<div id="outline-container-org81f4edb" class="outline-5">
<h5 id="org81f4edb">Allow customizing locate options</h5>
<div class="outline-text-5" id="text-org81f4edb">
<p>
See <code>counsel-locate-options</code>.
The current setting is:
</p>
<div class="org-src-container">

<pre class="src src-elisp">(<span style="color: #7F0055; font-weight: bold;">setq</span> counsel-locate-options '(<span style="color: #2A00FF;">"-i"</span> <span style="color: #2A00FF;">"--regex"</span>))
</pre>
</div>
<hr  />
</div>
</div>
<div id="outline-container-org1963134" class="outline-5">
<h5 id="org1963134">Support OSX</h5>
<div class="outline-text-5" id="text-org1963134">
<p>
Use <code>open</code> instead of <code>xdg-open</code>.  Modify <code>counsel-locate-options</code> for
OSX, since there <code>locate</code> doesn't support <code>--regex</code>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org7c83a83" class="outline-5">
<h5 id="org7c83a83">Use single quotes for the regex</h5>
<div class="outline-text-5" id="text-org7c83a83">
<p>
See <a href="https://github.com/abo-abo/swiper/issues/194">#194</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-orgb909b78" class="outline-5">
<h5 id="orgb909b78">Add initial-input argument</h5>
<div class="outline-text-5" id="text-orgb909b78">
<p>
See <a href="https://github.com/abo-abo/swiper/issues/289">#289</a>.
</p>
<hr  />
</div>
</div>
</div>
<div id="outline-container-org8b21068" class="outline-4">
<h4 id="0-7-0-nf-counsel-org-tag"><a id="org8b21068"></a><code>counsel-org-tag</code></h4>
<div class="outline-text-4" id="text-0-7-0-nf-counsel-org-tag">
</div>
<div id="outline-container-org69a46ad" class="outline-5">
<h5 id="org69a46ad">Now works in agenda</h5>
<div class="outline-text-5" id="text-org69a46ad">
<p>
See <a href="https://github.com/abo-abo/swiper/issues/200">#200</a>.
</p>
<hr  />
</div>
</div>
</div>
