doc/Changelog.org
**** Add "definition" action
Use ~M-o d~ to jump to definition.
-----
**** Show =current-prefix-arg= in the prompt
See [[https://github.com/abo-abo/swiper/issues/287][#287]].
-----
*** =counsel-find-file=
:PROPERTIES:
:CUSTOM_ID: 0-7-0-nf-counsel-find-file
:END:
**** Input '/sudo::' goes to current directory instead of root's home
See [[https://github.com/abo-abo/swiper/issues/283][#283]].
-----
**** Fix directory validity check
See [[https://github.com/abo-abo/swiper/issues/283][#283]] [[https://github.com/abo-abo/swiper/issues/284][#284]].
-----
**** Improve TRAMP support
Selecting items after ~//~ now works properly.
-----
*** =counsel-git-grep=
:PROPERTIES:
:CUSTOM_ID: 0-7-0-nf-counsel-git-grep
:END:
**** Use prefix arg to specify the shell command.
Remember to use ~M-i~ to insert the current candidate into the
minibuffer.

See [[https://github.com/abo-abo/swiper/issues/244][#244]].
-----
**** Allow =counsel-git-grep= -> =ivy-occur= -> =wgrep=
Using ~C-c C-o~ (=ivy-occur=) while in =counsel-git-grep= will produce
a =wgrep=-compatible buffer.
-----
**** =ivy-occur= gives full candidates
This means that the =" | head -n 200"= speed-up isn't used and full
candidates are returned.
-----
*** =counsel--find-symbol=
:PROPERTIES:
:CUSTOM_ID: 0-7-0-nf-counsel--find-symbol
:END:
**** Allow to jump back with pop-tag-mark
Using ~C-.~ in:

- =counsel-describe-function=
- =counsel-describe-variable=
- =counsel-load-library=

will change the current buffer. The buffer and point can be restored
with ~M-*~ (=pop-tag-mark=).

I also recommend this binding:

#+begin_src elisp
(global-set-key (kbd "M-,") 'pop-tag-mark)
#+end_src
-----
**** Resolve the name clash better
When the symbol is both bound and fbound, prefer the fbound one,
unless the =:caller= is =counsel-describe-variable=.
-----
*** =counsel-ag=
:PROPERTIES:
:CUSTOM_ID: 0-7-0-nf-counsel-ag
:END:
**** Add =initial-directory=
Support alternative initial directory which helps other packages call
this function with their unique starting directory.
-----
**** Fix on Windows
Using the "--vimgrep" argument improves things.
** New Commands
:PROPERTIES:
:CUSTOM_ID: 0-7-0-nf-new-commands
:END:
*** =ivy-occur=
:PROPERTIES:
:CUSTOM_ID: 0-7-0-nc-ivy-occur
:END:
Bound to ~C-c C-o~. Store the current completion session to its own
buffer.  You can have an unlimited amount of these buffers.
-----
*** =ivy-avy=
:PROPERTIES:
:CUSTOM_ID: 0-7-0-nc-ivy-avy
:END:
Bound to ~C-'~.

Speeds up selecting a candidate that's currently visible in the minibuffer.
-----
*** =ivy-kill-ring-save=
:PROPERTIES:
:CUSTOM_ID: 0-7-0-nc-ivy-kill-ring-save
:END:
Bound to ~M-w~.

When the region is active, call =kill-ring-save=.  Otherwise, store
all selected candidates to the kill ring.
-----
*** =ivy-dispatching-call=
:PROPERTIES:
:CUSTOM_ID: 0-7-0-nc-ivy-dispatching-call
:END:
Bound to ~C-M-o~.

This is a non-exiting version of ~M-o~ (=ivy-dispatching-done=).
-----
*** =ivy-read-action=
:PROPERTIES:
:CUSTOM_ID: 0-7-0-nc-ivy-read-action
:END:
Bound to ~C-M-a~. Select the current action. Don't call it yet.
-----
*** =swiper-multi=
:PROPERTIES:
:CUSTOM_ID: 0-7-0-nc-swiper-multi
:END:
Use =swiper= in multiple buffers.
See [[https://github.com/abo-abo/swiper/issues/182][#182]].

Basic usage tips for selecting multiple buffers:

- Use ~C-M-m~ (=ivy-call=) to add or remove one more buffer without exiting.
- Use ~C-m~ (=ivy-done=) to add one last buffer.
- Or use ~C-M-j~ (=ivy-immediate-done=) to finish without adding more buffers.
- Hold ~C-M-n~ (=ivy-next-line-and-call=) to add a lot of buffers at once.
-----
*** =swiper-mc=
:PROPERTIES:
:CUSTOM_ID: 0-7-0-nc-swiper-mc
:END:
Open multiple cursors at all selected candidates.
-----
*** =swiper-all=
:PROPERTIES:
:CUSTOM_ID: 0-7-0-nc-swiper-all
:END:
New command to launch =swiper= for all open file buffers.  Note that
this can be excruciatingly slow if you don't clean up your buffer list
often.
-----
*** =counsel-grep=
:PROPERTIES:
:CUSTOM_ID: 0-7-0-nc-counsel-grep
:END:
This is essentially =swiper= for huge files. It's not as smooth as
=swiper= for small files, but has a faster startup and faster matching
for files that measure in megabytes.
-----
*** =counsel-git-grep-query-replace=
:PROPERTIES:
:CUSTOM_ID: 0-7-0-nc-counsel-git-grep-query-replace
:END:
Bound to ~M-q~. Perform =query-replace= on all matches in all buffers.
-----
*** =counsel-jedi=
:PROPERTIES:
:CUSTOM_ID: 0-7-0-nc-counsel-jedi
:END:
Complete Python symbols using Jedi.
-----
*** =counsel-cl=
:PROPERTIES:
:CUSTOM_ID: 0-7-0-nc-counsel-cl
:END:
Complete Common Lisp symbols using SLIME.
-----
*** =counsel-yank-pop=
:PROPERTIES:
:CUSTOM_ID: 0-7-0-nc-counsel-yank-pop
:END:
Give completion for inserting from the kill ring.
See =counsel-yank-pop-truncate= defcustom and [[https://github.com/abo-abo/swiper/issues/218][#218]].
-----
* 0.8.0
:PROPERTIES:
:CUSTOM_ID: 0.8.0
:END:
-----
