Changelog.html
<div id="outline-container-org2fe7d3" class="outline-4">
<h4 id="0-7-0-nf-counsel-unicode-char"><a id="org2fe7d3"></a><code>counsel-unicode-char</code></h4>
<div class="outline-text-4" id="text-0-7-0-nf-counsel-unicode-char">
</div>
<div id="outline-container-orgdf58e7b" class="outline-5">
<h5 id="orgdf58e7b">Add own history</h5>
</div>
</div>
<div id="outline-container-org4426836" class="outline-4">
<h4 id="0-7-0-nf-counsel-m-x"><a id="org4426836"></a><code>counsel-M-x</code></h4>
<div class="outline-text-4" id="text-0-7-0-nf-counsel-m-x">
</div>
<div id="outline-container-org71583c8" class="outline-5">
<h5 id="org71583c8">Add "definition" action</h5>
<div class="outline-text-5" id="text-org71583c8">
<p>
Use <kbd>M-o d</kbd> to jump to definition.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org3893af2" class="outline-5">
<h5 id="org3893af2">Show <code>current-prefix-arg</code> in the prompt</h5>
<div class="outline-text-5" id="text-org3893af2">
<p>
See <a href="https://github.com/abo-abo/swiper/issues/287">#287</a>.
</p>
<hr  />
</div>
</div>
</div>
<div id="outline-container-org14037bf" class="outline-4">
<h4 id="0-7-0-nf-counsel-find-file"><a id="org14037bf"></a><code>counsel-find-file</code></h4>
<div class="outline-text-4" id="text-0-7-0-nf-counsel-find-file">
</div>
<div id="outline-container-org1160951" class="outline-5">
<h5 id="org1160951">Input '/sudo::' goes to current directory instead of root's home</h5>
<div class="outline-text-5" id="text-org1160951">
<p>
See <a href="https://github.com/abo-abo/swiper/issues/283">#283</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-orgca0feac" class="outline-5">
<h5 id="orgca0feac">Fix directory validity check</h5>
<div class="outline-text-5" id="text-orgca0feac">
<p>
See <a href="https://github.com/abo-abo/swiper/issues/283">#283</a> <a href="https://github.com/abo-abo/swiper/issues/284">#284</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org62910ad" class="outline-5">
<h5 id="org62910ad">Improve TRAMP support</h5>
<div class="outline-text-5" id="text-org62910ad">
<p>
Selecting items after <kbd>//</kbd> now works properly.
</p>
<hr  />
</div>
</div>
</div>
<div id="outline-container-org79338ac" class="outline-4">
<h4 id="0-7-0-nf-counsel-git-grep"><a id="org79338ac"></a><code>counsel-git-grep</code></h4>
<div class="outline-text-4" id="text-0-7-0-nf-counsel-git-grep">
</div>
<div id="outline-container-orged47bcb" class="outline-5">
<h5 id="orged47bcb">Use prefix arg to specify the shell command.</h5>
<div class="outline-text-5" id="text-orged47bcb">
<p>
Remember to use <kbd>M-i</kbd> to insert the current candidate into the
minibuffer.
</p>

<p>
See <a href="https://github.com/abo-abo/swiper/issues/244">#244</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org62b7d7c" class="outline-5">
<h5 id="org62b7d7c">Allow <code>counsel-git-grep</code> -&gt; <code>ivy-occur</code> -&gt; <code>wgrep</code></h5>
<div class="outline-text-5" id="text-org62b7d7c">
<p>
Using <kbd>C-c C-o</kbd> (<code>ivy-occur</code>) while in <code>counsel-git-grep</code> will produce
a <code>wgrep</code>-compatible buffer.
</p>
<hr  />
</div>
</div>
<div id="outline-container-orgb5b997e" class="outline-5">
<h5 id="orgb5b997e"><code>ivy-occur</code> gives full candidates</h5>
<div class="outline-text-5" id="text-orgb5b997e">
<p>
This means that the <code>" | head -n 200"</code> speed-up isn't used and full
candidates are returned.
</p>
<hr  />
</div>
</div>
</div>
<div id="outline-container-org33c2d92" class="outline-4">
<h4 id="0-7-0-nf-counsel--find-symbol"><a id="org33c2d92"></a><code>counsel--find-symbol</code></h4>
<div class="outline-text-4" id="text-0-7-0-nf-counsel--find-symbol">
</div>
<div id="outline-container-org54a2bff" class="outline-5">
<h5 id="org54a2bff">Allow to jump back with pop-tag-mark</h5>
<div class="outline-text-5" id="text-org54a2bff">
<p>
Using <kbd>C-.</kbd> in:
</p>

<ul class="org-ul">
<li><code>counsel-describe-function</code></li>
<li><code>counsel-describe-variable</code></li>
<li><code>counsel-load-library</code></li>
</ul>

<p>
will change the current buffer. The buffer and point can be restored
with <kbd>M-*</kbd> (<code>pop-tag-mark</code>).
</p>

<p>
I also recommend this binding:
</p>

<div class="org-src-container">

<pre class="src src-elisp">(global-set-key (kbd <span style="color: #2A00FF;">"M-,"</span>) 'pop-tag-mark)
</pre>
</div>
<hr  />
</div>
</div>
<div id="outline-container-org2773beb" class="outline-5">
<h5 id="org2773beb">Resolve the name clash better</h5>
<div class="outline-text-5" id="text-org2773beb">
<p>
When the symbol is both bound and fbound, prefer the fbound one,
unless the <code>:caller</code> is <code>counsel-describe-variable</code>.
</p>
<hr  />
</div>
</div>
</div>
<div id="outline-container-org7120fa5" class="outline-4">
<h4 id="0-7-0-nf-counsel-ag"><a id="org7120fa5"></a><code>counsel-ag</code></h4>
<div class="outline-text-4" id="text-0-7-0-nf-counsel-ag">
</div>
<div id="outline-container-orgb71d7f5" class="outline-5">
<h5 id="orgb71d7f5">Add <code>initial-directory</code></h5>
<div class="outline-text-5" id="text-orgb71d7f5">
<p>
Support alternative initial directory which helps other packages call
this function with their unique starting directory.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org7468b8b" class="outline-5">
<h5 id="org7468b8b">Fix on Windows</h5>
<div class="outline-text-5" id="text-org7468b8b">
<p>
Using the "&#x2013;vimgrep" argument improves things.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org3570a67" class="outline-3">
<h3 id="0-7-0-nf-new-commands"><a id="org3570a67"></a>New Commands</h3>
<div class="outline-text-3" id="text-0-7-0-nf-new-commands">
</div>
<div id="outline-container-orgc262dbc" class="outline-4">
<h4 id="0-7-0-nc-ivy-occur"><a id="orgc262dbc"></a><code>ivy-occur</code></h4>
<div class="outline-text-4" id="text-0-7-0-nc-ivy-occur">
<p>
Bound to <kbd>C-c C-o</kbd>. Store the current completion session to its own
buffer.  You can have an unlimited amount of these buffers.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org5d80f04" class="outline-4">
<h4 id="0-7-0-nc-ivy-avy"><a id="org5d80f04"></a><code>ivy-avy</code></h4>
<div class="outline-text-4" id="text-0-7-0-nc-ivy-avy">
<p>
Bound to <kbd>C-'</kbd>.
</p>

<p>
Speeds up selecting a candidate that's currently visible in the minibuffer.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org8736b92" class="outline-4">
<h4 id="0-7-0-nc-ivy-kill-ring-save"><a id="org8736b92"></a><code>ivy-kill-ring-save</code></h4>
<div class="outline-text-4" id="text-0-7-0-nc-ivy-kill-ring-save">
<p>
Bound to <kbd>M-w</kbd>.
</p>

<p>
When the region is active, call <code>kill-ring-save</code>.  Otherwise, store
all selected candidates to the kill ring.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org40a1206" class="outline-4">
<h4 id="0-7-0-nc-ivy-dispatching-call"><a id="org40a1206"></a><code>ivy-dispatching-call</code></h4>
<div class="outline-text-4" id="text-0-7-0-nc-ivy-dispatching-call">
<p>
Bound to <kbd>C-M-o</kbd>.
</p>

<p>
This is a non-exiting version of <kbd>M-o</kbd> (<code>ivy-dispatching-done</code>).
</p>
<hr  />
</div>
</div>
<div id="outline-container-org4b20b1" class="outline-4">
<h4 id="0-7-0-nc-ivy-read-action"><a id="org4b20b1"></a><code>ivy-read-action</code></h4>
<div class="outline-text-4" id="text-0-7-0-nc-ivy-read-action">
<p>
Bound to <kbd>C-M-a</kbd>. Select the current action. Don't call it yet.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org91badab" class="outline-4">
<h4 id="0-7-0-nc-swiper-multi"><a id="org91badab"></a><code>swiper-multi</code></h4>
<div class="outline-text-4" id="text-0-7-0-nc-swiper-multi">
<p>
Use <code>swiper</code> in multiple buffers.
See <a href="https://github.com/abo-abo/swiper/issues/182">#182</a>.
</p>

<p>
Basic usage tips for selecting multiple buffers:
</p>

<ul class="org-ul">
<li>Use <kbd>C-M-m</kbd> (<code>ivy-call</code>) to add or remove one more buffer without exiting.</li>
<li>Use <kbd>C-m</kbd> (<code>ivy-done</code>) to add one last buffer.</li>
<li>Or use <kbd>C-M-j</kbd> (<code>ivy-immediate-done</code>) to finish without adding more buffers.</li>
<li>Hold <kbd>C-M-n</kbd> (<code>ivy-next-line-and-call</code>) to add a lot of buffers at once.</li>
</ul>
<hr  />
</div>
</div>
<div id="outline-container-orgcefce18" class="outline-4">
<h4 id="0-7-0-nc-swiper-mc"><a id="orgcefce18"></a><code>swiper-mc</code></h4>
<div class="outline-text-4" id="text-0-7-0-nc-swiper-mc">
<p>
Open multiple cursors at all selected candidates.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org36de1c1" class="outline-4">
<h4 id="0-7-0-nc-swiper-all"><a id="org36de1c1"></a><code>swiper-all</code></h4>
<div class="outline-text-4" id="text-0-7-0-nc-swiper-all">
<p>
New command to launch <code>swiper</code> for all open file buffers.  Note that
this can be excruciatingly slow if you don't clean up your buffer list
often.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org955fb8e" class="outline-4">
<h4 id="0-7-0-nc-counsel-grep"><a id="org955fb8e"></a><code>counsel-grep</code></h4>
<div class="outline-text-4" id="text-0-7-0-nc-counsel-grep">
<p>
This is essentially <code>swiper</code> for huge files. It's not as smooth as
<code>swiper</code> for small files, but has a faster startup and faster matching
for files that measure in megabytes.
</p>
<hr  />
</div>
</div>
<div id="outline-container-orga524f57" class="outline-4">
<h4 id="0-7-0-nc-counsel-git-grep-query-replace"><a id="orga524f57"></a><code>counsel-git-grep-query-replace</code></h4>
<div class="outline-text-4" id="text-0-7-0-nc-counsel-git-grep-query-replace">
<p>
Bound to <kbd>M-q</kbd>. Perform <code>query-replace</code> on all matches in all buffers.
</p>
<hr  />
</div>
</div>
<div id="outline-container-orge4a2102" class="outline-4">
<h4 id="0-7-0-nc-counsel-jedi"><a id="orge4a2102"></a><code>counsel-jedi</code></h4>
<div class="outline-text-4" id="text-0-7-0-nc-counsel-jedi">
<p>
Complete Python symbols using Jedi.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org10e5832" class="outline-4">
<h4 id="0-7-0-nc-counsel-cl"><a id="org10e5832"></a><code>counsel-cl</code></h4>
<div class="outline-text-4" id="text-0-7-0-nc-counsel-cl">
<p>
Complete Common Lisp symbols using SLIME.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org851f3e5" class="outline-4">
<h4 id="0-7-0-nc-counsel-yank-pop"><a id="org851f3e5"></a><code>counsel-yank-pop</code></h4>
<div class="outline-text-4" id="text-0-7-0-nc-counsel-yank-pop">
<p>
Give completion for inserting from the kill ring.
See <code>counsel-yank-pop-truncate</code> defcustom and <a href="https://github.com/abo-abo/swiper/issues/218">#218</a>.
</p>
<hr  />
</div>
</div>
</div>
</div>
