doc/Changelog.org
** Package rename
:PROPERTIES:
:CUSTOM_ID: 0-8-0-package-rename
:END:
Due to popular demand, =swiper-0.7.0= is succeeded by =ivy-0.8.0= in GNU
ELPA. The contents of the package don't change, only the name. Make
sure to remove the =~/.emacs.d/elpa/swiper-0.7.0= directory if you
have it and ~M-x~ =package-install ivy=.
** Documentation
:PROPERTIES:
:CUSTOM_ID: 0-8-0-documentation
:END:
HTML documentation is available at http://oremacs.com/swiper/.

Texinfo documentation is in doc/ivy.texi.

The HTML file shouldn't be in this repository to avoid bloat, instead
it's in the gh-pages branch at
https://github.com/abo-abo/swiper/tree/gh-pages.
** Fixes
:PROPERTIES:
:CUSTOM_ID: 0-8-0-fixes
:END:
*** =ivy-read=
:PROPERTIES:
:CUSTOM_ID: 0-8-0-fx-ivy-read
:END:
**** Fix recursive minibuffer exit with ~C-g~
Make it so e.g. ~C-h f C-h v C-g~ goes back to the =describe-function= selection.
-----
**** Ensure the return result
In some cases, =read-from-minibuffer= will return the whole minibuffer
contents (i.e. all available candidates). Return =ivy--current= instead.
-----
**** Properly support matching ignoring order
See [[https://github.com/abo-abo/swiper/issues/296][#296]] and [[https://github.com/abo-abo/swiper/issues/329][#329]].
-----
**** Insert intermediate candidates during async completions
See [[https://github.com/abo-abo/swiper/issues/340][#340]].
-----
**** Initialize =ivy-last= to empty state
See [[https://github.com/abo-abo/swiper/issues/352][#352]].
-----
**** Fix extra actions for =completing-read=
See [[https://github.com/abo-abo/swiper/issues/337][#337]].
-----
**** Support a list of symbols as collection
See [[https://github.com/abo-abo/swiper/issues/375][#375]].
-----
**** Define =setq-local= and =defvar-local= unless defined
With this commit, Ivy works on emacs-24.2.
See [[https://github.com/abo-abo/swiper/issues/415][#415]].
-----
**** Make ~M-o~ not modify the action
See [[https://github.com/abo-abo/swiper/issues/454][#454]].
-----
**** Make sure user keybindings are respected
See [[https://github.com/abo-abo/swiper/issues/466][#466]].
-----
**** Fix =read-file-name= with a specified dir
See [[https://github.com/abo-abo/swiper/issues/475][#475]].
-----
**** Don't highlight the match in the file part
See [[https://github.com/abo-abo/swiper/issues/483][#483]].
-----
**** Add a few tests for alists
-----
*** =ivy-occur=
:PROPERTIES:
:CUSTOM_ID: 0-8-0-fx-ivy-occur
:END:
**** Fix =default-directory=
This way, =next-error= etc will work properly.
-----
*** =ivy--resize-minibuffer-to-fit=
:PROPERTIES:
:CUSTOM_ID: 0-8-0-fx-ivy--resize-minibuffer-to-fit
:END:
**** Fix for small delta
See [[https://github.com/abo-abo/swiper/issues/339][#339]].
-----
**** Check =frame-root-window-p=
See [[https://github.com/abo-abo/swiper/issues/380][#380]].
-----
*** =ivy-completing-read=
:PROPERTIES:
:CUSTOM_ID: 0-8-0-fx-ivy-completing-read
:END:
**** Use =completing-read-default= for tmm
See [[https://github.com/abo-abo/swiper/issues/316][#316]].
-----
*** =ivy--regex-plus=
:PROPERTIES:
:CUSTOM_ID: 0-8-0-fx-ivy--regex-plus
:END:
**** Recognize ! at the beginning of the str
See [[https://github.com/abo-abo/swiper/issues/318][#318]].
-----
**** Prettify a bit
See [[https://github.com/abo-abo/swiper/issues/344][#344]].
-----
**** Don't consider =\\(?...\)= a group
See [[https://github.com/abo-abo/swiper/issues/393][#393]].
-----
*** =ivy--get-window=
:PROPERTIES:
:CUSTOM_ID: 0-8-0-fx-ivy--get-window
:END:
**** Always return a valid window
Even if =state= is invalid.
-----
*** =ivy--recompute-index=
:PROPERTIES:
:CUSTOM_ID: 0-8-0-fx-ivy--recompute-index
:END:
**** Update =cl-position= logic
See [[https://github.com/abo-abo/swiper/issues/207][#207]].
-----
*** =ivy-reverse-i-search=
:PROPERTIES:
:CUSTOM_ID: 0-8-0-fx-ivy-reverse-i-search
:END:
**** Fix due to recursive update
See [[https://github.com/abo-abo/swiper/issues/323][#323]].
-----
*** =ivy--reset-state=
:PROPERTIES:
:CUSTOM_ID: 0-8-0-fx-ivy--reset-state
:END:
**** Don't null =initial-input=
This is specifically for ='read-file-name-internal= collection.  The
input needs to be set to nil for e.g. =rgrep=, which supplies the
*absolute* path as =initial-input=, resulting in a mess.

For now, don't set input to nil if =:action= was passed to =ivy-read=.
See [[https://github.com/abo-abo/swiper/issues/336][#336]].
-----
**** Don't deactivate region
See [[https://github.com/abo-abo/swiper/issues/377][#377]].
-----
*** =ivy-completion-in-region=
:PROPERTIES:
:CUSTOM_ID: 0-8-0-fx-ivy-completion-in-region
:END:
**** Use =completion-all-completions=
See [[https://github.com/abo-abo/swiper/issues/341][#341]].
-----
