Changelog.html
<div id="outline-container-org70e46d6" class="outline-2">
<h2 id="0.8.0"><a id="org70e46d6"></a>0.8.0</h2>
<div class="outline-text-2" id="text-0.8.0">
<hr  />
</div>
<div id="outline-container-orga51b8c9" class="outline-3">
<h3 id="0-8-0-package-rename"><a id="orga51b8c9"></a>Package rename</h3>
<div class="outline-text-3" id="text-0-8-0-package-rename">
<p>
Due to popular demand, <code>swiper-0.7.0</code> is succeeded by <code>ivy-0.8.0</code> in GNU
ELPA. The contents of the package don't change, only the name. Make
sure to remove the <code>~/.emacs.d/elpa/swiper-0.7.0</code> directory if you
have it and <kbd>M-x</kbd> <code>package-install ivy</code>.
</p>
</div>
</div>
<div id="outline-container-orgb89c7c6" class="outline-3">
<h3 id="0-8-0-documentation"><a id="orgb89c7c6"></a>Documentation</h3>
<div class="outline-text-3" id="text-0-8-0-documentation">
<p>
HTML documentation is available at <a href="http://oremacs.com/swiper/">http://oremacs.com/swiper/</a>.
</p>

<p>
Texinfo documentation is in doc/ivy.texi.
</p>

<p>
The HTML file shouldn't be in this repository to avoid bloat, instead
it's in the gh-pages branch at
<a href="https://github.com/abo-abo/swiper/tree/gh-pages">https://github.com/abo-abo/swiper/tree/gh-pages</a>.
</p>
</div>
</div>
<div id="outline-container-orgb8e16cf" class="outline-3">
<h3 id="0-8-0-fixes"><a id="orgb8e16cf"></a>Fixes</h3>
<div class="outline-text-3" id="text-0-8-0-fixes">
</div>
<div id="outline-container-orgfd728cf" class="outline-4">
<h4 id="0-8-0-fx-ivy-read"><a id="orgfd728cf"></a><code>ivy-read</code></h4>
<div class="outline-text-4" id="text-0-8-0-fx-ivy-read">
</div>
<div id="outline-container-orgd17d08a" class="outline-5">
<h5 id="orgd17d08a">Fix recursive minibuffer exit with <kbd>C-g</kbd></h5>
<div class="outline-text-5" id="text-orgd17d08a">
<p>
Make it so e.g. <kbd>C-h f C-h v C-g</kbd> goes back to the <code>describe-function</code> selection.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org7f86db5" class="outline-5">
<h5 id="org7f86db5">Ensure the return result</h5>
<div class="outline-text-5" id="text-org7f86db5">
<p>
In some cases, <code>read-from-minibuffer</code> will return the whole minibuffer
contents (i.e. all available candidates). Return <code>ivy--current</code> instead.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org81e6715" class="outline-5">
<h5 id="org81e6715">Properly support matching ignoring order</h5>
<div class="outline-text-5" id="text-org81e6715">
<p>
See <a href="https://github.com/abo-abo/swiper/issues/296">#296</a> and <a href="https://github.com/abo-abo/swiper/issues/329">#329</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org3aa7dc8" class="outline-5">
<h5 id="org3aa7dc8">Insert intermediate candidates during async completions</h5>
<div class="outline-text-5" id="text-org3aa7dc8">
<p>
See <a href="https://github.com/abo-abo/swiper/issues/340">#340</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-orgbb551d2" class="outline-5">
<h5 id="orgbb551d2">Initialize <code>ivy-last</code> to empty state</h5>
<div class="outline-text-5" id="text-orgbb551d2">
<p>
See <a href="https://github.com/abo-abo/swiper/issues/352">#352</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org7fadd40" class="outline-5">
<h5 id="org7fadd40">Fix extra actions for <code>completing-read</code></h5>
<div class="outline-text-5" id="text-org7fadd40">
<p>
See <a href="https://github.com/abo-abo/swiper/issues/337">#337</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org59edbc4" class="outline-5">
<h5 id="org59edbc4">Support a list of symbols as collection</h5>
<div class="outline-text-5" id="text-org59edbc4">
<p>
See <a href="https://github.com/abo-abo/swiper/issues/375">#375</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org871baa9" class="outline-5">
<h5 id="org871baa9">Define <code>setq-local</code> and <code>defvar-local</code> unless defined</h5>
<div class="outline-text-5" id="text-org871baa9">
<p>
With this commit, Ivy works on emacs-24.2.
See <a href="https://github.com/abo-abo/swiper/issues/415">#415</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org7d5cdf6" class="outline-5">
<h5 id="org7d5cdf6">Make <kbd>M-o</kbd> not modify the action</h5>
<div class="outline-text-5" id="text-org7d5cdf6">
<p>
See <a href="https://github.com/abo-abo/swiper/issues/454">#454</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org12610f7" class="outline-5">
<h5 id="org12610f7">Make sure user keybindings are respected</h5>
<div class="outline-text-5" id="text-org12610f7">
<p>
See <a href="https://github.com/abo-abo/swiper/issues/466">#466</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-orgfee99fa" class="outline-5">
<h5 id="orgfee99fa">Fix <code>read-file-name</code> with a specified dir</h5>
<div class="outline-text-5" id="text-orgfee99fa">
<p>
See <a href="https://github.com/abo-abo/swiper/issues/475">#475</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-orgb8ba3f9" class="outline-5">
<h5 id="orgb8ba3f9">Don't highlight the match in the file part</h5>
<div class="outline-text-5" id="text-orgb8ba3f9">
<p>
See <a href="https://github.com/abo-abo/swiper/issues/483">#483</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-orgf51408" class="outline-5">
<h5 id="orgf51408">Add a few tests for alists</h5>
<div class="outline-text-5" id="text-orgf51408">
<hr  />
</div>
</div>
</div>
<div id="outline-container-orgb96d382" class="outline-4">
<h4 id="0-8-0-fx-ivy-occur"><a id="orgb96d382"></a><code>ivy-occur</code></h4>
<div class="outline-text-4" id="text-0-8-0-fx-ivy-occur">
</div>
<div id="outline-container-orgdcb32e9" class="outline-5">
<h5 id="orgdcb32e9">Fix <code>default-directory</code></h5>
<div class="outline-text-5" id="text-orgdcb32e9">
<p>
This way, <code>next-error</code> etc will work properly.
</p>
<hr  />
</div>
</div>
</div>
<div id="outline-container-org6bbceab" class="outline-4">
<h4 id="0-8-0-fx-ivy--resize-minibuffer-to-fit"><a id="org6bbceab"></a><code>ivy--resize-minibuffer-to-fit</code></h4>
<div class="outline-text-4" id="text-0-8-0-fx-ivy--resize-minibuffer-to-fit">
</div>
<div id="outline-container-org334da60" class="outline-5">
<h5 id="org334da60">Fix for small delta</h5>
<div class="outline-text-5" id="text-org334da60">
<p>
See <a href="https://github.com/abo-abo/swiper/issues/339">#339</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org2afe2a4" class="outline-5">
<h5 id="org2afe2a4">Check <code>frame-root-window-p</code></h5>
<div class="outline-text-5" id="text-org2afe2a4">
<p>
See <a href="https://github.com/abo-abo/swiper/issues/380">#380</a>.
</p>
<hr  />
</div>
</div>
</div>
<div id="outline-container-org3148504" class="outline-4">
<h4 id="0-8-0-fx-ivy-completing-read"><a id="org3148504"></a><code>ivy-completing-read</code></h4>
<div class="outline-text-4" id="text-0-8-0-fx-ivy-completing-read">
</div>
<div id="outline-container-orgad853e0" class="outline-5">
<h5 id="orgad853e0">Use <code>completing-read-default</code> for tmm</h5>
<div class="outline-text-5" id="text-orgad853e0">
<p>
See <a href="https://github.com/abo-abo/swiper/issues/316">#316</a>.
</p>
<hr  />
</div>
</div>
</div>
<div id="outline-container-org64c54e8" class="outline-4">
<h4 id="0-8-0-fx-ivy--regex-plus"><a id="org64c54e8"></a><code>ivy--regex-plus</code></h4>
<div class="outline-text-4" id="text-0-8-0-fx-ivy--regex-plus">
</div>
<div id="outline-container-orgeb4014" class="outline-5">
<h5 id="orgeb4014">Recognize ! at the beginning of the str</h5>
<div class="outline-text-5" id="text-orgeb4014">
<p>
See <a href="https://github.com/abo-abo/swiper/issues/318">#318</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-orgbb9d02e" class="outline-5">
<h5 id="orgbb9d02e">Prettify a bit</h5>
<div class="outline-text-5" id="text-orgbb9d02e">
<p>
See <a href="https://github.com/abo-abo/swiper/issues/344">#344</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-orged638b6" class="outline-5">
<h5 id="orged638b6">Don't consider <code>\\(?...\)</code> a group</h5>
<div class="outline-text-5" id="text-orged638b6">
<p>
See <a href="https://github.com/abo-abo/swiper/issues/393">#393</a>.
</p>
<hr  />
</div>
</div>
</div>
<div id="outline-container-orgc5acd48" class="outline-4">
<h4 id="0-8-0-fx-ivy--get-window"><a id="orgc5acd48"></a><code>ivy--get-window</code></h4>
<div class="outline-text-4" id="text-0-8-0-fx-ivy--get-window">
</div>
<div id="outline-container-org512de58" class="outline-5">
<h5 id="org512de58">Always return a valid window</h5>
<div class="outline-text-5" id="text-org512de58">
<p>
Even if <code>state</code> is invalid.
</p>
<hr  />
</div>
</div>
</div>
<div id="outline-container-org32cdfac" class="outline-4">
<h4 id="0-8-0-fx-ivy--recompute-index"><a id="org32cdfac"></a><code>ivy--recompute-index</code></h4>
<div class="outline-text-4" id="text-0-8-0-fx-ivy--recompute-index">
</div>
<div id="outline-container-orgad267a0" class="outline-5">
<h5 id="orgad267a0">Update <code>cl-position</code> logic</h5>
<div class="outline-text-5" id="text-orgad267a0">
<p>
See <a href="https://github.com/abo-abo/swiper/issues/207">#207</a>.
</p>
<hr  />
</div>
</div>
</div>
<div id="outline-container-org7447dfa" class="outline-4">
<h4 id="0-8-0-fx-ivy-reverse-i-search"><a id="org7447dfa"></a><code>ivy-reverse-i-search</code></h4>
<div class="outline-text-4" id="text-0-8-0-fx-ivy-reverse-i-search">
</div>
<div id="outline-container-org7e3dd30" class="outline-5">
<h5 id="org7e3dd30">Fix due to recursive update</h5>
<div class="outline-text-5" id="text-org7e3dd30">
<p>
See <a href="https://github.com/abo-abo/swiper/issues/323">#323</a>.
</p>
<hr  />
</div>
</div>
</div>
<div id="outline-container-org5f6b519" class="outline-4">
<h4 id="0-8-0-fx-ivy--reset-state"><a id="org5f6b519"></a><code>ivy--reset-state</code></h4>
<div class="outline-text-4" id="text-0-8-0-fx-ivy--reset-state">
</div>
<div id="outline-container-orgc9841ee" class="outline-5">
<h5 id="orgc9841ee">Don't null <code>initial-input</code></h5>
<div class="outline-text-5" id="text-orgc9841ee">
<p>
This is specifically for <code>'read-file-name-internal</code> collection.  The
input needs to be set to nil for e.g. <code>rgrep</code>, which supplies the
<b>absolute</b> path as <code>initial-input</code>, resulting in a mess.
</p>

<p>
For now, don't set input to nil if <code>:action</code> was passed to <code>ivy-read</code>.
See <a href="https://github.com/abo-abo/swiper/issues/336">#336</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org88d96c8" class="outline-5">
<h5 id="org88d96c8">Don't deactivate region</h5>
<div class="outline-text-5" id="text-org88d96c8">
<p>
See <a href="https://github.com/abo-abo/swiper/issues/377">#377</a>.
</p>
<hr  />
</div>
</div>
</div>
<div id="outline-container-org48f37db" class="outline-4">
<h4 id="0-8-0-fx-ivy-completion-in-region"><a id="org48f37db"></a><code>ivy-completion-in-region</code></h4>
<div class="outline-text-4" id="text-0-8-0-fx-ivy-completion-in-region">
</div>
<div id="outline-container-org1c2d026" class="outline-5">
<h5 id="org1c2d026">Use <code>completion-all-completions</code></h5>
<div class="outline-text-5" id="text-org1c2d026">
<p>
See <a href="https://github.com/abo-abo/swiper/issues/341">#341</a>.
</p>
<hr  />
</div>
</div>
