doc/Changelog.org
**** Optimize for 1 candidate
When there's only one candidate, call the action immediately.
-----
**** Add feedback for 1 candidate
When the sole completion is the same as the input, notify the user.
See [[https://github.com/abo-abo/swiper/issues/350][#350]].
-----
**** Bind =completion-ignore-case=
It's convenient to have it the same value as =case-fold-search=.
-----
*** =ivy-read-action=
:PROPERTIES:
:CUSTOM_ID: 0-8-0-fx-ivy-read-action
:END:
**** Give enough minibuffer space
See [[https://github.com/abo-abo/swiper/issues/402][#402]].
-----
**** Allow to customize the action hint formatter
See [[https://github.com/abo-abo/swiper/issues/469][#469]].
-----
*** =ivy-count-format=
:PROPERTIES:
:CUSTOM_ID: 0-8-0-fx-ivy-count-format
:END:
**** Fix for nil value
See [[https://github.com/abo-abo/swiper/issues/349][#349]].
-----
*** =ivy-switch-buffer=
:PROPERTIES:
:CUSTOM_ID: 0-8-0-fx-ivy-switch-buffer
:END:
**** Don't fall back to =switch-to-buffer=
See [[https://github.com/abo-abo/swiper/issues/410][#410]].
-----
*** =ivy-next-history-element=
:PROPERTIES:
:CUSTOM_ID: 0-8-0-fx-ivy-next-history-element
:END:
**** No "\\_<" for dynamic-collection
"\\_<" regex is Emacs-specific and should only be done if
=:dynamic-collection= is nil.  It is nil for =counsel-git-grep= with
repositories < 20000 lines, but non-nil for larger ones.

Fixes [[https://github.com/abo-abo/swiper/issues/409][#409]].
-----
*** =ivy-occur-press=
:PROPERTIES:
:CUSTOM_ID: 0-8-0-fx-ivy-occur-press
:END:
**** Pulse no longer
Repeated pulses within a short time span resulted in horrible window
flickering.
-----
*** =ivy-resume=
:PROPERTIES:
:CUSTOM_ID: 0-8-0-fx-ivy-resume
:END:
**** Add a guard against null =:action=
-----
*** =ivy-avy=
:PROPERTIES:
:CUSTOM_ID: 0-8-0-fx-ivy-avy
:END:
**** Make ~C-g~ cancel gracefully
See abo-abo/avy[[https://github.com/abo-abo/swiper/issues/140][#140]].
-----
*** =ivy-dispatching-done=
:PROPERTIES:
:CUSTOM_ID: 0-8-0-fx-ivy-dispatching-done
:END:
Allow to exit with no candidates.
-----
*** =swiper=
:PROPERTIES:
:CUSTOM_ID: 0-8-0-fx-swiper
:END:
**** Improve for multiple occurrences on one line
See [[https://github.com/abo-abo/swiper/issues/314][#314]].
-----
**** Fix "backward" search
When none of the previous candidates after the point match the current
input, instead of returning 0, return the index of the last matching
candidate.  This is a good choice, because that candidate is the
closest to the point of the initial search start.

See [[https://github.com/abo-abo/swiper/issues/319][#319]].
-----
**** Return point
See [[https://github.com/abo-abo/swiper/issues/370][#370]].
-----
**** Update =regexp-search-ring=
See [[https://github.com/abo-abo/swiper/issues/89][#89]].
-----
**** Always remove '(field) text property
Allows to search better in modes for shell interaction.
-----
*** =swiper-font-lock-ensure=
:PROPERTIES:
:CUSTOM_ID: 0-8-0-fx-swiper-font-lock-ensure
:END:
**** Add modes
Add bongo-library-mode, bongo-playlist-mode, sauron-mode.

See [[https://github.com/abo-abo/swiper/issues/19][#19]].
-----
**** Don't fail when font-lock is off
See [[https://github.com/abo-abo/swiper/issues/400][#400]].
-----
*** =swiper--multi-candidates=
:PROPERTIES:
:CUSTOM_ID: 0-8-0-fx-swiper--multi-candidates
:END:
**** Add check for =make-string=
See [[https://github.com/abo-abo/swiper/issues/481][#481]].
-----
*** =counsel--async-sentinel=
:PROPERTIES:
:CUSTOM_ID: 0-8-0-fx-counsel--async-sentinel
:END:
**** Fix issue with =ivy--regex-ignore-order=
See [[https://github.com/abo-abo/swiper/issues/342][#342]].
-----
**** Re-display when no cands
**** Recognize error codes other than 1
See [[https://github.com/abo-abo/swiper/issues/394][#394]].
-----
*** =counsel-git=
:PROPERTIES:
:CUSTOM_ID: 0-8-0-fx-counsel-git
:END:
**** Fix window selection.
Use =with-ivy-window=, so that each new file chosen with e.g. ~C-M-n~ is
selected in the same window.
-----
*** =counsel-recoll=
:PROPERTIES:
:CUSTOM_ID: 0-8-0-fx-counsel-recoll
:END:
**** Add =:unwind=
See [[https://github.com/abo-abo/swiper/issues/403][#403]].
-----
*** compilation warnings
:PROPERTIES:
:CUSTOM_ID: 0-8-0-fx-compilation-warnings
:END:
See [[https://github.com/abo-abo/swiper/issues/324][#324]].
-----
** New Features
:PROPERTIES:
:CUSTOM_ID: 0-8-0-fx-new-features
:END:
*** =ivy-read=
:PROPERTIES:
:CUSTOM_ID: 0-8-0-nf-ivy-read
:END:
**** Use =flx= for highlighting fuzzy matches
See [[https://github.com/abo-abo/swiper/issues/207][#207]].
-----
