Changelog.html
<div id="outline-container-org59e6259" class="outline-5">
<h5 id="org59e6259">Optimize for 1 candidate</h5>
<div class="outline-text-5" id="text-org59e6259">
<p>
When there's only one candidate, call the action immediately.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org7891a19" class="outline-5">
<h5 id="org7891a19">Add feedback for 1 candidate</h5>
<div class="outline-text-5" id="text-org7891a19">
<p>
When the sole completion is the same as the input, notify the user.
See <a href="https://github.com/abo-abo/swiper/issues/350">#350</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org5e013a7" class="outline-5">
<h5 id="org5e013a7">Bind <code>completion-ignore-case</code></h5>
<div class="outline-text-5" id="text-org5e013a7">
<p>
It's convenient to have it the same value as <code>case-fold-search</code>.
</p>
<hr  />
</div>
</div>
</div>
<div id="outline-container-org7c95be6" class="outline-4">
<h4 id="0-8-0-fx-ivy-read-action"><a id="org7c95be6"></a><code>ivy-read-action</code></h4>
<div class="outline-text-4" id="text-0-8-0-fx-ivy-read-action">
</div>
<div id="outline-container-org78e2134" class="outline-5">
<h5 id="org78e2134">Give enough minibuffer space</h5>
<div class="outline-text-5" id="text-org78e2134">
<p>
See <a href="https://github.com/abo-abo/swiper/issues/402">#402</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org2f69e9e" class="outline-5">
<h5 id="org2f69e9e">Allow to customize the action hint formatter</h5>
<div class="outline-text-5" id="text-org2f69e9e">
<p>
See <a href="https://github.com/abo-abo/swiper/issues/469">#469</a>.
</p>
<hr  />
</div>
</div>
</div>
<div id="outline-container-org6b54d70" class="outline-4">
<h4 id="0-8-0-fx-ivy-count-format"><a id="org6b54d70"></a><code>ivy-count-format</code></h4>
<div class="outline-text-4" id="text-0-8-0-fx-ivy-count-format">
</div>
<div id="outline-container-org68e10e" class="outline-5">
<h5 id="org68e10e">Fix for nil value</h5>
<div class="outline-text-5" id="text-org68e10e">
<p>
See <a href="https://github.com/abo-abo/swiper/issues/349">#349</a>.
</p>
<hr  />
</div>
</div>
</div>
<div id="outline-container-orga1a6cb8" class="outline-4">
<h4 id="0-8-0-fx-ivy-switch-buffer"><a id="orga1a6cb8"></a><code>ivy-switch-buffer</code></h4>
<div class="outline-text-4" id="text-0-8-0-fx-ivy-switch-buffer">
</div>
<div id="outline-container-org993589f" class="outline-5">
<h5 id="org993589f">Don't fall back to <code>switch-to-buffer</code></h5>
<div class="outline-text-5" id="text-org993589f">
<p>
See <a href="https://github.com/abo-abo/swiper/issues/410">#410</a>.
</p>
<hr  />
</div>
</div>
</div>
<div id="outline-container-org7ea79c9" class="outline-4">
<h4 id="0-8-0-fx-ivy-next-history-element"><a id="org7ea79c9"></a><code>ivy-next-history-element</code></h4>
<div class="outline-text-4" id="text-0-8-0-fx-ivy-next-history-element">
</div>
<div id="outline-container-org2e6a5b2" class="outline-5">
<h5 id="org2e6a5b2">No "\\_&lt;" for dynamic-collection</h5>
<div class="outline-text-5" id="text-org2e6a5b2">
<p>
"\\_&lt;" regex is Emacs-specific and should only be done if
<code>:dynamic-collection</code> is nil.  It is nil for <code>counsel-git-grep</code> with
repositories &lt; 20000 lines, but non-nil for larger ones.
</p>

<p>
Fixes <a href="https://github.com/abo-abo/swiper/issues/409">#409</a>.
</p>
<hr  />
</div>
</div>
</div>
<div id="outline-container-org345869e" class="outline-4">
<h4 id="0-8-0-fx-ivy-occur-press"><a id="org345869e"></a><code>ivy-occur-press</code></h4>
<div class="outline-text-4" id="text-0-8-0-fx-ivy-occur-press">
</div>
<div id="outline-container-orgef099f8" class="outline-5">
<h5 id="orgef099f8">Pulse no longer</h5>
<div class="outline-text-5" id="text-orgef099f8">
<p>
Repeated pulses within a short time span resulted in horrible window
flickering.
</p>
<hr  />
</div>
</div>
</div>
<div id="outline-container-org801ade1" class="outline-4">
<h4 id="0-8-0-fx-ivy-resume"><a id="org801ade1"></a><code>ivy-resume</code></h4>
<div class="outline-text-4" id="text-0-8-0-fx-ivy-resume">
</div>
<div id="outline-container-org4f9941c" class="outline-5">
<h5 id="org4f9941c">Add a guard against null <code>:action</code></h5>
<div class="outline-text-5" id="text-org4f9941c">
<hr  />
</div>
</div>
</div>
<div id="outline-container-org28158ba" class="outline-4">
<h4 id="0-8-0-fx-ivy-avy"><a id="org28158ba"></a><code>ivy-avy</code></h4>
<div class="outline-text-4" id="text-0-8-0-fx-ivy-avy">
</div>
<div id="outline-container-orga681b0e" class="outline-5">
<h5 id="orga681b0e">Make <kbd>C-g</kbd> cancel gracefully</h5>
<div class="outline-text-5" id="text-orga681b0e">
<p>
See abo-abo/avy<a href="https://github.com/abo-abo/swiper/issues/140">#140</a>.
</p>
<hr  />
</div>
</div>
</div>
<div id="outline-container-orgd09274e" class="outline-4">
<h4 id="0-8-0-fx-ivy-dispatching-done"><a id="orgd09274e"></a><code>ivy-dispatching-done</code></h4>
<div class="outline-text-4" id="text-0-8-0-fx-ivy-dispatching-done">
<p>
Allow to exit with no candidates.
</p>
<hr  />
</div>
</div>
<div id="outline-container-orga237aba" class="outline-4">
<h4 id="0-8-0-fx-swiper"><a id="orga237aba"></a><code>swiper</code></h4>
<div class="outline-text-4" id="text-0-8-0-fx-swiper">
</div>
<div id="outline-container-org137b478" class="outline-5">
<h5 id="org137b478">Improve for multiple occurrences on one line</h5>
<div class="outline-text-5" id="text-org137b478">
<p>
See <a href="https://github.com/abo-abo/swiper/issues/314">#314</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-orge67c84b" class="outline-5">
<h5 id="orge67c84b">Fix "backward" search</h5>
<div class="outline-text-5" id="text-orge67c84b">
<p>
When none of the previous candidates after the point match the current
input, instead of returning 0, return the index of the last matching
candidate.  This is a good choice, because that candidate is the
closest to the point of the initial search start.
</p>

<p>
See <a href="https://github.com/abo-abo/swiper/issues/319">#319</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-orgf7cb799" class="outline-5">
<h5 id="orgf7cb799">Return point</h5>
<div class="outline-text-5" id="text-orgf7cb799">
<p>
See <a href="https://github.com/abo-abo/swiper/issues/370">#370</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org137c425" class="outline-5">
<h5 id="org137c425">Update <code>regexp-search-ring</code></h5>
<div class="outline-text-5" id="text-org137c425">
<p>
See <a href="https://github.com/abo-abo/swiper/issues/89">#89</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-orgf18fac5" class="outline-5">
<h5 id="orgf18fac5">Always remove '(field) text property</h5>
<div class="outline-text-5" id="text-orgf18fac5">
<p>
Allows to search better in modes for shell interaction.
</p>
<hr  />
</div>
</div>
</div>
<div id="outline-container-orgc342a4e" class="outline-4">
<h4 id="0-8-0-fx-swiper-font-lock-ensure"><a id="orgc342a4e"></a><code>swiper-font-lock-ensure</code></h4>
<div class="outline-text-4" id="text-0-8-0-fx-swiper-font-lock-ensure">
</div>
<div id="outline-container-orgb37de73" class="outline-5">
<h5 id="orgb37de73">Add modes</h5>
<div class="outline-text-5" id="text-orgb37de73">
<p>
Add bongo-library-mode, bongo-playlist-mode, sauron-mode.
</p>

<p>
See <a href="https://github.com/abo-abo/swiper/issues/19">#19</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org5b4545a" class="outline-5">
<h5 id="org5b4545a">Don't fail when font-lock is off</h5>
<div class="outline-text-5" id="text-org5b4545a">
<p>
See <a href="https://github.com/abo-abo/swiper/issues/400">#400</a>.
</p>
<hr  />
</div>
</div>
</div>
<div id="outline-container-org53c8cc0" class="outline-4">
<h4 id="0-8-0-fx-swiper--multi-candidates"><a id="org53c8cc0"></a><code>swiper--multi-candidates</code></h4>
<div class="outline-text-4" id="text-0-8-0-fx-swiper--multi-candidates">
</div>
<div id="outline-container-org2731f7a" class="outline-5">
<h5 id="org2731f7a">Add check for <code>make-string</code></h5>
<div class="outline-text-5" id="text-org2731f7a">
<p>
See <a href="https://github.com/abo-abo/swiper/issues/481">#481</a>.
</p>
<hr  />
</div>
</div>
</div>
<div id="outline-container-orgc31d0c4" class="outline-4">
<h4 id="0-8-0-fx-counsel--async-sentinel"><a id="orgc31d0c4"></a><code>counsel--async-sentinel</code></h4>
<div class="outline-text-4" id="text-0-8-0-fx-counsel--async-sentinel">
</div>
<div id="outline-container-org35b3503" class="outline-5">
<h5 id="org35b3503">Fix issue with <code>ivy--regex-ignore-order</code></h5>
<div class="outline-text-5" id="text-org35b3503">
<p>
See <a href="https://github.com/abo-abo/swiper/issues/342">#342</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-orgca91d14" class="outline-5">
<h5 id="orgca91d14">Re-display when no cands</h5>
</div>
<div id="outline-container-orgfafcae5" class="outline-5">
<h5 id="orgfafcae5">Recognize error codes other than 1</h5>
<div class="outline-text-5" id="text-orgfafcae5">
<p>
See <a href="https://github.com/abo-abo/swiper/issues/394">#394</a>.
</p>
<hr  />
</div>
</div>
</div>
<div id="outline-container-org2d624b8" class="outline-4">
<h4 id="0-8-0-fx-counsel-git"><a id="org2d624b8"></a><code>counsel-git</code></h4>
<div class="outline-text-4" id="text-0-8-0-fx-counsel-git">
</div>
<div id="outline-container-orgc118ad5" class="outline-5">
<h5 id="orgc118ad5">Fix window selection.</h5>
<div class="outline-text-5" id="text-orgc118ad5">
<p>
Use <code>with-ivy-window</code>, so that each new file chosen with e.g. <kbd>C-M-n</kbd> is
selected in the same window.
</p>
<hr  />
</div>
</div>
</div>
<div id="outline-container-org8e69ad9" class="outline-4">
<h4 id="0-8-0-fx-counsel-recoll"><a id="org8e69ad9"></a><code>counsel-recoll</code></h4>
<div class="outline-text-4" id="text-0-8-0-fx-counsel-recoll">
</div>
<div id="outline-container-org2ccee1b" class="outline-5">
<h5 id="org2ccee1b">Add <code>:unwind</code></h5>
<div class="outline-text-5" id="text-org2ccee1b">
<p>
See <a href="https://github.com/abo-abo/swiper/issues/403">#403</a>.
</p>
<hr  />
</div>
</div>
</div>
<div id="outline-container-org28595ea" class="outline-4">
<h4 id="0-8-0-fx-compilation-warnings"><a id="org28595ea"></a>compilation warnings</h4>
<div class="outline-text-4" id="text-0-8-0-fx-compilation-warnings">
<p>
See <a href="https://github.com/abo-abo/swiper/issues/324">#324</a>.
</p>
<hr  />
</div>
</div>
</div>
<div id="outline-container-org1cf8e57" class="outline-3">
<h3 id="0-8-0-fx-new-features"><a id="org1cf8e57"></a>New Features</h3>
<div class="outline-text-3" id="text-0-8-0-fx-new-features">
</div>
<div id="outline-container-org90ae5fa" class="outline-4">
<h4 id="0-8-0-nf-ivy-read"><a id="org90ae5fa"></a><code>ivy-read</code></h4>
<div class="outline-text-4" id="text-0-8-0-nf-ivy-read">
</div>
<div id="outline-container-orgc848648" class="outline-5">
<h5 id="orgc848648">Use <code>flx</code> for highlighting fuzzy matches</h5>
<div class="outline-text-5" id="text-orgc848648">
<p>
See <a href="https://github.com/abo-abo/swiper/issues/207">#207</a>.
</p>
<hr  />
</div>
</div>
