doc/Changelog.org
**** Simplify the signature for =:dynamic-collection= functions
When given =:dynamic-collection=, assume the collection function only
needs one argument - the string input.
-----
**** Modify ~M-n~ prediction when region is active
When the region is active and ~M-n~ is called, insert the region
contents into the minibuffer and deactivate the region. The region
deactivation is done for =swiper=, to make it easier to search for
multiple words or a subword.
-----
**** Allow to compose collections
***** Example 1: async collection
Stack =recentf= on top of =counsel-locate=:

#+begin_src elisp
(defun small-test ()
  (cl-subseq recentf-list 0 10))

(ivy-set-sources
 'counsel-locate
 '((small-test)
   (original-source)))
#+end_src

Here, (original-source) represents the async candidates of
=counsel-locate=. All extra sources are static - each function is called
once to generate a list of strings, which will be filtered later.

The order matters, so you can have e.g.:

#+begin_src elisp
(ivy-set-sources
 'counsel-locate
 '((original-source)
   (small-test)))
#+end_src

See [[https://github.com/abo-abo/swiper/issues/373][#373]].
-----
***** Example 2: sync collection
#+begin_src elisp
(defun my-extra-source ()
  (append
   (when (eq 'Git (vc-backend (buffer-file-name)))
     (list "git1" "git2" "git3"))
   (when (file-exists-p "doc/Changelog.org")
     (list (propertize "doc/Changelog.org" 'face '(:background "red"))))))

(defun my-find-file ()
  (interactive)
  (ivy-read "Find file: " 'read-file-name-internal
            :action (lambda (x)
                      (with-ivy-window
                        (find-file (expand-file-name x ivy--directory))))
            :require-match 'confirm-after-completion
            :history 'file-name-history
            :caller 'my-find-file))

(ivy-set-sources
 'my-find-file
 '((my-extra-source)
   (original-source)))
#+end_src

The function =my-find-file= knows nothing about the extra source, it's
only purpose is to introduce a =:caller= to attach things to, as to not
to mess up e.g. =counsel-find-file=.

The function =my-extra-source= gets called once in =ivy-read= via
=ivy--reset-state=. It takes no args and returns a list of strings,
possibly empty.
-----
**** Improve documentation UI
Bind ~C-h m~ to =ivy-help=.

=ivy-help-file= is a new defvar pointing to the ivy-help.org file.

Bind ~D~ in =hydra-ivy= to go to hydra's definition.

See [[https://github.com/abo-abo/swiper/issues/376][#376]] and [[https://github.com/abo-abo/swiper/issues/379][#379]].
-----
**** Add ignore pattern toggling
~C-c C-a~ is bound to =ivy-toggle-ignore= - a new command to toggle ignore
patterns (user-configured filtering). If the ignore patterns are
enabled and there are zero candidates after ignoring, display the ones
that match the current text. This feature currently works for
=ivy-switch-buffer= and =counsel-find-file=.

See [[https://github.com/abo-abo/swiper/issues/369][#369]].
-----
*** =ivy-mode=
:PROPERTIES:
:CUSTOM_ID: 0-8-0-nf-ivy-mode
:END:
**** Set =completion-in-region-function=
See [[https://github.com/abo-abo/swiper/issues/331][#331]].
-----
**** Improve ~M-n~ for ='read-file-name-internal=
-----
*** =ivy-set-occur=
:PROPERTIES:
:CUSTOM_ID: 0-8-0-nf-ivy-set-occur
:END:
Allows to customize =ivy-occur= per-command.
-----
**** Add custom occur for =ivy-switch-buffer=
See [[https://github.com/abo-abo/swiper/issues/438][#438]] and [[https://github.com/abo-abo/swiper/issues/440][#440]].
-----
*** =ivy-occur-mode=
:PROPERTIES:
:CUSTOM_ID: 0-8-0-nf-ivy-occur-mode
:END:
**** New commands on ~j~, ~k~, ~c~
(ivy-occur-toggle-calling): New command bound to ~c~.
(ivy-occur-next-line): New command bound to ~j~.
(ivy-occur-previous-line): New command bound to ~k~.

This makes =ivy-occur= much more convenient, instead of ~gjgjgjg~, just
~cjjj~. Especially good for commands that change the contents of the
other window, like =describe-function= or =counsel-git-grep=.

Example:

- ~C-h f~ (=describe-funtion=)
- =run= (=self-insert-command=)
- ~C-c C-o~ (=ivy-occur=); ~C-o u~ also works.
- ~cjjjjkkkk~
-----
**** New command =ivy-occur-revert-buffer= on ~g~
Does what e.g. =revert-buffer= does for *Help* buffers.

Has special handling for =counsel-git-grep=, =counsel-ag= and
=counsel-grep=: will run the shell command once more and reflect the
updates in files.

Move =ivy-occur-press= from ~g~ to ~f~.
-----
**** Improve the feedback for ~j~ and ~k~
The overlays will be more responsive now.
-----
*** =ivy-re-builders-alist=
:PROPERTIES:
:CUSTOM_ID: 0-8-0-nf-ivy-re-builders-alist
:END:
**** Allow =this-command= to be a key
Example:
#+begin_src elisp
(defun asdf ()
  (interactive)
  (completing-read "prompt: " '("abc" "abcd" "def")))

(global-set-key (kbd "C-c t") 'asdf)

(setq ivy-re-builders-alist
      '(
        (asdf . ivy--regex-fuzzy)
        (t . ivy--regex-plus)))
#+end_src
This is useful for commands that you didn't write. For new commands
that you write, consider using =ivy-read= and =:caller=.

See [[https://github.com/abo-abo/swiper/issues/330][#330]].
-----
*** =ivy-set-actions=
:PROPERTIES:
:CUSTOM_ID: 0-8-0-nf-ivy-set-actions
:END:
