Changelog.html
<div id="outline-container-orgcbc46be" class="outline-5">
<h5 id="orgcbc46be">Simplify the signature for <code>:dynamic-collection</code> functions</h5>
<div class="outline-text-5" id="text-orgcbc46be">
<p>
When given <code>:dynamic-collection</code>, assume the collection function only
needs one argument - the string input.
</p>
<hr  />
</div>
</div>
<div id="outline-container-orgad3d3b2" class="outline-5">
<h5 id="orgad3d3b2">Modify <kbd>M-n</kbd> prediction when region is active</h5>
<div class="outline-text-5" id="text-orgad3d3b2">
<p>
When the region is active and <kbd>M-n</kbd> is called, insert the region
contents into the minibuffer and deactivate the region. The region
deactivation is done for <code>swiper</code>, to make it easier to search for
multiple words or a subword.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org2cd2ef5" class="outline-5">
<h5 id="org2cd2ef5">Allow to compose collections</h5>
<div class="outline-text-5" id="text-org2cd2ef5">
</div><ul class="org-ul"><li><a id="org94ce27c"></a>Example 1: async collection<br  /><div class="outline-text-6" id="text-org94ce27c">
<p>
Stack <code>recentf</code> on top of <code>counsel-locate</code>:
</p>

<div class="org-src-container">

<pre class="src src-elisp">(<span style="color: #7F0055; font-weight: bold;">defun</span> <span style="color: #000000; font-weight: bold;">small-test</span> ()
  (cl-subseq recentf-list 0 10))

(ivy-set-sources
 'counsel-locate
 '((small-test)
   (original-source)))
</pre>
</div>

<p>
Here, (original-source) represents the async candidates of
<code>counsel-locate</code>. All extra sources are static - each function is called
once to generate a list of strings, which will be filtered later.
</p>

<p>
The order matters, so you can have e.g.:
</p>

<div class="org-src-container">

<pre class="src src-elisp">(ivy-set-sources
 'counsel-locate
 '((original-source)
   (small-test)))
</pre>
</div>

<p>
See <a href="https://github.com/abo-abo/swiper/issues/373">#373</a>.
</p>
<hr  />
</div></li>
<li><a id="org1c7b0bd"></a>Example 2: sync collection<br  /><div class="outline-text-6" id="text-org1c7b0bd">
<div class="org-src-container">

<pre class="src src-elisp">(<span style="color: #7F0055; font-weight: bold;">defun</span> <span style="color: #000000; font-weight: bold;">my-extra-source</span> ()
  (append
   (<span style="color: #7F0055; font-weight: bold;">when</span> (eq 'Git (vc-backend (buffer-file-name)))
     (list <span style="color: #2A00FF;">"git1"</span> <span style="color: #2A00FF;">"git2"</span> <span style="color: #2A00FF;">"git3"</span>))
   (<span style="color: #7F0055; font-weight: bold;">when</span> (file-exists-p <span style="color: #2A00FF;">"doc/Changelog.org"</span>)
     (list (propertize <span style="color: #2A00FF;">"doc/Changelog.org"</span> 'face '(<span style="color: #7F0055; font-weight: bold;">:background</span> <span style="color: #2A00FF;">"red"</span>))))))

(<span style="color: #7F0055; font-weight: bold;">defun</span> <span style="color: #000000; font-weight: bold;">my-find-file</span> ()
  (<span style="color: #7F0055; font-weight: bold;">interactive</span>)
  (ivy-read <span style="color: #2A00FF;">"Find file: "</span> 'read-file-name-internal
            <span style="color: #7F0055; font-weight: bold;">:action</span> (<span style="color: #7F0055; font-weight: bold;">lambda</span> (x)
                      (with-ivy-window
                        (find-file (expand-file-name x ivy--directory))))
            <span style="color: #7F0055; font-weight: bold;">:require-match</span> 'confirm-after-completion
            <span style="color: #7F0055; font-weight: bold;">:history</span> 'file-name-history
            <span style="color: #7F0055; font-weight: bold;">:caller</span> 'my-find-file))

(ivy-set-sources
 'my-find-file
 '((my-extra-source)
   (original-source)))
</pre>
</div>

<p>
The function <code>my-find-file</code> knows nothing about the extra source, it's
only purpose is to introduce a <code>:caller</code> to attach things to, as to not
to mess up e.g. <code>counsel-find-file</code>.
</p>

<p>
The function <code>my-extra-source</code> gets called once in <code>ivy-read</code> via
<code>ivy--reset-state</code>. It takes no args and returns a list of strings,
possibly empty.
</p>
<hr  />
</div></li></ul>
</div>
<div id="outline-container-orgb2f64f7" class="outline-5">
<h5 id="orgb2f64f7">Improve documentation UI</h5>
<div class="outline-text-5" id="text-orgb2f64f7">
<p>
Bind <kbd>C-h m</kbd> to <code>ivy-help</code>.
</p>

<p>
<code>ivy-help-file</code> is a new defvar pointing to the ivy-help.org file.
</p>

<p>
Bind <kbd>D</kbd> in <code>hydra-ivy</code> to go to hydra's definition.
</p>

<p>
See <a href="https://github.com/abo-abo/swiper/issues/376">#376</a> and <a href="https://github.com/abo-abo/swiper/issues/379">#379</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org5ecc1a7" class="outline-5">
<h5 id="org5ecc1a7">Add ignore pattern toggling</h5>
<div class="outline-text-5" id="text-org5ecc1a7">
<p>
<kbd>C-c C-a</kbd> is bound to <code>ivy-toggle-ignore</code> - a new command to toggle ignore
patterns (user-configured filtering). If the ignore patterns are
enabled and there are zero candidates after ignoring, display the ones
that match the current text. This feature currently works for
<code>ivy-switch-buffer</code> and <code>counsel-find-file</code>.
</p>

<p>
See <a href="https://github.com/abo-abo/swiper/issues/369">#369</a>.
</p>
<hr  />
</div>
</div>
</div>
<div id="outline-container-org7be262c" class="outline-4">
<h4 id="0-8-0-nf-ivy-mode"><a id="org7be262c"></a><code>ivy-mode</code></h4>
<div class="outline-text-4" id="text-0-8-0-nf-ivy-mode">
</div>
<div id="outline-container-org8c14d72" class="outline-5">
<h5 id="org8c14d72">Set <code>completion-in-region-function</code></h5>
<div class="outline-text-5" id="text-org8c14d72">
<p>
See <a href="https://github.com/abo-abo/swiper/issues/331">#331</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-orga2c3f61" class="outline-5">
<h5 id="orga2c3f61">Improve <kbd>M-n</kbd> for <code>'read-file-name-internal</code></h5>
<div class="outline-text-5" id="text-orga2c3f61">
<hr  />
</div>
</div>
</div>
<div id="outline-container-orga88877a" class="outline-4">
<h4 id="0-8-0-nf-ivy-set-occur"><a id="orga88877a"></a><code>ivy-set-occur</code></h4>
<div class="outline-text-4" id="text-0-8-0-nf-ivy-set-occur">
<p>
Allows to customize <code>ivy-occur</code> per-command.
</p>
<hr  />
</div>
<div id="outline-container-org241b419" class="outline-5">
<h5 id="org241b419">Add custom occur for <code>ivy-switch-buffer</code></h5>
<div class="outline-text-5" id="text-org241b419">
<p>
See <a href="https://github.com/abo-abo/swiper/issues/438">#438</a> and <a href="https://github.com/abo-abo/swiper/issues/440">#440</a>.
</p>
<hr  />
</div>
</div>
</div>
<div id="outline-container-org628dbbd" class="outline-4">
<h4 id="0-8-0-nf-ivy-occur-mode"><a id="org628dbbd"></a><code>ivy-occur-mode</code></h4>
<div class="outline-text-4" id="text-0-8-0-nf-ivy-occur-mode">
</div>
<div id="outline-container-org66779e3" class="outline-5">
<h5 id="org66779e3">New commands on <kbd>j</kbd>, <kbd>k</kbd>, <kbd>c</kbd></h5>
<div class="outline-text-5" id="text-org66779e3">
<p>
(ivy-occur-toggle-calling): New command bound to <kbd>c</kbd>.
(ivy-occur-next-line): New command bound to <kbd>j</kbd>.
(ivy-occur-previous-line): New command bound to <kbd>k</kbd>.
</p>

<p>
This makes <code>ivy-occur</code> much more convenient, instead of <kbd>gjgjgjg</kbd>, just
<kbd>cjjj</kbd>. Especially good for commands that change the contents of the
other window, like <code>describe-function</code> or <code>counsel-git-grep</code>.
</p>

<p>
Example:
</p>

<ul class="org-ul">
<li><kbd>C-h f</kbd> (<code>describe-funtion</code>)</li>
<li><code>run</code> (<code>self-insert-command</code>)</li>
<li><kbd>C-c C-o</kbd> (<code>ivy-occur</code>); <kbd>C-o u</kbd> also works.</li>
<li><kbd>cjjjjkkkk</kbd></li>
</ul>
<hr  />
</div>
</div>
<div id="outline-container-orgbacf2bf" class="outline-5">
<h5 id="orgbacf2bf">New command <code>ivy-occur-revert-buffer</code> on <kbd>g</kbd></h5>
<div class="outline-text-5" id="text-orgbacf2bf">
<p>
Does what e.g. <code>revert-buffer</code> does for <b>Help</b> buffers.
</p>

<p>
Has special handling for <code>counsel-git-grep</code>, <code>counsel-ag</code> and
<code>counsel-grep</code>: will run the shell command once more and reflect the
updates in files.
</p>

<p>
Move <code>ivy-occur-press</code> from <kbd>g</kbd> to <kbd>f</kbd>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org5cf29b2" class="outline-5">
<h5 id="org5cf29b2">Improve the feedback for <kbd>j</kbd> and <kbd>k</kbd></h5>
<div class="outline-text-5" id="text-org5cf29b2">
<p>
The overlays will be more responsive now.
</p>
<hr  />
</div>
</div>
</div>
<div id="outline-container-org95491c1" class="outline-4">
<h4 id="0-8-0-nf-ivy-re-builders-alist"><a id="org95491c1"></a><code>ivy-re-builders-alist</code></h4>
<div class="outline-text-4" id="text-0-8-0-nf-ivy-re-builders-alist">
</div>
<div id="outline-container-orgc70f52d" class="outline-5">
<h5 id="orgc70f52d">Allow <code>this-command</code> to be a key</h5>
<div class="outline-text-5" id="text-orgc70f52d">
<p>
Example:
</p>
<div class="org-src-container">

<pre class="src src-elisp">(<span style="color: #7F0055; font-weight: bold;">defun</span> <span style="color: #000000; font-weight: bold;">asdf</span> ()
  (<span style="color: #7F0055; font-weight: bold;">interactive</span>)
  (completing-read <span style="color: #2A00FF;">"prompt: "</span> '(<span style="color: #2A00FF;">"abc"</span> <span style="color: #2A00FF;">"abcd"</span> <span style="color: #2A00FF;">"def"</span>)))

(global-set-key (kbd <span style="color: #2A00FF;">"C-c t"</span>) 'asdf)

(<span style="color: #7F0055; font-weight: bold;">setq</span> ivy-re-builders-alist
      '(
        (asdf . ivy--regex-fuzzy)
        (t . ivy--regex-plus)))
</pre>
</div>
<p>
This is useful for commands that you didn't write. For new commands
that you write, consider using <code>ivy-read</code> and <code>:caller</code>.
</p>

<p>
See <a href="https://github.com/abo-abo/swiper/issues/330">#330</a>.
</p>
<hr  />
</div>
</div>
</div>
