doc/Changelog.org
**** Call with =t= to affect all commands
Example:

#+begin_src elisp
(ivy-set-actions
 t
 '(("i" insert "insert")))
#+end_src

Now an "insert" action will be available for all =ivy-read= sessions
when pressing ~M-o~.

See [[https://github.com/abo-abo/swiper/issues/337][#337]].
-----
*** =ivy-faces=
:PROPERTIES:
:CUSTOM_ID: 0-8-0-nf-ivy-faces
:END:
New defcustom group.
See [[https://github.com/abo-abo/swiper/issues/389][#389]].
-----
*** =ivy-flx-limit=
:PROPERTIES:
:CUSTOM_ID: 0-8-0-nf-ivy-flx-limit
:END:
New variable. Configure when =flx= is used.
See [[https://github.com/abo-abo/swiper/issues/207][#207]].
-----
*** =ivy-inhibit-action=
:PROPERTIES:
:CUSTOM_ID: 0-8-0-nf-ivy-inhibit-action
:END:
New variable. See [[https://github.com/abo-abo/swiper/issues/363][#363]].
-----
*** =ivy-do-completion-in-region=
:PROPERTIES:
:CUSTOM_ID: 0-8-0-nf-ivy-do-completion-in-region
:END:
New defcustom. See [[https://github.com/abo-abo/swiper/issues/367][#367]].
-----
*** =ivy-fixed-height-minibuffer=
:PROPERTIES:
:CUSTOM_ID: 0-8-0-nf-ivy-fixed-height-minibuffer
:END:
New defcustom.

When non nil, fix the height of the minibuffer during ivy completion
at =ivy-height=. This effectively sets the minimum height at this level
and tries to ensure that it does not change depending on the number of
candidates.

See [[https://github.com/abo-abo/swiper/issues/353][#353]].
-----
*** =ivy-set-display-transformer=
:PROPERTIES:
:CUSTOM_ID: 0-8-0-nf-ivy-set-display-transformer
:END:
New API function.

Now used by =switch-to-buffer= and =read-file-name=.

See [[https://github.com/abo-abo/swiper/issues/399][#399]].
-----
*** =ivy-ignore-buffers=
:PROPERTIES:
:CUSTOM_ID: 0-8-0-nf-ivy-ignore-buffers
:END:
New defcustom similar to =ido-ignore-buffers=.

See [[https://github.com/abo-abo/swiper/issues/382][#382]] and [[https://github.com/abo-abo/swiper/issues/366][#366]].
-----
*** =ivy-add-newline-after-prompt=
:PROPERTIES:
:CUSTOM_ID: 0-8-0-nf-ivy-add-newline-after-prompt
:END:
New defcustom.

See [[https://github.com/abo-abo/swiper/issues/451][#451]].
-----
*** =ivy-switch-buffer=
:PROPERTIES:
:CUSTOM_ID: 0-8-0-nf-ivy-switch-buffer
:END:
**** Add virtual views
=ivy-views= variable stores pre-defined views. Allows to set a window
configuration with many buffers from =ivy-switch-buffer=.

How to use: just set =ivy-views= appropriately. An example value is
provided (but nulled, so that it's empty initially).
-----
*** =ivy-use-ignore-default=
:PROPERTIES:
:CUSTOM_ID: 0-8-0-nf-ivy-use-ignore-default
:END:
New defcustom

See [[https://github.com/abo-abo/swiper/issues/477][#477]].
-----
*** =swiper=
:PROPERTIES:
:CUSTOM_ID: 0-8-0-nf-swiper
:END:
**** Improve =swiper-query-replace=
To replace a symbol with a similar symbol,

1. Press ~C-s M-n~ for =swiper= and select the symbol at point as input.
2. Press ~M-q~ for =swiper-query-replace=
3. Press ~M-n~ to yank the symbol to replace.
4. Edit the replacement and ~RET~.

Here step-3 was modified to yank e.g. "symbol" instead of
"\_<symbol\_>" previously.
-----
*** =swiper-font-lock-exclude=
:PROPERTIES:
:CUSTOM_ID: 0-8-0-nf-swiper-font-lock-exclude
:END:
New variable for major modes that misbehave with =font-lock-ensure=.
See [[https://github.com/abo-abo/swiper/issues/346][#346]].
-----
*** =swiper-all=
:PROPERTIES:
:CUSTOM_ID: 0-8-0-nf-swiper-all
:END:
**** New auto-updates position
See [[https://github.com/abo-abo/swiper/issues/401][#401]].
-----
*** =counsel-mode=
:PROPERTIES:
:CUSTOM_ID: 0-8-0-nf-counsel-mode
:END:
A minor-mode that remaps built-in functions that have counsel
replacements available.

See [[https://github.com/abo-abo/swiper/issues/414][#414]].
-----
**** Allow use of describe-prefix-bindings
See [[https://github.com/abo-abo/swiper/issues/441][#441]].
-----
*** =counsel-find-file=
:PROPERTIES:
:CUSTOM_ID: 0-8-0-nf-counsel-find-file
:END:
**** Add =initial-input=
See [[https://github.com/abo-abo/swiper/issues/336][#336]].
-----
**** Change tramp prompt from "Find File: " to "user@host: "
**** Bind =counsel-up-directory= to ~C-DEL~
New function that moves up to the parent directory and at the same
time preselects the current directory. This is useful for moving up
and down a file tree quickly.

See [[https://github.com/abo-abo/swiper/issues/343][#343]].
-----
**** Customize =M-n= action
This feature allows to quickly visit Github issues from either
=magit-commit-mode= or from a version-controlled file. The point has to
be at the "#" char in e.g. "[[https://github.com/abo-abo/swiper/issues/123][#123]]", that represents an issue.

It's possible to customize =ivy-ffap-url-functions= to do a similar
thing for places other than Github.

The ~C-x C-f M-n~ key binding will work better with =counsel-find-file=,
for plain =find-file= it will open a =dired= buffer in addition to opening
the URL.
-----
**** Can un-ignore dotfiles with a leading dot input
When =ivy-text= starts with a dot, don't use
=counsel-find-file-ignore-regexp=. The generic way to do this is with
~C-c C-a~ (=ivy-toggle-ignore=), but this is faster and more convenient.

See [[https://github.com/abo-abo/swiper/issues/408][#408]].
-----
**** Bind ~M-o f~ to =find-file-other-window=
**** Correctly expand file name at point
See [[https://github.com/abo-abo/swiper/issues/430][#430]].
-----
