Changelog.html
<div id="outline-container-org75d46fc" class="outline-4">
<h4 id="0-8-0-nf-ivy-set-actions"><a id="org75d46fc"></a><code>ivy-set-actions</code></h4>
<div class="outline-text-4" id="text-0-8-0-nf-ivy-set-actions">
</div>
<div id="outline-container-orgc78a03" class="outline-5">
<h5 id="orgc78a03">Call with <code>t</code> to affect all commands</h5>
<div class="outline-text-5" id="text-orgc78a03">
<p>
Example:
</p>

<div class="org-src-container">

<pre class="src src-elisp">(ivy-set-actions
 t
 '((<span style="color: #2A00FF;">"i"</span> insert <span style="color: #2A00FF;">"insert"</span>)))
</pre>
</div>

<p>
Now an "insert" action will be available for all <code>ivy-read</code> sessions
when pressing <kbd>M-o</kbd>.
</p>

<p>
See <a href="https://github.com/abo-abo/swiper/issues/337">#337</a>.
</p>
<hr  />
</div>
</div>
</div>
<div id="outline-container-org909883c" class="outline-4">
<h4 id="0-8-0-nf-ivy-faces"><a id="org909883c"></a><code>ivy-faces</code></h4>
<div class="outline-text-4" id="text-0-8-0-nf-ivy-faces">
<p>
New defcustom group.
See <a href="https://github.com/abo-abo/swiper/issues/389">#389</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org771efb" class="outline-4">
<h4 id="0-8-0-nf-ivy-flx-limit"><a id="org771efb"></a><code>ivy-flx-limit</code></h4>
<div class="outline-text-4" id="text-0-8-0-nf-ivy-flx-limit">
<p>
New variable. Configure when <code>flx</code> is used.
See <a href="https://github.com/abo-abo/swiper/issues/207">#207</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org819f77" class="outline-4">
<h4 id="0-8-0-nf-ivy-inhibit-action"><a id="org819f77"></a><code>ivy-inhibit-action</code></h4>
<div class="outline-text-4" id="text-0-8-0-nf-ivy-inhibit-action">
<p>
New variable. See <a href="https://github.com/abo-abo/swiper/issues/363">#363</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-orgb0dc9f2" class="outline-4">
<h4 id="0-8-0-nf-ivy-do-completion-in-region"><a id="orgb0dc9f2"></a><code>ivy-do-completion-in-region</code></h4>
<div class="outline-text-4" id="text-0-8-0-nf-ivy-do-completion-in-region">
<p>
New defcustom. See <a href="https://github.com/abo-abo/swiper/issues/367">#367</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org5dbd89a" class="outline-4">
<h4 id="0-8-0-nf-ivy-fixed-height-minibuffer"><a id="org5dbd89a"></a><code>ivy-fixed-height-minibuffer</code></h4>
<div class="outline-text-4" id="text-0-8-0-nf-ivy-fixed-height-minibuffer">
<p>
New defcustom.
</p>

<p>
When non nil, fix the height of the minibuffer during ivy completion
at <code>ivy-height</code>. This effectively sets the minimum height at this level
and tries to ensure that it does not change depending on the number of
candidates.
</p>

<p>
See <a href="https://github.com/abo-abo/swiper/issues/353">#353</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org50d2b45" class="outline-4">
<h4 id="0-8-0-nf-ivy-set-display-transformer"><a id="org50d2b45"></a><code>ivy-set-display-transformer</code></h4>
<div class="outline-text-4" id="text-0-8-0-nf-ivy-set-display-transformer">
<p>
New API function.
</p>

<p>
Now used by <code>switch-to-buffer</code> and <code>read-file-name</code>.
</p>

<p>
See <a href="https://github.com/abo-abo/swiper/issues/399">#399</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-orgc8eb603" class="outline-4">
<h4 id="0-8-0-nf-ivy-ignore-buffers"><a id="orgc8eb603"></a><code>ivy-ignore-buffers</code></h4>
<div class="outline-text-4" id="text-0-8-0-nf-ivy-ignore-buffers">
<p>
New defcustom similar to <code>ido-ignore-buffers</code>.
</p>

<p>
See <a href="https://github.com/abo-abo/swiper/issues/382">#382</a> and <a href="https://github.com/abo-abo/swiper/issues/366">#366</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-orgca7510" class="outline-4">
<h4 id="0-8-0-nf-ivy-add-newline-after-prompt"><a id="orgca7510"></a><code>ivy-add-newline-after-prompt</code></h4>
<div class="outline-text-4" id="text-0-8-0-nf-ivy-add-newline-after-prompt">
<p>
New defcustom.
</p>

<p>
See <a href="https://github.com/abo-abo/swiper/issues/451">#451</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-orgc7d433a" class="outline-4">
<h4 id="0-8-0-nf-ivy-switch-buffer"><a id="orgc7d433a"></a><code>ivy-switch-buffer</code></h4>
<div class="outline-text-4" id="text-0-8-0-nf-ivy-switch-buffer">
</div>
<div id="outline-container-org6f60335" class="outline-5">
<h5 id="org6f60335">Add virtual views</h5>
<div class="outline-text-5" id="text-org6f60335">
<p>
<code>ivy-views</code> variable stores pre-defined views. Allows to set a window
configuration with many buffers from <code>ivy-switch-buffer</code>.
</p>

<p>
How to use: just set <code>ivy-views</code> appropriately. An example value is
provided (but nulled, so that it's empty initially).
</p>
<hr  />
</div>
</div>
</div>
<div id="outline-container-org4e31430" class="outline-4">
<h4 id="0-8-0-nf-ivy-use-ignore-default"><a id="org4e31430"></a><code>ivy-use-ignore-default</code></h4>
<div class="outline-text-4" id="text-0-8-0-nf-ivy-use-ignore-default">
<p>
New defcustom
</p>

<p>
See <a href="https://github.com/abo-abo/swiper/issues/477">#477</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org74951bf" class="outline-4">
<h4 id="0-8-0-nf-swiper"><a id="org74951bf"></a><code>swiper</code></h4>
<div class="outline-text-4" id="text-0-8-0-nf-swiper">
</div>
<div id="outline-container-orgdce7d4f" class="outline-5">
<h5 id="orgdce7d4f">Improve <code>swiper-query-replace</code></h5>
<div class="outline-text-5" id="text-orgdce7d4f">
<p>
To replace a symbol with a similar symbol,
</p>

<ol class="org-ol">
<li>Press <kbd>C-s M-n</kbd> for <code>swiper</code> and select the symbol at point as input.</li>
<li>Press <kbd>M-q</kbd> for <code>swiper-query-replace</code></li>
<li>Press <kbd>M-n</kbd> to yank the symbol to replace.</li>
<li>Edit the replacement and <kbd>RET</kbd>.</li>
</ol>

<p>
Here step-3 was modified to yank e.g. "symbol" instead of
"\_&lt;symbol\_&gt;" previously.
</p>
<hr  />
</div>
</div>
</div>
<div id="outline-container-org70edab4" class="outline-4">
<h4 id="0-8-0-nf-swiper-font-lock-exclude"><a id="org70edab4"></a><code>swiper-font-lock-exclude</code></h4>
<div class="outline-text-4" id="text-0-8-0-nf-swiper-font-lock-exclude">
<p>
New variable for major modes that misbehave with <code>font-lock-ensure</code>.
See <a href="https://github.com/abo-abo/swiper/issues/346">#346</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org6a70832" class="outline-4">
<h4 id="0-8-0-nf-swiper-all"><a id="org6a70832"></a><code>swiper-all</code></h4>
<div class="outline-text-4" id="text-0-8-0-nf-swiper-all">
</div>
<div id="outline-container-org1aa6f66" class="outline-5">
<h5 id="org1aa6f66">New auto-updates position</h5>
<div class="outline-text-5" id="text-org1aa6f66">
<p>
See <a href="https://github.com/abo-abo/swiper/issues/401">#401</a>.
</p>
<hr  />
</div>
</div>
</div>
<div id="outline-container-orgc8b70e4" class="outline-4">
<h4 id="0-8-0-nf-counsel-mode"><a id="orgc8b70e4"></a><code>counsel-mode</code></h4>
<div class="outline-text-4" id="text-0-8-0-nf-counsel-mode">
<p>
A minor-mode that remaps built-in functions that have counsel
replacements available.
</p>

<p>
See <a href="https://github.com/abo-abo/swiper/issues/414">#414</a>.
</p>
<hr  />
</div>
<div id="outline-container-orgce1157b" class="outline-5">
<h5 id="orgce1157b">Allow use of describe-prefix-bindings</h5>
<div class="outline-text-5" id="text-orgce1157b">
<p>
See <a href="https://github.com/abo-abo/swiper/issues/441">#441</a>.
</p>
<hr  />
</div>
</div>
</div>
<div id="outline-container-orgaa7e4fb" class="outline-4">
<h4 id="0-8-0-nf-counsel-find-file"><a id="orgaa7e4fb"></a><code>counsel-find-file</code></h4>
<div class="outline-text-4" id="text-0-8-0-nf-counsel-find-file">
</div>
<div id="outline-container-orgafaf2ce" class="outline-5">
<h5 id="orgafaf2ce">Add <code>initial-input</code></h5>
<div class="outline-text-5" id="text-orgafaf2ce">
<p>
See <a href="https://github.com/abo-abo/swiper/issues/336">#336</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-orgfc214f3" class="outline-5">
<h5 id="orgfc214f3">Change tramp prompt from "Find File: " to "user@host: "</h5>
</div>
<div id="outline-container-orgf1183ab" class="outline-5">
<h5 id="orgf1183ab">Bind <code>counsel-up-directory</code> to <kbd>C-DEL</kbd></h5>
<div class="outline-text-5" id="text-orgf1183ab">
<p>
New function that moves up to the parent directory and at the same
time preselects the current directory. This is useful for moving up
and down a file tree quickly.
</p>

<p>
See <a href="https://github.com/abo-abo/swiper/issues/343">#343</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-orga24f654" class="outline-5">
<h5 id="orga24f654">Customize <code>M-n</code> action</h5>
<div class="outline-text-5" id="text-orga24f654">
<p>
This feature allows to quickly visit Github issues from either
<code>magit-commit-mode</code> or from a version-controlled file. The point has to
be at the "#" char in e.g. "<a href="https://github.com/abo-abo/swiper/issues/123">#123</a>", that represents an issue.
</p>

<p>
It's possible to customize <code>ivy-ffap-url-functions</code> to do a similar
thing for places other than Github.
</p>

<p>
The <kbd>C-x C-f M-n</kbd> key binding will work better with <code>counsel-find-file</code>,
for plain <code>find-file</code> it will open a <code>dired</code> buffer in addition to opening
the URL.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org5d0c441" class="outline-5">
<h5 id="org5d0c441">Can un-ignore dotfiles with a leading dot input</h5>
<div class="outline-text-5" id="text-org5d0c441">
<p>
When <code>ivy-text</code> starts with a dot, don't use
<code>counsel-find-file-ignore-regexp</code>. The generic way to do this is with
<kbd>C-c C-a</kbd> (<code>ivy-toggle-ignore</code>), but this is faster and more convenient.
</p>

<p>
See <a href="https://github.com/abo-abo/swiper/issues/408">#408</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-orgbf0c506" class="outline-5">
<h5 id="orgbf0c506">Bind <kbd>M-o f</kbd> to <code>find-file-other-window</code></h5>
</div>
<div id="outline-container-org5dcd98a" class="outline-5">
<h5 id="org5dcd98a">Correctly expand file name at point</h5>
<div class="outline-text-5" id="text-org5dcd98a">
<p>
See <a href="https://github.com/abo-abo/swiper/issues/430">#430</a>.
</p>
<hr  />
</div>
</div>
