doc/Changelog.org
**** Add display transformer
See [[https://github.com/abo-abo/swiper/issues/458][#458]].
-----
**** Add magic slash that changes the directory
Update to the behavior: the slash ("/") will enter a directory even if
its name isn't completely typed out if either:

1. It's the only candidate.
2. The candidate index isn't 0, i.e. "C-n" has been typed at least once.
3. The input isn't "/".

The above rules still allow to keep the old behavior with "//" moving
to root and "/ssh:" opening tramp.

This is an experimental feature, please report if it breaks someone's
workflow.

See [[https://github.com/abo-abo/swiper/issues/321][#321]] and [[https://github.com/abo-abo/swiper/issues/480][#480]].
-----
*** =counsel-git-grep=
:PROPERTIES:
:CUSTOM_ID: 0-8-0-nf-counsel-git-grep
:END:
**** Bind ~C-c C-m~ to =counsel-git-grep-switch-cmd=
The initial command always runs on all files.

To run only on *.el files, ~C-c C-m~ followed by ~M-i~ =-- *.el=.
To run on *.c and *.h files, ~C-c C-m~ followed by ~M-i~ =-- *.c *.h=.
To switch to all files again, ~C-c C-m~ and select the appropriate
entry.

See [[https://github.com/abo-abo/swiper/issues/420][#420]].
-----
*** =counsel-locate=
:PROPERTIES:
:CUSTOM_ID: 0-8-0-nf-counsel-locate
:END:
**** counsel-locate-cmd
New defcustom that replaces =counsel-locate-options=.

See [[https://github.com/abo-abo/swiper/issues/385][#385]].
-----
**** counsel-locate-cmd-mdfind
New function.
See [[https://github.com/abo-abo/swiper/issues/390][#390]].
-----
**** counsel-locate-cmd-es
New function.
See [[https://github.com/abo-abo/swiper/issues/426][#426]].
-----
*** =counsel-yank-pop=
:PROPERTIES:
:CUSTOM_ID: 0-8-0-nf-counsel-yank-pop
:END:
**** Truncate during display
During the completion, only the context around the match will be shown.
By default, the context is +2 lines above and +2 lines below the match.
It can be adjusted with =counsel-yank-pop-truncate-radius=.
Additionally, =ivy-height= is temporarily bound to 5 during completion.
This way, the maximum minibuffer height should be 1+4*5=21 lines.

See [[https://github.com/abo-abo/swiper/issues/315][#315]].
-----
*** =counsel-unicode-char=
:PROPERTIES:
:CUSTOM_ID: 0-8-0-nf-counsel-unicode-char
:END:
Display hex codes in left column.
-----
*** =counsel-rhythmbox=
:PROPERTIES:
:CUSTOM_ID: 0-8-0-nf-counsel-rhythmbox
:END:
**** Preselect the current song
-----
*** =counsel-ag=
:PROPERTIES:
:CUSTOM_ID: 0-8-0-nf-counsel-ag
:END:
**** =counsel-ag-base-command=
Allows the command run by =counsel-ag-function= to be customized. There
are several reasons to allow this: The vimgrep option is a recent
addition; on windows it's more convenient to use pt; and the user
might want to customize ignored files.

Standard value:
#+begin_src elisp
(setq counsel-ag-base-command "ag --nocolor --nogroup %s -- .")
#+end_src

See [[https://github.com/abo-abo/swiper/issues/335][#335]].
-----
**** Add dir prompt for ~C-u~
See [[https://github.com/abo-abo/swiper/issues/429][#429]].
-----
**** Add =counsel-ag-map=
See [[https://github.com/abo-abo/swiper/issues/462][#462]].
-----
*** =counsel-async-split-string-re=
:PROPERTIES:
:CUSTOM_ID: 0-8-0-nf-counsel-async-split-string-re
:END:
New defcustom.
-----
*** =counsel--async-cmd=
:PROPERTIES:
:CUSTOM_ID: 0-8-0-nf-counsel--async-cmd
:END:
**** Add optional exit-code table
This argument can be used to associate exit codes with the underlying
reason. Used in counsel-ag-function to signal that an exit code of 1
means that no matches were found.

See [[https://github.com/abo-abo/swiper/issues/421][#421]].
-----
*** =counsel-prompt-function=
:PROPERTIES:
:CUSTOM_ID: 0-8-0-nf-counsel-prompt-function
:END:
New defcustom

See [[https://github.com/abo-abo/swiper/issues/424][#424]] and [[https://github.com/abo-abo/swiper/issues/425][#425]].
-----
*** =counsel-grep=
:PROPERTIES:
:CUSTOM_ID: 0-8-0-nf-counsel-grep
:END:
**** Reveal outlines
Just like =swiper=.
-----
**** Should pick candidates closest to point
Fixes the algorithm selecting the first matching candidate in case
there are 0 matching candidates following point. Now the last matching
candidate will be selected, resulting in less scrolling.
-----
**** Speed up x40 times
The default shell command will not use =--ignore-case= switch for
=grep=. It's a bit less convenient, but results in a huge speed-up.
-----
*** =counsel-M-x=
:PROPERTIES:
:CUSTOM_ID: 0-8-0-nf-counsel-m-x
:END:
**** Add help action
Bound to ~M-o h~ by default.

See [[https://github.com/abo-abo/swiper/issues/452][#452]].
** New Commands
:PROPERTIES:
:CUSTOM_ID: 0-8-0-nf-new-commands
:END:
*** =counsel-tmm=
:PROPERTIES:
:CUSTOM_ID: 0-8-0-nc-counsel-tmm
:END:
Completion for the menu bar items. For example:

=counsel-tmm= -> =Options= -> =Set Default Font...=.

Thanks to completion, the latter stages of the chain would look like: =op= ~RET~ =set= ~RET~.
-----
*** =counsel-imenu=
:PROPERTIES:
:CUSTOM_ID: 0-8-0-nc-counsel-imenu
:END:
Jump to a buffer position indexed by imenu.
-----
*** =counsel-decbinds=
:PROPERTIES:
:CUSTOM_ID: 0-8-0-nc-counsel-decbinds
:END:
Show a list of all defined keys, and their definitions. Describe the
selected candidate.
See [[https://github.com/abo-abo/swiper/issues/332][#332]].
-----
