Changelog.html
<div id="outline-container-orga526d59" class="outline-5">
<h5 id="orga526d59">Add display transformer</h5>
<div class="outline-text-5" id="text-orga526d59">
<p>
See <a href="https://github.com/abo-abo/swiper/issues/458">#458</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org4088bd" class="outline-5">
<h5 id="org4088bd">Add magic slash that changes the directory</h5>
<div class="outline-text-5" id="text-org4088bd">
<p>
Update to the behavior: the slash ("/") will enter a directory even if
its name isn't completely typed out if either:
</p>

<ol class="org-ol">
<li>It's the only candidate.</li>
<li>The candidate index isn't 0, i.e. "C-n" has been typed at least once.</li>
<li>The input isn't "/".</li>
</ol>

<p>
The above rules still allow to keep the old behavior with "//" moving
to root and "/ssh:" opening tramp.
</p>

<p>
This is an experimental feature, please report if it breaks someone's
workflow.
</p>

<p>
See <a href="https://github.com/abo-abo/swiper/issues/321">#321</a> and <a href="https://github.com/abo-abo/swiper/issues/480">#480</a>.
</p>
<hr  />
</div>
</div>
</div>
<div id="outline-container-org59ae5a7" class="outline-4">
<h4 id="0-8-0-nf-counsel-git-grep"><a id="org59ae5a7"></a><code>counsel-git-grep</code></h4>
<div class="outline-text-4" id="text-0-8-0-nf-counsel-git-grep">
</div>
<div id="outline-container-orgff77a14" class="outline-5">
<h5 id="orgff77a14">Bind <kbd>C-c C-m</kbd> to <code>counsel-git-grep-switch-cmd</code></h5>
<div class="outline-text-5" id="text-orgff77a14">
<p>
The initial command always runs on all files.
</p>

<p>
To run only on *.el files, <kbd>C-c C-m</kbd> followed by <kbd>M-i</kbd> <code>-- *.el</code>.
To run on *.c and *.h files, <kbd>C-c C-m</kbd> followed by <kbd>M-i</kbd> <code>-- *.c *.h</code>.
To switch to all files again, <kbd>C-c C-m</kbd> and select the appropriate
entry.
</p>

<p>
See <a href="https://github.com/abo-abo/swiper/issues/420">#420</a>.
</p>
<hr  />
</div>
</div>
</div>
<div id="outline-container-orgebeda14" class="outline-4">
<h4 id="0-8-0-nf-counsel-locate"><a id="orgebeda14"></a><code>counsel-locate</code></h4>
<div class="outline-text-4" id="text-0-8-0-nf-counsel-locate">
</div>
<div id="outline-container-org2ab4513" class="outline-5">
<h5 id="org2ab4513">counsel-locate-cmd</h5>
<div class="outline-text-5" id="text-org2ab4513">
<p>
New defcustom that replaces <code>counsel-locate-options</code>.
</p>

<p>
See <a href="https://github.com/abo-abo/swiper/issues/385">#385</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-orgda8e845" class="outline-5">
<h5 id="orgda8e845">counsel-locate-cmd-mdfind</h5>
<div class="outline-text-5" id="text-orgda8e845">
<p>
New function.
See <a href="https://github.com/abo-abo/swiper/issues/390">#390</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org1dab4ca" class="outline-5">
<h5 id="org1dab4ca">counsel-locate-cmd-es</h5>
<div class="outline-text-5" id="text-org1dab4ca">
<p>
New function.
See <a href="https://github.com/abo-abo/swiper/issues/426">#426</a>.
</p>
<hr  />
</div>
</div>
</div>
<div id="outline-container-orge3e29c9" class="outline-4">
<h4 id="0-8-0-nf-counsel-yank-pop"><a id="orge3e29c9"></a><code>counsel-yank-pop</code></h4>
<div class="outline-text-4" id="text-0-8-0-nf-counsel-yank-pop">
</div>
<div id="outline-container-org6ee467d" class="outline-5">
<h5 id="org6ee467d">Truncate during display</h5>
<div class="outline-text-5" id="text-org6ee467d">
<p>
During the completion, only the context around the match will be shown.
By default, the context is +2 lines above and +2 lines below the match.
It can be adjusted with <code>counsel-yank-pop-truncate-radius</code>.
Additionally, <code>ivy-height</code> is temporarily bound to 5 during completion.
This way, the maximum minibuffer height should be 1+4*5=21 lines.
</p>

<p>
See <a href="https://github.com/abo-abo/swiper/issues/315">#315</a>.
</p>
<hr  />
</div>
</div>
</div>
<div id="outline-container-org76d18b6" class="outline-4">
<h4 id="0-8-0-nf-counsel-unicode-char"><a id="org76d18b6"></a><code>counsel-unicode-char</code></h4>
<div class="outline-text-4" id="text-0-8-0-nf-counsel-unicode-char">
<p>
Display hex codes in left column.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org6a42717" class="outline-4">
<h4 id="0-8-0-nf-counsel-rhythmbox"><a id="org6a42717"></a><code>counsel-rhythmbox</code></h4>
<div class="outline-text-4" id="text-0-8-0-nf-counsel-rhythmbox">
</div>
<div id="outline-container-org503f770" class="outline-5">
<h5 id="org503f770">Preselect the current song</h5>
<div class="outline-text-5" id="text-org503f770">
<hr  />
</div>
</div>
</div>
<div id="outline-container-org85a0707" class="outline-4">
<h4 id="0-8-0-nf-counsel-ag"><a id="org85a0707"></a><code>counsel-ag</code></h4>
<div class="outline-text-4" id="text-0-8-0-nf-counsel-ag">
</div>
<div id="outline-container-org30acc0" class="outline-5">
<h5 id="org30acc0"><code>counsel-ag-base-command</code></h5>
<div class="outline-text-5" id="text-org30acc0">
<p>
Allows the command run by <code>counsel-ag-function</code> to be customized. There
are several reasons to allow this: The vimgrep option is a recent
addition; on windows it's more convenient to use pt; and the user
might want to customize ignored files.
</p>

<p>
Standard value:
</p>
<div class="org-src-container">

<pre class="src src-elisp">(<span style="color: #7F0055; font-weight: bold;">setq</span> counsel-ag-base-command <span style="color: #2A00FF;">"ag --nocolor --nogroup %s -- ."</span>)
</pre>
</div>

<p>
See <a href="https://github.com/abo-abo/swiper/issues/335">#335</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org5f39446" class="outline-5">
<h5 id="org5f39446">Add dir prompt for <kbd>C-u</kbd></h5>
<div class="outline-text-5" id="text-org5f39446">
<p>
See <a href="https://github.com/abo-abo/swiper/issues/429">#429</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org5d0e67b" class="outline-5">
<h5 id="org5d0e67b">Add <code>counsel-ag-map</code></h5>
<div class="outline-text-5" id="text-org5d0e67b">
<p>
See <a href="https://github.com/abo-abo/swiper/issues/462">#462</a>.
</p>
<hr  />
</div>
</div>
</div>
<div id="outline-container-org2fcfc6e" class="outline-4">
<h4 id="0-8-0-nf-counsel-async-split-string-re"><a id="org2fcfc6e"></a><code>counsel-async-split-string-re</code></h4>
<div class="outline-text-4" id="text-0-8-0-nf-counsel-async-split-string-re">
<p>
New defcustom.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org4aa0855" class="outline-4">
<h4 id="0-8-0-nf-counsel--async-cmd"><a id="org4aa0855"></a><code>counsel--async-cmd</code></h4>
<div class="outline-text-4" id="text-0-8-0-nf-counsel--async-cmd">
</div>
<div id="outline-container-orgbb92855" class="outline-5">
<h5 id="orgbb92855">Add optional exit-code table</h5>
<div class="outline-text-5" id="text-orgbb92855">
<p>
This argument can be used to associate exit codes with the underlying
reason. Used in counsel-ag-function to signal that an exit code of 1
means that no matches were found.
</p>

<p>
See <a href="https://github.com/abo-abo/swiper/issues/421">#421</a>.
</p>
<hr  />
</div>
</div>
</div>
<div id="outline-container-orgf79ff12" class="outline-4">
<h4 id="0-8-0-nf-counsel-prompt-function"><a id="orgf79ff12"></a><code>counsel-prompt-function</code></h4>
<div class="outline-text-4" id="text-0-8-0-nf-counsel-prompt-function">
<p>
New defcustom
</p>

<p>
See <a href="https://github.com/abo-abo/swiper/issues/424">#424</a> and <a href="https://github.com/abo-abo/swiper/issues/425">#425</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org4c604d5" class="outline-4">
<h4 id="0-8-0-nf-counsel-grep"><a id="org4c604d5"></a><code>counsel-grep</code></h4>
<div class="outline-text-4" id="text-0-8-0-nf-counsel-grep">
</div>
<div id="outline-container-org5d787fa" class="outline-5">
<h5 id="org5d787fa">Reveal outlines</h5>
<div class="outline-text-5" id="text-org5d787fa">
<p>
Just like <code>swiper</code>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-orgcb24f7a" class="outline-5">
<h5 id="orgcb24f7a">Should pick candidates closest to point</h5>
<div class="outline-text-5" id="text-orgcb24f7a">
<p>
Fixes the algorithm selecting the first matching candidate in case
there are 0 matching candidates following point. Now the last matching
candidate will be selected, resulting in less scrolling.
</p>
<hr  />
</div>
</div>
<div id="outline-container-orgfbb6456" class="outline-5">
<h5 id="orgfbb6456">Speed up x40 times</h5>
<div class="outline-text-5" id="text-orgfbb6456">
<p>
The default shell command will not use <code>--ignore-case</code> switch for
<code>grep</code>. It's a bit less convenient, but results in a huge speed-up.
</p>
<hr  />
</div>
</div>
</div>
<div id="outline-container-orgce50190" class="outline-4">
<h4 id="0-8-0-nf-counsel-m-x"><a id="orgce50190"></a><code>counsel-M-x</code></h4>
<div class="outline-text-4" id="text-0-8-0-nf-counsel-m-x">
</div>
<div id="outline-container-org989548a" class="outline-5">
<h5 id="org989548a">Add help action</h5>
<div class="outline-text-5" id="text-org989548a">
<p>
Bound to <kbd>M-o h</kbd> by default.
</p>

<p>
See <a href="https://github.com/abo-abo/swiper/issues/452">#452</a>.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-orgb3464b1" class="outline-3">
<h3 id="0-8-0-nf-new-commands"><a id="orgb3464b1"></a>New Commands</h3>
<div class="outline-text-3" id="text-0-8-0-nf-new-commands">
</div>
<div id="outline-container-org87ff520" class="outline-4">
<h4 id="0-8-0-nc-counsel-tmm"><a id="org87ff520"></a><code>counsel-tmm</code></h4>
<div class="outline-text-4" id="text-0-8-0-nc-counsel-tmm">
<p>
Completion for the menu bar items. For example:
</p>

<p>
<code>counsel-tmm</code> -&gt; <code>Options</code> -&gt; <code>Set Default Font...</code>.
</p>

<p>
Thanks to completion, the latter stages of the chain would look like: <code>op</code> <kbd>RET</kbd> <code>set</code> <kbd>RET</kbd>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org4afa61e" class="outline-4">
<h4 id="0-8-0-nc-counsel-imenu"><a id="org4afa61e"></a><code>counsel-imenu</code></h4>
<div class="outline-text-4" id="text-0-8-0-nc-counsel-imenu">
<p>
Jump to a buffer position indexed by imenu.
</p>
<hr  />
</div>
</div>
<div id="outline-container-orgd2d5f88" class="outline-4">
<h4 id="0-8-0-nc-counsel-decbinds"><a id="orgd2d5f88"></a><code>counsel-decbinds</code></h4>
<div class="outline-text-4" id="text-0-8-0-nc-counsel-decbinds">
<p>
Show a list of all defined keys, and their definitions. Describe the
selected candidate.
See <a href="https://github.com/abo-abo/swiper/issues/332">#332</a>.
</p>
<hr  />
</div>
</div>
