doc/Changelog.org
*** =counsel-list-processes=
:PROPERTIES:
:CUSTOM_ID: 0-8-0-nc-counsel-list-processes
:END:
Offer completion for =process-list=

The default action deletes the selected process.  An extra action
allows to switch to the process buffer.

See [[https://github.com/abo-abo/swiper/issues/357][#357]] and [[https://github.com/abo-abo/swiper/issues/398][#398]].
-----
*** =ivy-switch-buffer-other-window=
:PROPERTIES:
:CUSTOM_ID: 0-8-0-nc-ivy-switch-buffer-other-window
:END:
Remap =switch-to-buffer-other-window= to =ivy-switch-buffer-other-window= for =ivy-mode=.

See [[https://github.com/abo-abo/swiper/issues/361][#361]].
-----
*** =counsel-git-stash=
:PROPERTIES:
:CUSTOM_ID: 0-8-0-nc-counsel-git-stash
:END:
Search through all available git stashes.

See [[https://github.com/abo-abo/swiper/issues/374][#374]].
-----
*** =counsel-git-log=
:PROPERTIES:
:CUSTOM_ID: 0-8-0-nc-counsel-git-log
:END:
Call the =git log --grep= shell command and search through the output.
-----
*** =counsel-pt=
:PROPERTIES:
:CUSTOM_ID: 0-8-0-nc-counsel-pt
:END:
Grep for a string in the current directory using pt.

See [[https://github.com/abo-abo/swiper/issues/434][#434]].
-----
*** =counsel-linux-app=
:PROPERTIES:
:CUSTOM_ID: 0-8-0-nc-counsel-linux-app
:END:
Launch a Linux desktop application, similar to Alt-<F2>.

See [[https://github.com/abo-abo/swiper/issues/446][#446]].
-----
*** =counsel-ace-link=
:PROPERTIES:
:CUSTOM_ID: 0-8-0-nc-counsel-ace-link
:END:
Ivy completion for =ace-link=.
-----
*** =counsel-esh-history=
:PROPERTIES:
:CUSTOM_ID: 0-8-0-nc-counsel-esh-history
:END:
Browse Eshell history.

See [[https://github.com/abo-abo/swiper/issues/459][#459]].
-----
*** =counsel-shell-history=
:PROPERTIES:
:CUSTOM_ID: 0-8-0-nc-counsel-shell-history
:END:
Browse shell history.
-----
*** =counsel-grep-or-swiper=
:PROPERTIES:
:CUSTOM_ID: 0-8-0-nc-counsel-grep-or-swiper
:END:
New command: automatically use =swiper= for smaller buffers and
=counsel-grep= for larger buffers.

Adjust with:
#+begin_src elisp
(setq counsel-grep-swiper-limit 300000)
#+end_src

By default, the splitting predicate is 300K bytes in a file.
-----
#+BEGIN_EXPORT html
<br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br>
<br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br>
<br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br>
#+END_EXPORT

