Changelog.html
<div id="outline-container-org754ff21" class="outline-4">
<h4 id="0-8-0-nc-counsel-list-processes"><a id="org754ff21"></a><code>counsel-list-processes</code></h4>
<div class="outline-text-4" id="text-0-8-0-nc-counsel-list-processes">
<p>
Offer completion for <code>process-list</code>
</p>

<p>
The default action deletes the selected process.  An extra action
allows to switch to the process buffer.
</p>

<p>
See <a href="https://github.com/abo-abo/swiper/issues/357">#357</a> and <a href="https://github.com/abo-abo/swiper/issues/398">#398</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org1bd5b92" class="outline-4">
<h4 id="0-8-0-nc-ivy-switch-buffer-other-window"><a id="org1bd5b92"></a><code>ivy-switch-buffer-other-window</code></h4>
<div class="outline-text-4" id="text-0-8-0-nc-ivy-switch-buffer-other-window">
<p>
Remap <code>switch-to-buffer-other-window</code> to <code>ivy-switch-buffer-other-window</code> for <code>ivy-mode</code>.
</p>

<p>
See <a href="https://github.com/abo-abo/swiper/issues/361">#361</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org4f4438c" class="outline-4">
<h4 id="0-8-0-nc-counsel-git-stash"><a id="org4f4438c"></a><code>counsel-git-stash</code></h4>
<div class="outline-text-4" id="text-0-8-0-nc-counsel-git-stash">
<p>
Search through all available git stashes.
</p>

<p>
See <a href="https://github.com/abo-abo/swiper/issues/374">#374</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org73df587" class="outline-4">
<h4 id="0-8-0-nc-counsel-git-log"><a id="org73df587"></a><code>counsel-git-log</code></h4>
<div class="outline-text-4" id="text-0-8-0-nc-counsel-git-log">
<p>
Call the <code>git log --grep</code> shell command and search through the output.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org2644e2d" class="outline-4">
<h4 id="0-8-0-nc-counsel-pt"><a id="org2644e2d"></a><code>counsel-pt</code></h4>
<div class="outline-text-4" id="text-0-8-0-nc-counsel-pt">
<p>
Grep for a string in the current directory using pt.
</p>

<p>
See <a href="https://github.com/abo-abo/swiper/issues/434">#434</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-orge606f30" class="outline-4">
<h4 id="0-8-0-nc-counsel-linux-app"><a id="orge606f30"></a><code>counsel-linux-app</code></h4>
<div class="outline-text-4" id="text-0-8-0-nc-counsel-linux-app">
<p>
Launch a Linux desktop application, similar to Alt-&lt;F2&gt;.
</p>

<p>
See <a href="https://github.com/abo-abo/swiper/issues/446">#446</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-orgbdb55d9" class="outline-4">
<h4 id="0-8-0-nc-counsel-ace-link"><a id="orgbdb55d9"></a><code>counsel-ace-link</code></h4>
<div class="outline-text-4" id="text-0-8-0-nc-counsel-ace-link">
<p>
Ivy completion for <code>ace-link</code>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org5ed07c5" class="outline-4">
<h4 id="0-8-0-nc-counsel-esh-history"><a id="org5ed07c5"></a><code>counsel-esh-history</code></h4>
<div class="outline-text-4" id="text-0-8-0-nc-counsel-esh-history">
<p>
Browse Eshell history.
</p>

<p>
See <a href="https://github.com/abo-abo/swiper/issues/459">#459</a>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org12906bb" class="outline-4">
<h4 id="0-8-0-nc-counsel-shell-history"><a id="org12906bb"></a><code>counsel-shell-history</code></h4>
<div class="outline-text-4" id="text-0-8-0-nc-counsel-shell-history">
<p>
Browse shell history.
</p>
<hr  />
</div>
</div>
<div id="outline-container-org1a634ba" class="outline-4">
<h4 id="0-8-0-nc-counsel-grep-or-swiper"><a id="org1a634ba"></a><code>counsel-grep-or-swiper</code></h4>
<div class="outline-text-4" id="text-0-8-0-nc-counsel-grep-or-swiper">
<p>
New command: automatically use <code>swiper</code> for smaller buffers and
<code>counsel-grep</code> for larger buffers.
</p>

<p>
Adjust with:
</p>
<div class="org-src-container">

<pre class="src src-elisp">(<span style="color: #7F0055; font-weight: bold;">setq</span> counsel-grep-swiper-limit 300000)
</pre>
</div>

<p>
By default, the splitting predicate is 300K bytes in a file.
</p>
<hr  />
<br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br>
<br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br>
<br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
